{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":6,"SearchResultCountAll":6,"SearchResultItems":[{"MatchedObjectId":"646141300","MatchedObjectDescriptor":{"PositionID":"DE-11357611-22-SB","PositionTitle":"SUPV FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/646141300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/646141300?PostingChannelID="],"PositionLocationDisplay":"Arlington, Virginia","PositionLocation":[{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051}],"OrganizationName":"Office of the Secretary of Defense","DepartmentName":"Department of Defense","SubAgency":"Defense POW/MIA Accounting Agency","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"For qualifications determinations your resume must contain the dates of employment for each position listed on your resume (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application will be marked as incomplete and you will not receive consideration for this position. It is recommended that applicants also include their hours worked per week for each employment listed on their resume. Read more about what should I include in my federal resume? at https://www.usajobs.gov/Help/faq/application/documents/resume/what-to-include/ Basic Requirements: A. Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR B. Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. OR C. Experience: four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. In addition to meeting the basic education requirement above, you must meet the specialized experience requirements below: You may qualify at the GS-14 level, if you fulfill the following qualification requirement: One year of specialized experience equivalent to the GS-13 grade level in the Federal service (experience may have been gained in the private sector) that demonstrates your ability in: developing and implementing U.S. and DoD policy associated with American POW/MIA affairs from past conflicts involving the Soviet Union, including knowledge of U.S. Government interagency processes and Russian government priorities and processes. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. ACTIVE DUTY SERVICE MEMBERS: The VOW Act Chapter 21 of Title 5, United States Code (U.S.C.), Section 2108a, requires Federal agencies treat active duty service member as veterans, disabled veterans, and preference eligible, when they submit, at the time they apply for a Federal job, a \"certification\" of active service in lieu of a DD-214, assuming the service member is otherwise eligible. A \"certification\" letter should be on letterhead of the appropriate military branch of the service and contain (1) the military service dates including the expected discharge or release date; and (2) the character of service. The service member's military service dates are necessary in order to determine whether he or she meets the definition of \"veteran\" under 5 U.S.C. 2108(1). The \"certification\" must reflect the service member is expected to be discharged or released from active duty service in the armed forces under honorable conditions not later than 120 days after the date of submission. The \"certification\" must be signed by, or by direction of, the adjutant, personnel officer, or commander of your unit or higher headquarters and must indicate when your terminal leave will begin (if applicable), your rank, dates of active duty service, the type of discharge and character of service (i.e. honorable). Further, under paragraph (h) of the rule, agencies are required to verify a qualifying separation from military service prior to appointment, through the DD-214 or other appropriate documentation. Your preference and/or appointment eligibility will be verified prior to appointment. Active duty members that fail to provide a valid \"certification\" of service with their initial application will be found \"not eligible.\" Military members may be appointed before the effective date of their military retirement/separation if member is on terminal leave. Current or Former Political Appointees: Beginning January 1, 2010, agencies must seek prior approval from OPM before they can appoint a current or recent political appointee to a competitive or non-political excepted service position at any level under the provisions of title 5, United States Code. If you are currently or have been within the last 5 years, a political Schedule A, Schedule C, or Non-career SES employee in the executive branch, you MUST disclose that to the Human Resources Office. Submit a copy of your applicable SF-50, along with a statement that provides the following information regarding your most recent political appointment: Position title; Type of appointment (Schedule A, Schedule C, Non-career SES, or Presidential Appointee); Agency; and, Beginning and ending dates of appointment. All qualifications and education requirements must be met by the closing date of this announcement and clearly documented in your resume.","PositionRemuneration":[{"MinimumRange":"126233.0","MaximumRange":"164102.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-31T00:00:00.0000","PositionEndDate":"2022-04-13T23:59:59.9970","PublicationStartDate":"2022-03-31T00:00:00.0000","ApplicationCloseDate":"2022-04-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Under the direction of the Secretary of Defense and the Undersecretary of Defense for Policy (USD(P)), and pursuant to the 2015 National Defense Authorization Act (NDAA), the Defense Prisoner of War/Missing Personnel Office, the Joint POW/MIA Accounting Command, and the Life Sciences Equipment Laboratory were combined in January, 2015, into a single defense agency -- the Defense POW/MIA Accounting Agency (DPAA).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"None","SubAgencyName":"Defense POW/MIA Accounting Agency","OrganizationCodes":"DD/DD01","Relocation":"False","HiringPath":["fed-transition","mspouse","public","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"The Office of the Secretary of Defense (OSD) is the principal staff element of the Secretary of Defense in the exercise of policy development, planning, resource management, fiscal, and program evaluation responsibilities. OSD includes the immediate offices of the Secretary and Deputy Secretary of Defense, Under Secretaries of Defense, Director of Defense Research and Engineering, Assistant Secretaries of Defense, General Counsel, Director of Operational Test and Evaluation, Assistants to the Secretary of Defense, Director of Administration and Management, and such other staff offices as the Secretary establishes to assist in carrying out assigned responsibilities.","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Serves as the Chief of the Joint Commission Support Division (JCSD) and will provide leadership, direction, and oversight for the implementation of policy associated with Americans missing from past conflicts in which the former Soviet Union participated, as well as for those cases for which records of the former Soviet Union may provide additional details concerning the circumstances of loss and/or recovery of the missing personnel's remains. Incumbent typical work assignments may include the following: Initiates action on matters relating to research of these cases and provides support, as needed, through the Headquarters and Moscow offices of JCSD to the U.S. side of the U.S./Russia Joint Commission (USRJC) Serves as an adviser and consultant, applying extensive knowledge of U.S. and DoD policies as they pertain to POW/MIA affairs, which requires a thorough grasp of U.S. Government interagency processes and Russian government priorities and processes Manages the activities of civilian analysts, military officers, and enlisted staffs, including those assigned to DPAA's Moscow office, which includes a military officer and several Foreign Service Nationals, in the execution of the DPAA mission as it relates to researching archives and preparing supporting documentation through translation, and building teams to achieve the mission Plans and assigns work, advises on Agency program goals and objectives, makes decisions on work problems, and organizes and monitors the flow of work in order to achieve the most effective results within a complex environment Recommends selections on key positions and on personnel actions for recruitment, reassignment, promotion, reclassification, and other actions involving JCSD staff within the organization"],"Education":"Education cannot be substituted for experience for the GS-14 level. ARE YOU USING YOUR EDUCATION TO QUALIFY? You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. Unless otherwise stated: (1) official or unofficial transcripts are acceptable, or (2) you may submit a list with all of your courses, grades, semester, year, and credit for the course. All materials must be submitted by the closing date of the announcement. PASS/FAIL COURSES: If more than 10 percent of your undergraduate course work (credit hours) were taken on a pass/fail basis, your claim of superior academic achievement must be based upon class standing or membership in an honor society. GRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Requirements":"","Evaluations":"Once the announcement has closed, a review of your r&#233;sum&#233; and supporting documentation will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. All qualified candidates will be assigned to a quality category. The category assignment is a measure of the degree in which your background matches the competencies required for this position. Your qualifications will be evaluated based on your responses to the assessment questionnaire and the competencies listed below. The assessment questionnaire link can be found under the 'How To Apply' section. International Engagement Assessment & AnalysisInternational Engagement ImplementationInternational Engagement Policy DevelopmentOral CommunicationSupervisionWriting For Category Rating: Once the application process is complete, a review of your resume and supporting documentation will be made and compared against your responses to the assessment questionnaire to determine if you are qualified for this job. If, after reviewing your resume and or supporting documentation, a determination is made that you have inflated your qualifications and or experience, you may lose consideration for this position. Please follow all instructions carefully. Errors or omissions may affect your eligibility. Qualified candidates will be assigned to one of the three quality categories: Qualified, Highly Qualified, or Best Qualified. Qualified Category = Does not exceed the basic qualifications requirements described in the \"Qualifications\" section of this announcement. Highly Qualified Category = Meets the basic qualifications requirements described in the \"Qualifications\" section of this announcement and demonstrates proficiency in the Critical Competencies defined below. Best Qualified Category = Meets the basic qualifications requirements described in the \"Qualifications\" section of this announcement and excels in the Critical Competencies defined below. The category assignment is a measure of the degree in which your background matches the competencies required for this position. The Category Rating Process does not add veterans' preference points or apply the \"rule of three\" but protects the rights of Veterans by placing them ahead of non-preference eligibles within each quality category. Veterans' preference eligibles who meet the minimum qualification requirements and who have a compensable service-connected disability of at least 10 percent will be listed in the highest quality category (except in the case of scientific or professional positions at the GS-09 level or higher).","HowToApply":"To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below. A complete application package must be submitted by 11:59 PM (EST) on the closing date of the announcement (04/13/2022) to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. To view the assessment questionnaire, click here: https://apply.usastaffing.gov/ViewQuestionnaire/11357611 To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login) all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant. Washington Headquarters Services provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please view the \"Alternate Application\" method listed in the \"Other Information\" section of this announcement. Your requests for reasonable accommodation will be addressed on a case-by-case basis. Please visit the following link for more information http://http://www.esd.whs.mil/Directives/issuances/admin_inst/ COVID-19 Vaccination: To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to E.O. 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.","WhatToExpectNext":"Once your online application is submitted you will receive a confirmation notification by email. Your application will be evaluated by the Human Resources Office to determine your eligibility for the position. After the evaluation is complete, you will receive another notification regarding the status of your application. Stay informed of changes to your application status by signing up for automatic email alerts at: https://www.usajobs.gov/Applicant/Application/ListApplications? Washington Headquarters Services is an Equal Employment Opportunity employer.","RequiredDocuments":"YOU ARE REQUIRED TO DOCUMENT IN YOUR APPLICATION PACKAGE EVIDENCE THAT SUPPORTS YOUR ELIGIBILITY AND QUALIFICATION CLAIMS. You MUST upload the applicable documents with your application package. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume may be submitted in any format that includes your name and contact information (telephone number and/or email).\nIf you submit more than one copy of your resume, only the most recent version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you will not be considered for this vacancy. 2. Other supporting documents: Cover Letter, optional Most recent SF-50, \"Notification of Personnel Action\" showing you are/were in the competitive service and the highest grade held (WHS serviced employees SF-50s will be verified via eOPF). College Transcript(s), if qualifying based on education. Official or unofficial transcripts are acceptable. (WHS serviced employees will be verified via eOPF or you may include them in your application package. However, it is the employee's responsibility to ensure that his/her eOPF contains the required transcript and is up-to-date). DD-214, SF-15 Form and VA letter, or certification of expected discharge or release from active duty from Veterans for consideration under Veteran hiring authorities Noncompetitive appointment authority documentation, if applicable Career Transition Assistance Program/Interagency Career Transition Assistance Program documentation, if applicable (e.g., Certification of Expected Separation, Reduction-In-Force Separation Notice, or Notice of Proposed Removal; SF-50 that documents the RIF separation action; and most recent performance appraisal.) PPP Registrants/Eligibles: Must submit the following applicable documents: 1) PPP registration 2) PCS orders (if applicable) ARE YOU QUALIFYING BASED ON EDUCATION or A COMBINATION OF EDUCATION AND EXPERIENCE?\nYou must provide sufficient documentation of your education in your resume. You are required to provide a copy of transcripts or degrees in your application package. It is also acceptable to document your applicable course listing in your resume (course number, credits earned, etc.). Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html. All education claimed by applicants will be verified by the appointing agency accordingly. If selected, an official/sealed transcript will be required prior to appointment. ARE YOU A VETERAN CLAIMING SOLE SURVIVORSHIP PREFERENCE OR 5-POINT VETERANS' PREFERENCE?\n1. You must provide legible copy/copies of the following: DD-214, \"Certificate of Release or Discharge from Active Duty,\" showing all dates of service, as well as type of discharge and character of service (Honorable, General, etc.) or Statement of Service/Proof of Service (in lieu of a DD-214) from your command or local Personnel Support Detachment (PSD). The Statement of Service/Proof of Service must provide all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Veterans should upload their DD-214 once they receive it upon separation.\n2. You should also document your complete military service information in the Veterans Preference and Military Service Section of the assessment questionnaire (type of preference, dates of service, date of VA letter, character of service, disability claim and rank and date of retirement if retired). ARE YOU A DISABLED VETERAN or CLAIMING 10-POINT VETERANS' PREFERENCE?\n1. Disabled veterans, veterans, widows, spouses or the mother of a veteran, who are eligible for 10-point veterans' preference, you must provide legible copies of the following: Applicable supporting documents as noted on Standard Form-15 (SF-15). To obtain a copy of SF-15, go to: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/veterans/","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"PPP PILOT: The Washington Headquarters Service is currently operating under an approved reengineered Priority Placement Program (PPP) pilot for all positions in its serviced workforce. This pilot is application based and current PPP registrants who are registered for activity codes 293A and 295A (regardless of the location) are required to apply to the job announcement via USAJobs in order to exercise their priority placement status. This pilot permits priority candidates to be assessed with other competitive applicants. Anyone claiming priority status must provide a copy of their PPP registration and supporting documentation (e.g. RIF notice, Certification of Expected Separation) at the time of application to verify priority placement and eligibility. MILITARY SPOUSE PREFERENCE: Military spouse preference applicants are required to apply to job announcement via USAJobs in order to exercise their preference status. The application must include signed Military Spouse PPP Self-Certification Checklist, Marriage Certificate or License, Sponsor's PCS orders at the time of application to be considered Other priority consideration programs will continue under their current operating procedures. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online, you must request an alternative application. Please view the following link for information on how to obtain an alternative application https://help.usastaffing.gov/Apply/index.php?%20title=Alternate_Application_Information Appointment Authorities: For more information on appointment authority eligibility requirements: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/individuals-with-disabilities/ https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/veterans/ https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/military-spouses/ Other Special Appointment Authorities https://www.usajobs.gov/ Interchange Agreements https://www.opm.gov/policy-data-oversight/hiring-information/competitive-hiring/#url=Types-of-Appointments Career Transition Assistance Programs: These programs apply to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: (1) meet CTAP or ICTAP eligibility criteria; (2) be rated well-qualified for the position with a score of 85 or above; and, (3) submit the appropriate documentation to support your CTAP or ICTAP eligibility. For more information visit: https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/ Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. /www.esd.whs.mil/DD/DoD-Issuances/140025/ Nepotism: Under the provisions of 5 USC 3110, an individual may not be appointed into a position if the position is under the supervisory chain of command of a relative. Additional vacancies may be filled by this announcement.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"whs.job.application.assistance@mail.mil","AgencyContactPhone":"000-000-0000","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness","National security"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"639005100","MatchedObjectDescriptor":{"PositionID":"DE-11402506-22-IS","PositionTitle":"INTERPRETER (AMERICAN SIGN LANGUAGE)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639005100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639005100?PostingChannelID="],"PositionLocationDisplay":"Bremerton, Washington","PositionLocation":[{"LocationName":"Bremerton, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Bremerton, Washington","Longitude":-122.6257,"Latitude":47.565002}],"OrganizationName":"U.S. Pacific Fleet","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: performing simultaneous interpretation from spoken English into American Sign Language and from American Sign Language into spoken English. Additional qualification information can be found from the following Office of Personnel Management website:http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"73098.0","MaximumRange":"95022.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-24T00:00:00.0000","PositionEndDate":"2023-02-23T23:59:59.9970","PublicationStartDate":"2022-02-24T00:00:00.0000","ApplicationCloseDate":"2023-02-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. *Direct Hire Authority. See Additional Information section.*","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"11","PromotionPotential":"None","OrganizationCodes":"DD/NV70","Relocation":"True","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will facilitate communication for deaf/hard of hearing team members enabling them to fully participate in organizational activities.","You will provide interpreting services for daily work related activities, including worksite communication, appointments, meetings, training, and command events.","You will promote an understanding of deaf culture and provides training on relevant topics to employees, supervisors, and managers.","You will provide contracting and scheduling support for necessary supplemental services."],"Education":"** Education may be substituted for specialized experience as follows: A Ph.D. or equivalent doctoral degree; OR Three full years of progressively higher level graduate education leading to a Ph.D. or equivalent degree; OR An LL.M. degree in a field directly related to the position being filled; OR A combination of experience and graduate education as described above that equates to one year of experience.","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: brem_900a_admins.fct@navy.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers. NOTE: Due to COVID19, if you have any questions or need assistance, please email the DON Employment Information Center at DONEIC@navy.mil","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This announcement uses the Defense Industrial Base, Major Range and Test Facilities direct hire authority to recruit and appoint qualified candidates to certain positions in the competitive service. Must possess and maintain certification in one of the following: Registry of Interpreters for the Deaf (RID)/ National Interpreter Certification National Association of Deaf (NAD) Master Comprehensive Skills Certificate (CSC) Master Comprehensive Skills Certificate (MSCS) Certified Deaf Interpreter (CDI) Certificate of Interpretation (CI) Certificate of Transliteration (CT) COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is covered by the Department of Defense Priority Placement Program. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Veteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"robin.l.jones3@navy.mil","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"647909400","MatchedObjectDescriptor":{"PositionID":"SCEA226302922390","PositionTitle":"Language Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/647909400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/647909400?PostingChannelID="],"PositionLocationDisplay":"Fort Benning, Georgia","PositionLocation":[{"LocationName":"Fort Benning, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Fort Benning, Georgia","Longitude":-84.89964,"Latitude":32.344185}],"OrganizationName":"U.S. Army Training and Doctrine Command","DepartmentName":"Department of the Army","SubAgency":"WHINSEC, Directorate of Operations & Training Support, Translation Division","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. Current Department of Army Civilian EmployeesCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Defense Civilian Intelligence Personnel System (DCIPS) Interchange AgreementExecutive Order (E.O.) 12721Interagency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Appropriated Fund Instrumentality (NAFI)Non-Department of Defense (DoD) TransferPeople with Disabilities, Schedule APriority Placement Program, DoD Military Spouse Preference (MSP) EligibleReinstatementVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Specialized Experience for GS-11: One year of specialized experience equivalent to at least the GS-09 grade level in the Federal service which includes researching specialized terminology in Spanish or English using printed references, online material such as dictionaries (military, legal, intelligence, medical, engineering, satellite communications), research papers, reference manuals and journals. Or I have successfully completed a Ph.D or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree in a field which demonstrates the knowledge, skills, and abilities necessary to perform the work of the position, such as English and Spanish. (Note: You must attach a copy of your transcripts.) Or I have the specialized experience as described in A, but less than one year; and I have at least two years of graduate education as described in B, but less than the required three years. I have computed the percentage of the requirements that I meet, and the total is at least 100% (To compute the percentage, divide your total months of qualifying experience by 12. Then, divide your semester hours of graduate education beyond the second year (total graduate semester hours minus 36) by 18. Add the two percentages. The total percentage must equal at least 100 percent to qualify.). (Note: You must attach a copy of your transcripts.) Or I have the experience as described in A AND the education described in B. (Note: You must attach a copy of your transcripts.) Specialized Experience for GS-12: One year of specialized experience equivalent to the GS-11 grade level in the Federal service which includes editing machine translations, research to determine the meaning on highly specialized terminology, ensure course work has been translated correctly for use by the organization, conducts courses for linguists. To qualify for GS-12: Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted. You will be evaluated on the basis of your level of competency in the following areas:\nForeign LanguageListeningSpeakingTechnical Competence Time in Grade Requirement for GS-11: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-09). Time in Grade Requirement for GS-12: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11).","PositionRemuneration":[{"MinimumRange":"66214.0","MaximumRange":"103176.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-11T00:00:00.0000","PositionEndDate":"2022-04-15T23:59:59.9970","PublicationStartDate":"2022-04-11T00:00:00.0000","ApplicationCloseDate":"2022-04-15T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: This position is located at the Maneuver Center of Excellence (MCOE), Western Hemisphere Institute for Security Cooperation (WHINSEC) Ft. Benning, Georgia 31905. The \"Maneuver Center of Excellence\" is located 100 miles south of Atlanta and is adjacent to Columbus, Georgia and Phenix City, Alabama.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"12","PromotionPotential":"12","SubAgencyName":"WHINSEC, Directorate of Operations & Training Support, Translation Division","OrganizationCodes":"DD/ARTC","Relocation":"False","HiringPath":["fed-transition","fed-competitive","disability","land","mspouse","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army.","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Participate with Division supervisors/translators in discussions to come up with translation of difficult and modern terminology encountered by linguists in the course of their translations.","Edit machine translations and work translated or written by other translators and by International and U.S. military personnel, ensuring that such editing does not compromise writer's meaning and intent.","Research specialized terminology in printed references, on the Internet and by consulting international and U.S. subject matter experts for conversion into Spanish or English.","Use terminology in the translations which range from normal linguistic patterns to specialized military, professional, highly technical and scientific terminology.","Provide the full spectrum of translator services for the organization, installation, and Department of the Army (DA), Department of Defense (DoD).","Edit or correct machine translations","Translates claims for more current types of patents.","Translates patent applications, which include an unlimited number of subject.","Perform research to find correct terms.","Translates materials such as trademarks, articles for scientific publications, legal documents, books and letters from foreign patent commissioners and from citizens."],"Education":"If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 04/15/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11452390). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct Deposit of Pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. This is a Career Program (CP) 60 - Foreign Affairs/ Strategic Planning position. You may claim military spouse preference. If a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration. Multiple positions may be filled from this announcement. Salary includes applicable locality pay or Local Market Supplement. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy. Information may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"False","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"647843700","MatchedObjectDescriptor":{"PositionID":"SWEX226227088673D","PositionTitle":"Translator","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/647843700","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/647843700?PostingChannelID="],"PositionLocationDisplay":"Fort Leavenworth, Kansas","PositionLocation":[{"LocationName":"Fort Leavenworth, Kansas","CountryCode":"United States","CountrySubDivisionCode":"Kansas","CityName":"Fort Leavenworth, Kansas","Longitude":-94.921165,"Latitude":39.36402}],"OrganizationName":"U.S. Army Training and Doctrine Command","DepartmentName":"Department of the Army","SubAgency":"US Army Combined Arms Center (CAC), Military Review","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: US Citizens In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Basic Requirement for Translator: Graduate education with a major study in Brazilian Portuguese from an English-speaking college or university, English from a college or university in Brazil, or translating or interpreting where English and Brazilian Portuguese were prerequisites. (Note: You must attach a copy of your transcripts.) -OR- Experience in translating, interpreting, or other work requiring the use of English and Brazilian Portuguese; or a combination of work (that required English and Brazilian Portuguese) and training at the Defense Language Institute, Foreign Service Institute, or comparable training. (Note: Submit any related training/language proficiency certifications, if applicable). The following are examples of work in the required language that may have provided the required abilities: translator; interpreter; librarian or information specialist required to make abstracts, screen, index, and scan material; intelligence; writer or editor; international organizational work, such as the Peace Corps, World Bank, United Nations, business, or other organizations; or professor, teacher, or instructor work at the high school or college level that required use of the foreign language. In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirement listed below: Specialized Experience: One year of specialized experience equivalent to the GS-07 grade level in the Federal service which includes (1) translating and editing materials that are meant for publication (i.e. books, academic articles, or documents involving equivalent complexity and quality requirements) from English into Brazilian Portuguese; and (2) using correct grammar, syntax, usage, and vocabulary, at a native or near-native level of proficiency in the target language. -OR- Education: Master's or equivalent graduate degree or 2 full years of progressively higher level graduate education leading to such a degree in Translation from English into Brazilian Portuguese. (Note: You must attach a copy of your transcripts.) -OR- Combination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. (Note: You must attach a copy of your transcripts.) You will be evaluated on the basis of your level of competency in the following areas:\nResearchingTechnology ApplicationTranslation","PositionRemuneration":[{"MinimumRange":"55419.0","MaximumRange":"72046.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-08T09:09:17.8300","PositionEndDate":"2022-04-14T23:59:59.9970","PublicationStartDate":"2022-04-08T09:09:17.8300","ApplicationCloseDate":"2022-04-14T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: The employee will translate materials from English into Brazilian Portuguese for inclusion into editions of Military Review.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"9","HighGrade":"9","PromotionPotential":"None","SubAgencyName":"US Army Combined Arms Center (CAC), Military Review","OrganizationCodes":"DD/ARTC","Relocation":"False","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Army values diversity of perspectives, backgrounds, cultures and skills, which connects employees to organizations that are committed to building an inclusive work environment where they can contribute to their fullest potential. Fort Leavenworth is located in the Greater Kansas City metropolitan area. The immediate area is considered a national treasure with historic sites and homes filled with small-town charm and friendliness merged with Kansas City retail, attractions and entertainment. Kansas City, well known for its BBQ, Jazz and fountains, is rich in culture with a thriving performing arts scene. Honored as one of the World's 15 Most Beautiful Concert Halls, the Kauffman Center attracts some of the world's most renowned performers and entertainers. For the sports enthusiasts, Kansas City hosts professional sports with the Royals, Chiefs and Sporting Kansas City soccer club. An international airport is conveniently located within a 30 minute drive of Fort Leavenworth. More information may be found at www.visitkc.com or https://garrison.leavenworth.army.mil/.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As a Translator, you will perform the following duties which is not an all-inclusive list:","Translates materials from English into Brazilian Portuguese using correct grammar, syntax, usage, and vocabulary, at a native or near-native level of proficiency suited to producing texts for publication.","Produces initial drafts using a computer-assisted translation (CAT) tool and conducts subsequent editing and proofreading.","Conducts open source research in English and Brazilian Portuguese in web search engines, U.S. and Brazilian military documents, past articles, and reputable online multilingual glossaries.","Proofreads InDesign layout to ensure error-free copy prior to release to contract printers, ensuring that all photo captions, tables, and figures are translated","Translation projects may include material pertaining to a wide variety of subjects relevant to the U.S. Army, to include military and foreign policy topics, and involving different file formats, lengths, and timelines."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Basis for Rating: Qualified candidates will be assigned to one of three quality categories: Best Qualified, Highly Qualified and Qualified. Veteran preference eligibles are listed ahead of non-preference eligibles within each quality category. Best Qualified. Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements for the announced position. Highly Qualified. Candidates in this category possess good skills and experience above the minimum requirements for the announced position. Qualified. Candidates in this category meet the minimum experience requirements for the announced position.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 04/14/2022 to receive consideration To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11448673). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on whether or not you are eligible for preference in federal employment. A complete description of preference categories and the associated required documents is in the Applicant Checklist (External). As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses This position requires a job-related license or certification. You MUST submit a copy of your license or certification with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct Deposit of Pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. This is a Career Program (CP) 60 - Foreign Affairs/Strategic Planning position. You may claim military spouse preference. Multiple positions may be filled from this announcement. Salary includes applicable locality pay or Local Market Supplement. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest. Relocation, recruitment, and retention incentives are NOT authorized for this position. Position is eligible for situational telework only, including emergency and OPM prescribed \"Unscheduled Telework.\" Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy. Information may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"USARMY.APG.CHRA-NE.MBX.APPLICANTHELP@MAIL.MIL","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Not Required","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585167300","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-10XX-SPLASH","PositionTitle":"Information and Arts Family","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585167300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585167300?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Arts And Information","Code":"1001"},{"Name":"Museum Curator","Code":"1015"},{"Name":"Public Affairs","Code":"1035"},{"Name":"Language Specialist","Code":"1040"},{"Name":"Visual Information","Code":"1084"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public","fed-competitive","fed-excepted","disability","land","mspouse","peace","graduates","student","vet"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"647235900","MatchedObjectDescriptor":{"PositionID":"120786-01","PositionTitle":"LANGUAGE SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/647235900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/647235900?PostingChannelID="],"PositionLocationDisplay":"Tokyo, Japan","PositionLocation":[{"LocationName":"Tokyo, Japan","CountryCode":"Japan","CityName":"Tokyo, Japan","Longitude":139.76959,"Latitude":35.675198}],"OrganizationName":"Defense Intelligence Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full Time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"ASSESSMENT FACTORS1. Comprehends foreign language texts on unfamiliar subjects intended for a general native audience, including argumentation, conjecture, and implied meanings.2. Produces clear and grammatically-correct writing in the target language on general-information subjects.3. With no supervision, completes work, meets priorities, and achieved results based on the organizations goals and objectives4. Demonstrates excellent oral and written communication skills to compose and deliver responses to complex questions in a clear, concise, and organized manner5. Understands how work is impacted by mission and operations of IC organizations and componentsHIGHLY DESIRED SKILLS 1. Knowledge of or experience working with the Defense Attach Service, at DIA HQs or at a DAO.2. Experience serving as a dependable member of a small team focused on accomplishing U.S. missions.3. Previous assignment or experience working in the U.S. Indo-Pacific Command Area of ResponsibilityEducationUndergraduate and Graduate Education: Major study -- the appropriate foreign language from an English-speaking college or university, English from a college or university in the other country, or translating or interpreting where English and the foreign language were prerequisites.ORExperienceSpecialized Experience (for positions above GG-5): Experience in translating, interpreting, or other work requiring the use of English and the other language; or a combination of work (that required English and the other language) and training at the Defense Language Institute, Foreign Service Institute, or comparable training.The following are examples of work in the required language that may have provided the required abilities: translator; interpreter; librarian or information specialist required to make abstracts, screen, index, and scan material; intelligence; writer or editor; international organizational work, such as the Peace Corps, World Bank, United Nations, business, or other organizations; or professor, teacher, or instructor work at the high school or college level that required use of the foreign language.Testing ProvisionsAgencies may test applicants for foreign language proficiency on a pass/fail basis prior toappointment. Agencies must document the connection between the level of proficiency required and the duties of the position to be filled. Test material for applicants for the same position or grade level should be equally difficult, and should be selected from typical work-related documents.","PositionRemuneration":[{"MinimumRange":"87198.0","MaximumRange":"113362.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-04T00:00:00.0000","PositionEndDate":"2022-04-18T23:59:59.9970","PublicationStartDate":"2022-04-04T00:00:00.0000","ApplicationCloseDate":"2022-04-18T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"We are committed to: Teamwork: Partnering at all levels and across organizational boundaries for mission accomplishment. Integrity: Adherence to the highest legal and ethical principles in our responsibilities. Excellence: Unrivaled defense intelligence expertise. Service: Putting the welfare of the Nation and commitment to our mission before oneself.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"12","HighGrade":"12","PromotionPotential":"12","OrganizationCodes":"DD/DD05","Relocation":"False","HiringPath":["public","vet","fed-excepted","nguard"],"AgencyMarketingStatement":"","TravelCode":"-1","MajorDuties":["DIA employs a variety of professionals who serve throughout the workforce to ensure successful operations. To view this positions duties, click Vacancies to be directed to DIAs online application system. Please make note of the position title and 6-digit Job Opening ID number to which you are interested. You can scroll to the bottom of the page to locate the announcement or click on the Advanced Search link and enter in the 6-digit Job Opening ID number in the Job Opening ID field."],"Education":"","Requirements":"All applicants must be U.S. citizens and are subject to a thorough background inquiry.","Evaluations":"In order to qualify for this position, your application must include sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position to which you are applying. To view this positions requirements, click Vacancies to be directed to DIAs online application system. Please make note of the position title and 6-digit Job Opening ID number to which you are interested. You can scroll to the bottom of the page to locate the announcement or click on the Advanced Search link and enter in the 6-digit Job Opening ID number in the Job Opening ID field.","HowToApply":"How Do I Apply HOW\nDO I APPLY? Unless specified\nwithin the vacancy announcement, you must complete and submit\nyour job application electronically, using DIA's online job tool. Go to: http://www.dia.mil. Click the link to \"Search and Apply for Jobs\" or click the link to \"Careers\" > \"Vacancies.\" Your first visit? Click \"New User\" to setup your account. Click \"Search\" to view Vacancy Announcements for opportunities that interest you. Save as a Favorite or select the Job Opening to Apply. At the top of the \"Job Search\" page, click \"My Favorite Jobs\" to view each announcement. Start the application process by clicking the \"Apply\" at the bottom of the announcement. While working on the application, \"Save\" frequently. When you save the document, prior to final submission, you can exit the application and return later to continue by logging-in and going to Job Search > My Activities > Applications with a status of Not Submitted. Finished? Click \"Submit.\" You must complete and submit the application prior to the closing date listed on the Vacancy Announcement. Final applications are not available for revision. If you need to revise your application, complete and submit another application. All positions in the Defense Intelligence Agency are in the excepted service under 10 USC 1601 appointment authority and covered by the Defense Civilian Intelligence Personnel System (DCIPS), a General Grade (GG) pay system divided into grades and steps similar to OPMs General Schedule (GS) compensation system. All candidates must be U.S. citizens and are subject to a thorough background inquiry and any required medical examinations.","WhatToExpectNext":"Your application for employment must be prepared and submitted on-line at www.dia.mil. We will notify you, via e-mail, when your application has been received. Later, you will be notified, via e-mail, if DIA is or is not interested in you as a potential employee of our agency.","RequiredDocuments":"Please see instructions within the on-line application for this vacancy announcement on the DIA web-site, www.dia.mil.","Benefits":"Please visit our web site, www.dia.mil. Under the \"Careers\" heading on our web site, you will find a listing of benefits available to DIA employees.","BenefitsUrl":"http://www.dia.mil/careers/benefits","OtherInformation":"DIA positions are Defense Civilian Intelligence Personnel System (DCIPS) positions in the Excepted Service under 10 U.S.C. 1601. All applicants must be U.S. citizens at the time of application. Applicants must meet the agencys conditions of employment, to include, but not limited to, satisfactory completion of an initial special background investigation and periodic reinvestigation, completion of any required medical examination and physical requirements, completion of any required personal interviews, favorable completion of any required initial or aperiodic polygraph examinations, completion of any required drug test, satisfactory completion of a two-year Defense Civilian Intelligence Personnel System trial period, and completion of a civilian mobility agreement. All employees are required to sign an agreement not to disclose, in any fashion, classified information to unauthorized persons. All civilian employees are required to participate in the DoD Direct Deposit/Electronic Fund Transfer of Pay (DD/EFT) Program. DIA employees and applicants for employment are protected by federal laws, from discrimination on the bases of race, religion, color, sex (including pregnancy, gender identity, and sexual orientation), parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, or other non-merit based factors. Veterans who are preference-eligible or who have been separated from the armed forces under honorable conditions are encouraged to apply.","KeyRequirements":["- U.S. Citizenship   - Drug Test   - Security Investigation"],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactPhone":"Not Available","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}