{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":7,"SearchResultCountAll":7,"SearchResultItems":[{"MatchedObjectId":"639005100","MatchedObjectDescriptor":{"PositionID":"DE-11402506-22-IS","PositionTitle":"INTERPRETER (AMERICAN SIGN LANGUAGE)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639005100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639005100?PostingChannelID="],"PositionLocationDisplay":"Bremerton, Washington","PositionLocation":[{"LocationName":"Bremerton, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Bremerton, Washington","Longitude":-122.6257,"Latitude":47.565002}],"OrganizationName":"U.S. Pacific Fleet","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: performing simultaneous interpretation from spoken English into American Sign Language and from American Sign Language into spoken English. Additional qualification information can be found from the following Office of Personnel Management website:http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"73098.0","MaximumRange":"95022.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-24T00:00:00.0000","PositionEndDate":"2023-02-23T23:59:59.9970","PublicationStartDate":"2022-02-24T00:00:00.0000","ApplicationCloseDate":"2023-02-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. *Direct Hire Authority. See Additional Information section.*","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"11","PromotionPotential":"None","OrganizationCodes":"DD/NV70","Relocation":"True","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will facilitate communication for deaf/hard of hearing team members enabling them to fully participate in organizational activities.","You will provide interpreting services for daily work related activities, including worksite communication, appointments, meetings, training, and command events.","You will promote an understanding of deaf culture and provides training on relevant topics to employees, supervisors, and managers.","You will provide contracting and scheduling support for necessary supplemental services."],"Education":"** Education may be substituted for specialized experience as follows: A Ph.D. or equivalent doctoral degree; OR Three full years of progressively higher level graduate education leading to a Ph.D. or equivalent degree; OR An LL.M. degree in a field directly related to the position being filled; OR A combination of experience and graduate education as described above that equates to one year of experience.","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: brem_900a_admins.fct@navy.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers. NOTE: Due to COVID19, if you have any questions or need assistance, please email the DON Employment Information Center at DONEIC@navy.mil","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This announcement uses the Defense Industrial Base, Major Range and Test Facilities direct hire authority to recruit and appoint qualified candidates to certain positions in the competitive service. Must possess and maintain certification in one of the following: Registry of Interpreters for the Deaf (RID)/ National Interpreter Certification National Association of Deaf (NAD) Master Comprehensive Skills Certificate (CSC) Master Comprehensive Skills Certificate (MSCS) Certified Deaf Interpreter (CDI) Certificate of Interpretation (CI) Certificate of Transliteration (CT) COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is covered by the Department of Defense Priority Placement Program. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Veteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"robin.l.jones3@navy.mil","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"653134200","MatchedObjectDescriptor":{"PositionID":"9Q-AFPC-11492773-601289-EC","PositionTitle":"SUPERVISORY FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/653134200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/653134200?PostingChannelID="],"PositionLocationDisplay":"Hickam AFB, Hawaii","PositionLocation":[{"LocationName":"Hickam AFB, Hawaii","CountryCode":"United States","CountrySubDivisionCode":"Hawaii","CityName":"Hickam AFB, Hawaii","Longitude":-157.93474,"Latitude":21.317465}],"OrganizationName":"Pacific Air Forces","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"1 YEAR","Code":"15318"}],"QualificationSummary":"This is a Temporary Promotion position NTE 1 Year from date of Hire. The individual selected for this position may be extended without further competition. Current Federal civilian employees may apply for this position using \"Reinstatement\" eligibility and if selected, a break in service of at least 4 calendar days may be required prior to appointment to this position. This position is designated as a key position IAW AFI 36-507. Duties of this position are essential to the accomplishment of wartime/contingency operations. Incumbents of key positions must be removed from their military recall status if alternative for filling of the position during an emergency are not available. In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENTS FOR FOREIGN AFFAIRS SPECIALIST 0130 SERIES: A Bachelor's degree (or higher degree) or a degree with a major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-13, or equivalent in other pay systems. Examples of specialized experience includes: extensive knowledge of National, DoD, and Agency foreign disclosure and strategic policy, directives and instructions, and disclosure precedents to develop foreign disclosure policies for the command; extensive, in-depth knowledge requirements to make decisions and/or recommendations significantly changing, interpreting and developing Major Command foreign senior officer engagement policies and programs; these decisions effect US national interests, international security, and security programs. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-13 level is required to meet the time-in-grade requirements for the GS-14 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: Professional knowledge of a wide range of security concepts, principles, and practices to independently review, analyze and resolve difficult and complex foreign disclosure security problems. Professional knowledge of politico-military affairs, military operations, military command and control, and research and development and proven analytical skills in order to develop coherent, consistent AF disclosure policy. Knowledge of the military, political, economic, and social aspects of individual countries and alertness to international trends in order to carry out the work of the position. Knowledge of theories and principles of unified engagements, development and execution, and policy in overall program and planning and execution of the Building Partnerships Program. Comprehensive writing and communication skills to construct issue/background papers having the correct nuance to achieve desired effects. Ability to direct, inspire, and motivate others toward goal accomplishment related to foreign matters Familiarity with US laws and policies regarding export of US defense articles and services. Knowledge of safety and security regulations, practices, and procedures. Strong ability to deal with people tactfully and diplomatically and to communicate both orally and in writing. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"115551.0","MaximumRange":"150216.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-05-09T00:00:00.0000","PositionEndDate":"2022-05-23T23:59:59.9970","PublicationStartDate":"2022-05-09T00:00:00.0000","ApplicationCloseDate":"2022-05-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is: To serve as Deputy to the Chief, International Affairs Division, who is the principal advisor to COMPACAF on International Relations and Security Cooperation (TSC).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"None","OrganizationCodes":"DD/AF0R","Relocation":"False","HiringPath":["fed-transition","overseas","fed-competitive","disability","mspouse","vet"],"AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanMilitary Spouse PreferenceNon-DoD TransferPeople with Disabilities, Schedule A","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Serves as Deputy to the Division Chief with executive authority to plan, organize, and direct the activities of the International Affairs Division. Performs a wide range of analytical and administrative duties related to PACAF foreign engagement. Manages COMPACAF exercise and senior officer visit requirements, as well as the International Military Personnel Exchange Program, USAF Professional Military Education (PME) Program, and the Foreign Liaison Officer (FLO) Program for the Pacific AOR on behalf of Chief of Staff, USAF. Coordinates military engagement requirements between foreign embassies, USEMB, SAF, HAF, PACAF, and USPACOM staffs on multi-level mil-mil engagements and large-scale operational exercises in support of international participation. Implements, monitors, and makes recommendations relative to the DoD and HQ USAF directed programs governing visits to Pacific and CONUS locations by foreign national military senior officials."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 05/23/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11492773 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Current Federal Civilian employees may apply for temporary and term positions and if selected, a break in service may be required prior to appointment to the position. Temporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11492773. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585167300","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-10XX-SPLASH","PositionTitle":"Information and Arts Family","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585167300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585167300?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Arts And Information","Code":"1001"},{"Name":"Museum Curator","Code":"1015"},{"Name":"Public Affairs","Code":"1035"},{"Name":"Language Specialist","Code":"1040"},{"Name":"Visual Information","Code":"1084"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"655324500","MatchedObjectDescriptor":{"PositionID":"8X-DCIPS-11498559-594362-RM","PositionTitle":"LANGUAGE SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/655324500","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/655324500?PostingChannelID="],"PositionLocationDisplay":"Osan, South Korea","PositionLocation":[{"LocationName":"Osan, South Korea","CountryCode":"South Korea","CityName":"Osan, South Korea","Longitude":127.0805,"Latitude":37.145}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","SubAgency":"303 INTELLIGENCE SQ","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Term","Code":"15319"}],"QualificationSummary":"In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Administrative and Management Positions. This is a GG-13 position in the Defense Civilian Intelligence Personnel System (DCIPS). The GG-13 duties for the \"Professional\" work category are at the \"Full Performance\" work level and are equivalent to those at the GS-12 level. The selectee's salary will be set within the grade equivalent to a GS/GG grade based on the selectee's qualifications in relation to the job. INDIVIDUAL OCCUPATIONAL REQUIREMENT: Education\nUndergraduate and Graduate Education: Major study -- the appropriate foreign language from an English-speaking college or university, English from a college or university in the other country, or translating or interpreting where English and the foreign language were prerequisites. OR\nSpecialized Experience (for positions above GS-5): Experience in translating, interpreting, or other work requiring the use of English and the other language; or a combination of work (that required English and the other language) and training at the Defense Language Institute, Foreign Service Institute, or comparable training. The following are examples of work in the required language that may have provided the required abilities: translator; interpreter; librarian or information specialist required to make abstracts, screen, index, and scan material; intelligence; writer or editor; international organizational work, such as the Peace Corps, World Bank, United Nations, business, or other organizations; or professor, teacher, or instructor work at the high school or college level that required use of the foreign language. EXPERIENCE REQUIRED: Your resume must reflect the quality level of experience which demonstrates the possession of the knowledge, skills, abilities, and competencies necessary for successful job performance required for this position. Quality experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position and is typically in or related to the work of the position to be filled. Examples of creditable experience includes comprehensive knowledge of cryptologic language training programs both Air Force Distributed Common Ground Station (AF DCGS) and Intelligence Community (IC) operations and analysis and Air Force Instructional Systems Development (ISD) and inspection/oversight procedures. NOTE: Creditable experience may include previous military experience, experience gained in the private sector, or experience gained in another government agency. OR\nTo view qualifying educational requirements and/or combination of education and specialized experience click on the following link:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=Group-Standards KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1 Comprehensive knowledge of cryptologic language training programs both Air Force Distributed Common Ground Station (AF DCGS) and Intelligence Community (IC) operations and analysis and Air Force Instructional Systems Development (ISD) and inspection/oversight procedures\n2. Knowledge of current AF ISR intelligence operations to include familiarity with collection, processing and reporting procedures across the Agency's associated intelligence disciplines and specialties to work complex issues.\n3. In-depth knowledge of Air Force operations training and language training procedures advanced analytical principles, concepts, and methods to produce detailed analyses of complex information/situations attained from multiple sources, to include database manipulation.\n4. Knowledge of the national intelligence community, Joint, DoD structure, organizations, and mission/functions, inter-relationships and operations.\n5. Skill in conducting unbiased complex research, identifying appropriate available systems/data sources, and producing collection requirement assessments that answer specific tasks to link and leverage agency capabilities in support of consumers, customers, and clients.\n6. Skill in communicating effectively with others, both orally and in writing, in working out solutions to problems or questions related to the work, writing clear and concise intelligence products, and delivering written and/or verbal presentations to senior level audiences for decision-making purposes. Ability to determine need for, procure and measure adequacy of short-and long-term results training. Condition Cond't- - Language Proficiency: This is a Language Designated Position (LDP) and requires foreign language proficiency in the following language Korean to perform the intelligence-related duties assigned. Incumbent must achieve a passing score in Korean on the Defense Language Proficiency Test (DLPT). PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"106823.0","MaximumRange":"138868.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-05-19T00:00:00.0000","PositionEndDate":"2022-05-26T23:59:59.9970","PublicationStartDate":"2022-05-19T00:00:00.0000","ApplicationCloseDate":"2022-05-26T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. The primary purpose of this position is to serve as Senior Language Specialist of Cryptologic Language Program (CL) responsible for the development, integration, and maintenance of a cryptologic training program supporting both Air Force Distributed Common Ground Station (AF DCGS) and Intelligence Community (IC) operations and analysis.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"13","SubAgencyName":"303 INTELLIGENCE SQ","OrganizationCodes":"DD/AF00","Relocation":"True","HiringPath":["public"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win ... Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. This position is a Defense Civilian Intelligence Personnel Systems (DCIPS) position implemented under Section 504, Title V of Public Law 99-569, Intelligence Authorization Act for Fiscal Year 1987, as codified in Sec 1601, Chap 83 of Title 10 United States Code which sets forth Air Force policies and procedures for DCIPS. This position is in the Excepted Service. DoD Components with DCIPS positions apply Veterans' Preference to preference eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by section 2108 of Title 5 U.S.C., you must submit documents verifying your eligibility with your application package. For additional information on DCIPS, click here","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Develops, manages, and assesses cryptologic training programs supporting Air Force and national mission sets. Coordinates with external AF and national partners to leverage cryptologic training practices. Evaluates site readiness for Air Force and national cryptologic mission sets. Provides dedicated mentorship to site cryptologic operators."],"Education":"","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING: Your application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements.\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. Your responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (EST) on 05/26/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11498559 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. 4. Return Rights: Per AFI 36-1101 - DCIPS employees have no statutory right of return to the previous position, unit, or geographic location. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application.Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy/copies of your last or most recent SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). OCONUS - Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" and block 34 must be a\"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". NOTE: For OCONUS employees who claim eligibility MSP or Family Member Preference, your SF-50 may contain a \"3\" in block 24 and a \"2\" in block 34. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Important Overseas Information: Applicants interested in applying for overseas locations please click here to review important information regarding the exceptional family member program.\nEmployed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Current Federal Civilian employees may apply for temporary and term positions and if selected, a break in service may be required prior to appointment to the position. Temporary and Term Appointments: If you are selected for a temporary or term position, your appointment may be extended to the maximum period allowed by law without further competition. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur.\nDirect Deposit: All federal employees are required to have direct deposit.\nIf you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11498559\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here. Selectees who physically reside permanently in the U.S., the Commonwealth of Puerto Rico or Northern Mariana Islands, and the Possessions of the U.S., during the entire recruitment process (application, selection, and acceptance of a formal job offer) and selected for employment in the foreign area are eligible to receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, Post Allowance, Home Leave, etc. (subject to approval) Selectees who physically reside outside the U.S., the Commonwealth of Puerto Rico or Northern Mariana Islands, and the Possessions of the U.S., during any step of the recruitment process (application, selection, and acceptance of a formal job offer) will have foreign area benefits eligibility be determined on a case by case basis. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"655469800","MatchedObjectDescriptor":{"PositionID":"9P-AFPC-11507024-606737-ARN","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/655469800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/655469800?PostingChannelID="],"PositionLocationDisplay":"Randolph AFB, Texas","PositionLocation":[{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Employee should possess skills and demonstrated ability to communicate and interact with colleagues, counterparts in various USG agencies, high-ranking foreign representatives, and representatives of diverse cultures, and be able to utilize tact and diplomacy on all occasions. Employee must meet the education/experience requirements IAW OPM guidelines for the Foreign Affairs Series 0130 Occupational requirements. (Ref:https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedulequalification- standards/0100/foreign-affairs-series-0130/). Work occasionally requires global travel away from the normal duty station; travel on military or commercial aircraft is required. The employee must able to perform multiple, long-term (up to 90-days or more) TDYs at several global locations to attend training, conferences and meeting with foreign nationals. In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-11, or equivalent in other pay systems. Examples of specialized experience includes includes knowledge of International/Foreign Affairs Security Assistance Management Manual and associate responsibilities of a Case/Country Manager (CM) as a USAF's subject matter expert and primary point of contact for planning and executing of assigned Foreign Military Sales (FMS) case(s) including acquisition, contracting milestones, programming, logistics, finance, monitors student requirements, tracking program(s), and training development. Knowledge of the working of foreign governments, the nature of their military and civilian governmental structures, and the culture and political dynamics influencing them. NOTE: You must submit a copy of your transcripts. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-11 level is required to meet the time-in-grade requirements for the GS-12 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Knowledge of USG International/Foreign Affairs objectives, Arms Export Control Act (AECA), and Foreign Military Sales (FMS) processes, and/or understanding of international relations policy objectives within Security Assistance/Cooperation Programs. 2. Knowledge and technical skill to develop, analyze, and evaluate training options within the legal scope of an FMS program and diplomatically communicate complex plans to USG and international stakeholders. 3. Ability to analyze and coordinate a FMS cases for specific requirements, within USG and DoD regulatory policy, for money, manpower, materiel, facilities, and services needed to support the program and when necessary apply the federal acquisition process for development, implementation, line management, execution, and closure of FMS training cases. 4. Knowledge of the procedures for the development, coordination, and planning for the formulation of Letter of Offer and Acceptance (LOAs) to include cost, schedule, and availability of DoD or contractor provided training options. 5. Ability to work complex project management issues with foreign governments, their military, and U.S. industry with an understanding of cultural, socio-political, and economic dynamics. 6. In-depth ability to use office computer software applications in the preparation of word documents, spreadsheets, and presentations; ability to communicate effectively and diplomatically in written and oral mediums. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"80176.0","MaximumRange":"104233.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-05-20T00:00:00.0000","PositionEndDate":"2022-05-26T23:59:59.9970","PublicationStartDate":"2022-05-20T00:00:00.0000","ApplicationCloseDate":"2022-05-26T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to to serve as a professional Foreign Affairs Specialist Country Manager in support of Department of Defense (DoD) agencies.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"12","HighGrade":"12","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Case/County Manager (CM) is the focal point for case/country and IMS student activities and manages all aspects of the FMS case(s). The CM serves as USAF focal point for all international student issues in support of the assigned countries' training programs. The CM will be the liaison between managed countries' representatives, SCOs, MAJCOMs, and other USG agencies to ensure implementation of training for and by these agencies. Develops and initiates proper documentation, including estimated training costs, training sequences, and identification of potential problem areas based on factors unique to the requesting countries. Develops official correspondence, messages, and items of interest, staff summaries, sheets, and talking papers relative to assigned programs."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 05/26/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11507024 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11507024. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"654551200","MatchedObjectDescriptor":{"PositionID":"EUHR2268976269941","PositionTitle":"Foreign Affairs Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/654551200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/654551200?PostingChannelID="],"PositionLocationDisplay":"Stuttgart, Germany","PositionLocation":[{"LocationName":"Stuttgart, Germany","CountryCode":"Germany","CityName":"Stuttgart, Germany","Longitude":9.17192,"Latitude":48.7677}],"OrganizationName":"Joint Activities","DepartmentName":"Department of the Army","SubAgency":"United States Africa Command (US AFRICOM), J5","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Defense Civilian Intelligence Personnel System (DCIPS) Interchange AgreementExcepted Service Overseas Family Member AppointmentFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentNon-Department of Defense (DoD) TransferReinstatementVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Basic Requirement for Foreign Affairs Specialist: A. Degree: Bachelor's degree (or higher degree) with a major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; OR 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR B. Combination of Education and Experience: Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. OR C. Experience: Four years of appropriate experience in one or more of the fields, as shown in A above, in work associated with international organizations, problems, or other aspects of foreign affairs.In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: Specialized Experience: One year of specialized experience which includes: 1) Developing written products to senior decision makers regarding foreign affairs and/or strategic national security concerns; And 2) ensuring programs and policies in an Area of Responsibility (AOR) are aligned with United States Government (USG) strategic objectives. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-12). Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted. You will be evaluated on the basis of your level of competency in the following areas:\nInternational Engagement Action PlanningInternational Engagement Assessment & AnalysisInternational Engagement Policy DevelopmentResource and Program Management Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-12).","PositionRemuneration":[{"MinimumRange":"81216.0","MaximumRange":"105579.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-05-16T00:00:00.0000","PositionEndDate":"2022-05-26T23:59:59.9970","PublicationStartDate":"2022-05-16T00:00:00.0000","ApplicationCloseDate":"2022-05-26T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: As a country desk officer in a regional engagement division in the Strategy, Engagement and Programs (J5) Directorate, you will contributes to the achievement of the Commander's directed end states by developing command strategic guidance for assigned countries, planning senior leader engagements, conducting security cooperation activities, and supporting country teams within the United States Africa Command area of responsibility, in order to counter transnational threats.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"None","SubAgencyName":"United States Africa Command (US AFRICOM), J5","OrganizationCodes":"DD/ARJA","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","land","mspouse","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"*COVID-19 has severely limited available child care services in the Stuttgart Military Community. At this time, and for the foreseeable future, only the children of military service members can be accommodated in on-base child care facilities. In addition, in some Stuttgart-area communities, host-nation child care providers are not able to accommodate the children of U.S. Citizens in their programs. Applicants with child care requirements are encouraged to research options prior to accepting job offers. Child care needs will not be a factor in the selection process.* United States Africa Command USAFRICOM, is one of six geographic combatant commands and is responsible to the Secretary of Defense for military relations with African nations, the African Union, and African regional security organizations. Responsible for all operations, exercises, and security cooperation on the African continent. The mission of USAFRICOM, in concert with interagency and international partners, is to build defense capabilities, respond to crisis, and deter and defeat transnational threats in order to advance U.S. national interests and promote regional security, stability, and prosperity. USAFRICOM recognizes a diverse workforce as our differences in life experiences and cultural backgrounds brings us together by promoting innovative solutions towards common goals. We encourage talented individuals from all communities and segments of our society to apply.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Ensure that U. S. Africa Command (USAFRICOM) programs and policies in the Area of Responsibility (AOR) are aligned with USAFRICOM and U.S. Government (USG) strategic objectives.","Apply the national security strategy, campaign plan, security objectives, integrated country strategy (ICS) to develop effective engagement plans","Review requests for funding of programs to ensure that the activity plans align with the mission.","Synchronize proposed security cooperation activities in assigned African states and provide branch/division chief with concise and thorough recommendations to approve or deny each activity.","Host conferences on assigned region and assists other directorates with planning and conducting various studies."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 05/26/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11499941). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. If an employee brings a child to an overseas location and that child is entitled to attend a DoD school on a space-required basis in accordance with DoDEA Regulation 1342.13, the DoDEA and the Military Department responsible for providing related services will ensure that the child, if eligible for special education, receives a free appropriate public education, including related services pursuant to DoDI 1342.12 and DoDM 1342.12. If an employee brings an infant or toddler (up to 3 years of age) to an overseas location, and that infant or toddler, but for the child's age, is entitled to attend the DoDEA on a space-required basis in accordance with DoDEA Regulation 1342.13, then the Military Department responsible for EIS will provide the infant or toddler with the required EIS in accordance with the eligibility criteria consistent with DoDI 1342.12 and DoDM 1342.12. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs/ Strategic Planning position. The initial length of this overseas tour is 36 months. Multiple positions may be filled from this announcement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations. Information may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"654616600","MatchedObjectDescriptor":{"PositionID":"EUHR226877396814","PositionTitle":"Supervisory International Political-Military Affairs Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/654616600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/654616600?PostingChannelID="],"PositionLocationDisplay":"Stuttgart, Germany","PositionLocation":[{"LocationName":"Stuttgart, Germany","CountryCode":"Germany","CityName":"Stuttgart, Germany","Longitude":9.17192,"Latitude":48.7677}],"OrganizationName":"Joint Activities","DepartmentName":"Department of the Army","SubAgency":"HQ US Africa Command - J5","JobCategory":[{"Name":"International Relations","Code":"0131"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsExcepted Service Overseas Family Member AppointmentFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Basic Requirement for Supervisory International Political Military Affairs Specialist: Degree: Bachelor's degree (or higher degree) with a major or equivalent, or a combination of courses totaling at least 24 semester hours in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; OR;\n12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR;\nCombination of Education and Experience: Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, in one or more of the social sciences, or in the humanities, as shown in A above, plus appropriate experience or additional education. OR;\nExperience: Four years of appropriate experience in one or more of the fields, as shown in A above, in work associated with international organizations, problems, or other aspects of foreign affairs.In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: ADDITIONAL REQUIREMENTS:\nSpecialized Experience: One year of specialized experience which includes: 1) advising on political-military affairs policy matters pertaining to the African region and non-African multinational partners; 2) leading efforts to synchronize strategies that support the military international activities mission on the continent; 3) delivering informational briefings and presentations on engagement activities and pol-mil topics. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-13). Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted. You will be evaluated on the basis of your level of competency in the following areas:\nLeadershipOral CommunicationStrategic ThinkingTechnical Competence Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-13).","PositionRemuneration":[{"MinimumRange":"95973.0","MaximumRange":"124764.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-05-16T10:19:53.2100","PositionEndDate":"2022-05-30T23:59:59.9970","PublicationStartDate":"2022-05-16T10:19:53.2100","ApplicationCloseDate":"2022-05-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: This position is located in Stuttgart, Germany. Stuttgart is the cultural and political capital of Baden-Wuerttemberg and one of Europe's foremost metropolitan areas. Stuttgart is charmingly situated in the heart of one of Germany's largest wine-growing regions, attracting tourists by its magnificent panorama, its impressive gardens and parks, palaces and buildings in a wide range of architectural styles. For additional information please visit www.stuttgart.army.mil/","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"None","SubAgencyName":"HQ US Africa Command - J5","OrganizationCodes":"DD/ARJA","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","land","mspouse","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"*COVID-19 has severely limited available child care services in the Stuttgart Military Community. At this time, and for the foreseeable future, only the children of military service members can be accommodated in on-base child care facilities. In addition, in some Stuttgart-area communities, host-nation child care providers are not able to accommodate the children of U.S. Citizens in their programs. Applicants with child care requirements are encouraged to research options prior to accepting job offers. Child care needs will not be a factor in the selection process. *United States Africa Command USAFRICOM, is one of six geographic combatant commands and is responsible to the Secretary of Defense for military relations with African nations, the African Union, and African regional security organizations. Responsible for all operations, exercises, and security cooperation on the African continent. The mission of USAFRICOM, in concert with interagency and international partners, is to build defense capabilities, respond to crisis, and deter and defeat transnational threats in order to advance U.S. national interests and promote regional security, stability, and prosperity. USAFRICOM recognizes a diverse workforce as our differences in life experiences and cultural backgrounds brings us together by promoting innovative solutions towards common goals. We encourage talented individuals from all communities and segments of our society to apply.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Serves as Senior International Political-Military Affairs Specialist in the Multinational Cooperation Center (MNCC), Strategy, Plans and Programs Directorate, J5.","Plans work to be accomplished, sets priorities, and prepares schedules for completion of work. Assigns and reviews work.","Maintain political-military (pol-mil) oversight on assigned non-African multinational partners (partner nations or PNs) and international to provide feedback and recommendations to the command.","Supports and coordinates engagement activities in accordance with the theater engagement plan."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&eacute;sum&eacute; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&eacute;sum&eacute; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 05/30/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11496814). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. If an employee brings a child to an overseas location and that child is entitled to attend a DoD school on a space-required basis in accordance with DoDEA Regulation 1342.13, the DoDEA and the Military Department responsible for providing related services will ensure that the child, if eligible for special education, receives a free appropriate public education, including related services pursuant to DoDI 1342.12 and DoDM 1342.12. If an employee brings an infant or toddler (up to 3 years of age) to an overseas location, and that infant or toddler, but for the child's age, is entitled to attend the DoDEA on a space-required basis in accordance with DoDEA Regulation 1342.13, then the Military Department responsible for EIS will provide the infant or toddler with the required EIS in accordance with the eligibility criteria consistent with DoDI 1342.12 and DoDM 1342.12. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs/ Strategic Planning position. The initial length of this overseas tour is 36 months. Multiple positions may be filled from this announcement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations. Information may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}