{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":11,"SearchResultCountAll":11,"SearchResultItems":[{"MatchedObjectId":"647315100","MatchedObjectDescriptor":{"PositionID":"SES-11446679-22-KF","PositionTitle":"Deputy Chief Human Resources Officer","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/647315100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/647315100?PostingChannelID="],"PositionLocationDisplay":"Alexandria, Virginia","PositionLocation":[{"LocationName":"Alexandria, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Alexandria, Virginia","Longitude":-77.04308,"Latitude":38.804565}],"OrganizationName":"Washington Headquarters Services","DepartmentName":"Department of Defense","SubAgency":"Human Resources Directorate","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), the Mandatory Technical Qualifications, and other qualifications, if applicable, listed below. EXECUTIVE CORE QUALIFICATIONS: All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately, not to exceed 10 pages. You are required to respond to all ECQs. If you fail to do so will result in a rating of 'ineligible.' When responding to the Executive Core Qualifications (ECQs), you must clearly show that you possess the experience, knowledge, skills and ability to perform the duties of this position by submitting narrative responses in which you detail your experience in each of the ECQs. Your examples should be clear and emphasize your level of responsibilities, scope and complexity of programs managed, program accomplishments with results of your actions, policy initiatives and level of contacts. You should limit your narrative to two pages per ECQ, and address each ECQ separately. OPM's Guide to Senior Executive Service Qualifications can assist you in writing an effective SES application. In particular, please note the Challenge-Context-Action-Result Model that is recommended and very helpful when drafting ECQ narrative responses. The Guide is available on OPM's Website at:\nhttp://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Applicants must utilize the Challenge-Context-Action-Result (CCAR) Model when writing Executive Core Qualifications (ECQ). Use two examples of relevant experience for each ECQ being sure your experience matches the ECQ criteria.\nChallenge - Describe a specific problem or goal.\nContext - Describe the individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, co-workers, members of Congress, shrinking budget, low morale).\nAction - Discuss the specific actions you took to address a challenge.\nResult - Give specific examples of measures/outcomes that had some impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. MANDATORY TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. You are required to respond to all of the technical qualifications. If you fail to do so, you will be rated as ineligible. Please limit your written statements to no more than two pages per technical qualification. Demonstrated experience leading and partnering to improve human resource and security programs resulting in innovative, strategic solutions and plan(s) that reflect continuously changing customer requirements. Demonstrated experience advancing innovative human capital management service delivery solutions to meet strategic goals and requirements. In addition, demonstrated executive-level experience managing and directing the day-to-day operations of a Federal human resources program. Demonstrated experience fielding new business applications or improving business applications while maintaining service delivery and improving application user proficiency and adoption. DoD Joint Enterprise-Wide Experience Statement: In addition, DoD requires an Enterprise Perspective. This individual must have the ability to apply a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities is required. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within the application package (Resume, Technical Qualifications and Executive Core Qualifications).","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-06T10:13:57.0370","PositionEndDate":"2022-04-27T23:59:59.9970","PublicationStartDate":"2022-04-06T10:13:57.0370","ApplicationCloseDate":"2022-04-27T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"As the Deputy Chief Human Resources Officer, the incumbent acts as full alter ego to the Chief Human Resources Officer with complete authority to act for and make commitments with respect to all matters regarding the functions and responsibilities of the Directorate.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","SubAgencyName":"Human Resources Directorate","OrganizationCodes":"DD/DD21","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Office of the Secretary of Defense (OSD) is the principal staff element of the Secretary of Defense in the exercise of policy development, planning, resource management, and program evaluation responsibilities. OSD includes the Offices of the Secretary and Deputy Secretary of Defense, Under Secretaries of Defense, Deputy Chief Management Officer, Assistant Secretaries of Defense, General Counsel, and the Director of Administration. This position is in the Senior Executive Service (SES), a small, elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["In coordination with the Chief Human Resources Officer, the Deputy Chief Human Resources Officer exercises broad oversight and direction in the following areas: -- Serves as principal advisor to the Director of Administration and Management, the Director, Washington Headquarters Services, and other senior DoD officials on all matters of human resources management and personnel security. -- Through subordinate staff members, directs the civilian personnel program (classification, staffing, recruitment, employee training and development, employee relations, benefits, policy, personnel security, performance management, awards, and information management). Coordinates HR operational activities within and among these functions to help ensure consistent and timely delivery of services. -- Oversees certain Department-wide personnel responsibilities. These are concerned with: (1) the interviewing, referral, and/or placement of applicants referred for non-career appointment to the Secretary of Defense by the White House or similar sources; (2) the preparation of replies to inquiries from many sources on employment and career possibilities in the Department of Defense; (3) the preparation of replies to Congressional inquiries on certain phases of DoD or the Military Departments' hiring processes; (4) the development of coordinated DoD positions on special projects growing out of specific requests from OSD offices; and, (5) representation of DoD HR and security programs and positions to the interagency. Provides DoD-wide management of actions regarding experts and consultants (including members of Boards and Committees), Schedule C, and Non-career SES. Serves as DoD focal point for the management of all SES Non-career and Schedule C actions in the department including reporting on same. -- In the area of personnel security, has responsibility for personnel security processing, administration, appeals, and policy for the WHS-supported component. Also represents Defense Agencies' and DoD Field Activities' security interests at DoD and intelligence community fora. This includes the review and evaluation of background investigations, counterintelligence reports, criminal investigations, and security reports necessary for determining eligibility for access to classified information, and appointment to sensitive positions or assignment to Presidential support duties as well as appeals of adverse determinations. Also included is responsibility for initiating investigations of Congressional staff personnel and issuing their security clearances and maintaining active security files and data files on government visitors to OSD. Scope covers approximately 67,000 civilian positions assigned to the OSD, its Defense Agencies, DoD Field Activities, components, and supported organizations. -- Actively participates in the development of civilian personnel, personnel security, and voluntary campaigns management policy on a Government-wide and Department-wide basis. Represents the Office of the Secretary of Defense on the OPM Interagency Advisory Group and represents the Department and/or OSD on other DoD or interdepartmental boards, committees, panels, or working groups which develop policy recommendations and legislative proposals on personnel matters for consideration of the Secretary of Defense, the OPM or the Congress."],"Education":"There is no education requirement for this position.","Requirements":"You must be a U.S. citizen to qualify for this position. All newly appointed Career SES leaders must sign the Reassignment Rights Obligations Agreement as a condition of appointment into the SES. You must submit to a drug test and receive a negative drug test before you can be appointed into this position. Designated and/or Random Drug Testing required. In order to qualify for this position, you must be able to obtain a Top Secret security clearance and access to Sensitive Compartmented Information (TS/SCI). Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 04/27/2022 The individual selected will be required to file an 'Executive Branch Personnel Financial Disclosure Report (OGE-278) in accordance with the Ethics in Government Act of 1978. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. Males born after 12-31-59 must be registered or exempt from Selective Service (seehttps://www.sss.gov/Home/Registration).","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments, experience, and education. Your application will be evaluated by a rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the appointing authority. Unless you have already been certified by the Office of Personnel Management (OPM) Qualifications Review Board (QRB), your ECQs must be certified by the OPM QRB before your appointment can occur.","HowToApply":"TO SUBMIT AN APPLICATION THROUGH USAJOBS: In order to expedite the review of your application, you must submit a complete online application package to include the Resume, the Mandatory Technical Qualifications, and the Executive Core Qualifications. To apply online, please select the 'Apply Online' button at the bottom of this announcement. Please note: your online resume may not be a complete application. Be sure to carefully read this announcement to see if additional information is required and how it should be submitted. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: https://help.usastaffing.gov/Apply/index.php? title=Alternate_Application_Information","WhatToExpectNext":"After all application packages have been received, we will review your application to ensure you meet the basic qualification requirements. The Executive Evaluation Panel will evaluate each applicant who meets the basic qualifications based on the information provided and will generate a certificate of best qualified candidates for the selecting official. The selecting official may interview the best qualified candidates before making a selection. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement.","RequiredDocuments":"1. Resume - In addition to your written statements addressing the Executive Core Qualifications, the Mandatory Technical Qualification(s), and other qualifications as applicable, submit a resume or any other written format you choose to describe your qualifications, not to exceed five pages. Applicants typically provide the following information: Vacancy Announcement number SES-11446679-22-KF Full name, email and mailing address, and day and evening telephone numbers Educational information including the name, city, and state of colleges or universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://http://www.edu.gov/admins/finaid/accred/index.html Information about your paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary Information about honors, awards, and special accomplishments Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 04/27/2022~ 2. Mandatory Technical Qualifications (MTQs): A narrative statement specifically addressing each mandatory technical qualification. Statement should not exceed two pages per MTQ. 3. Mandatory ECQ Statement: A narrative statement specifically addressing each individual ECQ. In lieu of the narrative statement, current career SES members, reinstatement eligibles, and SES Candidate Development Program graduates must provide the documentation in item #4. 4. Copy of the Notification of Personnel Action (SF-50): Must submit most recent SF-50. Current and former career SES members must provide an SF-50 showing their status or reinstatement eligibility. Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as award certificates will not be considered.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"Veterans preference is not applicable to the Senior Executive Service. Applications MUST be submitted through USAJobs. Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 04/27/2022","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"whs.pentagon.hrd.mbx.semo-job-application-assistant@mail.mil","AgencyContactPhone":"703-693-8548","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"646032600","MatchedObjectDescriptor":{"PositionID":"ST-11441225-22-MPM","PositionTitle":"Occupational Health Technician","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/646032600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/646032600?PostingChannelID="],"PositionLocationDisplay":"Bremerton, Washington","PositionLocation":[{"LocationName":"Bremerton, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Bremerton, Washington","Longitude":-122.6257,"Latitude":47.565002}],"OrganizationName":"Naval Medical Command","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Health Aid And Technician","Code":"0640"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Your resume must demonstrate at least one year of Specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: Experience and familiarity performing various screenings pertaining to spirometry and audiometry such as vision, vital signs, and electrocardiograms (EKGs) and review results for completeness and accuracy. Experience utilizing computers for input /retrieval of medical information (i.e. CHCS, ADS, PC Matrix). Experience documenting spirometry and audiometry screening results and record-keeping requirements in order to accurately record inpatient records and for release of patient information under HIPPA. Experience providing triage to patients as they arrive, identifying those whose examination/evaluations will need to be expedited. Additional qualification information can be found from the following Office of Personnel Management website:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=List-by-Occupational-Series https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0600/health-aid-and-technician-series-0640/ Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"39873.0","MaximumRange":"51834.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-06T00:00:00.0000","PositionEndDate":"2022-04-18T23:59:59.9970","PublicationStartDate":"2022-04-06T00:00:00.0000","ApplicationCloseDate":"2022-04-18T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as an OCCUPATIONAL HEALTH TECHNICIAN for NMRTC BREMERTON WA. **This position is scheduled to transfer to the Defense Health Agency. If selected, there will be no change to your position title, pay plan, series, grade, or pay when the transfer occurs.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"5","HighGrade":"5","PromotionPotential":"7","OrganizationCodes":"DD/NV18","Relocation":"False","HiringPath":["fed-transition","fed-competitive","disability","land","mspouse","ses","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will review all pertinent data and determine requirements for ancillary testing and program placement.","You will counsel patients regarding test results, health promotion topics and workplace health hazards.","You will interpret and apply Industrial Hygiene reports to identify programs or classification exams for subject employees.","You will document patient encounter information and appropriate codes in the electronic health record per current instructions and guidelines.","You will compile with infection control guidelines and practice including universal precautions.","You will provide administrative support, which may include patient scheduling, patient reception, answering phone, compiling patient statistical reports."],"Education":"SUBSTITUTION OF EDUCATION FOR EXPERIENCE FOR GS-05: Applicants may substitute the following education for the required experience, provided it demonstrates the knowledge, skills and abilities necessary to do the work of the position: Successful completion of a full 4-year course of study leading to a bachelor's degree, with major study or at least 24 semester hours in subjects directly related to the position. You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. When the application process is complete, we will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this announcement. You will be rated based on the information provided in your resume and responses to the Occupational Questionnaire, along with your supporting documentation to determine your ability to demonstrate the following competencies: CLERICAL SUPPORT FUNCTIONSPATIENT CAREPATIENT RAPPORT AND HEALTHCARE ADVOCACYSAFETY AND QUALITY CARE You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, your score may be adjusted to more accurately reflect your abilities or you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume.\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11441225\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 04/18/2022. Applications received after 04/18/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made. NOTE: Due to COVID19, if you have any questions or need assistance, please email the DON Employment Information Center at DONEIC@navy.mil","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. Are you applying for a promotion? If you are a current GS employee applying for a higher grade than the grade that you currently hold you must provide an SF-50 that shows that you have held the next lower grade for at least one year. Some SF-50s effective within the last 52 weeks will not demonstrate you have held the next lower grade for at least one year (e.g. General Adjustment SF-50 from this year). In many cases, we need to see two (2) SF-50s to determine time-in-grade and eligibility for promotion. If you are a DoD employee, you can obtain a copy of your SF- 50(s) from MyBiz. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf This position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required. ICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher. ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/ Military Spouse Preference applicants will receive priority consideration at the Full Performance Level (FPL) and if determined to be Best Qualified at the FPL, and selected, must be placed at the FPL. A BQ military spouse possesses knowledge, skills, abilities, and competencies comparable to others who meet the competitive referral criteria for the specific position.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"doneic@us.navy.mil","SecurityClearance":"Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"648013900","MatchedObjectDescriptor":{"PositionID":"ST-11456594-22-JS","PositionTitle":"DIRECTOR, CHINA STRATEGIC FOCUS GROUP","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/648013900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/648013900?PostingChannelID="],"PositionLocationDisplay":"Camp H.M. Smith Marine Corp Base, Hawaii","PositionLocation":[{"LocationName":"Camp H.M. Smith Marine Corp Base, Hawaii","CountryCode":"United States","CountrySubDivisionCode":"Hawaii","CityName":"Camp H.M. Smith Marine Corp Base, Hawaii","Longitude":-157.9064,"Latitude":21.38583}],"OrganizationName":"Immediate Office of the Chief of Naval Operations","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"SL"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the Mandatory Technical Qualifications will eliminate you from consideration. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Expert knowledge and direct experience in leading strategic change, pioneering solutions, and implementing designs to meet enterprise goals. Lead other skilled professionals, and personally performs difficult and challenging programming, analytical, communication, and managerial work. 2. In-depth technical knowledge, academic training, joint military experience, and demonstrated ability to lead, manage, conduct analysis, and perform original plans and policy work in a variety of strategic and policy fields, related to China. Expert knowledge of strategic studies, and principles, methods, and techniques of the scientific method and scientific research. 3. Demonstrated experience and diplomacy in dealing with high-level individuals, including foreign dignitaries on regional/foreign issues, prevailing political information, diplomatic, military, and economic circumstances on China-related matters. 4. Expert knowledge and understanding of politics, diplomacy, economics, history, and military courses of action, forces, capabilities, policy, doctrine and characteristics of China, Taiwan, and the region. Ability to speak and read Mandarin Chinese, to include ability to effectively utilize Chinese and Taiwan electronic and print information sources. 5. Expert knowledge of the acquisition and procurement processes, with demonstrated experience in taking a program from concept through fully operational capability. Extensive experience and knowledge of large organizational acquisition and budgeting processes and procedures. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-11T00:00:00.0000","PositionEndDate":"2022-04-25T23:59:59.9970","PublicationStartDate":"2022-04-11T00:00:00.0000","ApplicationCloseDate":"2022-04-25T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Director, China Strategic Focus Group (SFG) directly reporting to the Deputy Commander, U.S. Indo-Pacific Command (USPACOM). A Cost-of-Living-Allowance (COLA) of 9.75% will be added to the stated salary.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV11","Relocation":"True","HiringPath":["fed-competitive","land","ses","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will direct qualitative and quantitative, whole of government analysis and comparative assessment of strategies, policies, operations, activities, and legal issues pertaining to China and Taiwan regional and global agendas.","You will execute complex operational programs related to the National Defense Strategy's number one strategic competition priority.","You will establish Department of Defense (DoD) initiatives; research adversary strategy/doctrine; design advanced analytic processes and sophisticated support tools to integrate across multiple government agencies.","You will build coalitions, public/private, to improve China SFG production, collaborate and integrate findings into DoD-wide processes to meet organizational requirements.","You will lead an expert, cross functional/national network of specialists, facilitate cooperation and teamwork, resolve conflicts at individual and organizational levels to achieve Command's priority goals.","You will serve as senior advisor/technical expert on China-related matters; meet Command's goals on national security interests; and coordinate DoD-wide strategic programs/processes.","You will communicate strategic assessments, drive organizational adaptation; make decisions that create high-quality results.","You will manage human, financial, and information resources."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad-hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11456594\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 04/25/2022. Applications received after 04/25/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. A separate narrative statement is required. Your narrative statement must address the Mandatory Technical Qualifications (MTQs) listed above. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is a Senior Level position in the federal government. Senior Level employees are in non-executive positions whose duties are broad and complex enough to be classified above GS 15 level. Senior level positions involve highly specialized and complex work. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Eligible DoD career or career conditional employees shall be granted statutory return rights to their former position for a period of 5 years if continuously employed in a foreign or non-foreign area provided by Executive Order 10895 and DoDI 1400.25, v 1230. Employees that do not exercise their return rights within five years are no longer eligible for return rights and will be treated as a local hire. Certain incentives (such as Recruitment, Relocation or Student Loan Repayment) may be authorized to eligible selectees. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is eligible for part time, full time or ad-hoc telework at the discretion of management.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"644689400","MatchedObjectDescriptor":{"PositionID":"DA-2022-CC-11436591","PositionTitle":"Division Programs Director SWD","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/644689400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/644689400?PostingChannelID="],"PositionLocationDisplay":"Dallas, Texas","PositionLocation":[{"LocationName":"Dallas, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Dallas, Texas","Longitude":-96.80286,"Latitude":32.779137}],"OrganizationName":"U.S. Army Corps of Engineers","DepartmentName":"Department of the Army","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"**To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), Technical Qualification(s), and other qualifications, if applicable (such as Education - see below). Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp. (1) Mandatory Executive Core Qualification (MANDATORY SUBMISSION) (ECQ) All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. Use the Challenge-Context-Action-Result (CCAR) Model to describe your accomplishments. You must address each ECQ separately. You are required to respond to all ECQs. Failure to do so, will result in an 'ineligible' rating. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Please Note: Current career SES members, former career SES members with reinstatement eligibility, and SES Candidate Development Program (DCP), who have been certified by the OPM do not need to address ECQs, However when applying you must load your certificate under the Executive Core Qualifications. ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ isthe ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. (2) MANDATORY TECHNICAL QUALIFICATION(S) (TQ): (MANDATORY SUBMISSION) A supplemental statement must be submitted separately addressing each TQ. Your TQ must provide specific examples that address relevant experience and accomplishments. Total TQ write-up should not exceed 2 pages per TQ using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: MTQ 1: Demonstrated ability to manage the overall direction, program management and execution of the Division's Civil Works (Planning and Policy, Environmental Stewardship, Coastal Storm Damage Reduction, Flood Risk Management, Operations - Navigation, Hydropower, Recreation, Aquatic Ecosystem Restoration, Real Estate), Military Construction (Military Construction\n(MILCON), Facilities Sustainment, Restoration, and Modernization (SRM), Hazardous, Toxic, Radiological Waste (HTRW) remediation, Real Estate), and Interagency Programs at distributed locations. MTQ 2: Ability to represents the Division as an authorized technical representative with other regional federal and non-federal entities within the Division boundaries. Ability to participate with the Division Commander on Congressional engagements and to establish working relationship with various functional chiefs, Congressional members and their staffs, other federal departments, and state and local government officials within the Division AOR.","PositionRemuneration":[{"MinimumRange":"135468.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-24T00:00:00.0000","PositionEndDate":"2022-04-21T23:59:59.9970","PublicationStartDate":"2022-03-24T00:00:00.0000","ApplicationCloseDate":"2022-04-21T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Extended until 21 Apr 2022 - No changes to requirements. See below","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/ARCE","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. This position is in the Senior Executive Service (SES) which is a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. The Department of the Army is an Equal Opportunity Employer.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Serves as the Division Programs Director, with responsibility and accountability for overall direction, staff management, and program management of the Division's Civil Works, Military Missions, and Interagency Support Programs. Responsible for development, defense, and execution of the Civil Works Program in the Southwestern Division region within six States to include Congressional and stakeholder engagement. Also responsible for executing the Military Missions within three States to include Army, Air Force, DOD Military Construction, Installation Support to military installations, Environmental Restoration and Hazardous & Toxic Radioactive Waste Remediation, and Interagency Support to other federal agencies. Programs and projects are funded through multiple sources to include Civil Works, DOD, Army, Air Force, other federal agencies, and local sponsors. Manages completion of multi-year programs, within appropriations and constraints to achieve targeted quality, budget and schedule requirements. This process requires integration and reconciliation of the perspectives of the Regional Business Directorate and other Division Headquarters elements to assure adherence to Department of the Army commitments made to Congress, Major Commands, installations, sponsors, and State and local government officials. Responsible for quality process management, technology transfer, and the maintenance and development of core competencies within the program/project management, environmental, civil works operations, regulatory permitting under the Clean Water Act, real estate, and planning technical functions. Directly supervises positions through the GS-15 level and indirectly supervises (provides staff supervision over) positions performing technical functions in subordinate districts. Under broad authority from the Division Commanding General, the Programs Director is steward for executive direction and management through four USACE Districts planning, operating, maintaining, and constructing infrastructure driven by requirements generated by non-federal water resource partners, military departments, and other federal agencies."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"CONDITIONS OF EMPLOYMENT:\nYou must be a U.S. citizen to be eligible for this position.\nYou must be able to submit and pass designated and/or Random Drug Testing as required.\nYou must sign a mobility agreement.\nYou must be able to obtain/maintain the appropriate clearance and access level for this position.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/ Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. Appointment is subject to the completion of a favorable suitability or fitness determination, as determined by a background investigation. Direct deposit of pay is required. This position requires you to submit a Public Financial Disclosure Report (OGE 278) upon entry, and annually thereafter. The incumbent is required to travel on both scheduled and unscheduled aircraft, and other modes as required, under conditions specified under the DoD Joint Travel Regulations. The incumbent is expected to travel on short notice to attend high level meetings to obtain resolution of problems and gather information to assist in the decision making process. Mobility: An essential element of the SES is mobility across geographic, organizational and functional lines. Individuals selected for Army SES positions may be subject to reassignment that requires them to be mobile. The U.S. Army senior leadership considers mobility to be an integral part of employment as an SES member with the Department of the Army.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments and experience.\nYour resume will be evaluated by an SES rating and ranking panel, and afterwards, highly qualified candidates will undergo the Structured Interview process.\nThe Executive Resources Board (ERB) will review results and make recommendations on final selections to the appointing authority where final interviews and reference checks may occur.","HowToApply":"*** You MUST apply online. Applying online will allow you to review and track the status of your application.*** To receive consideration, applicants must submit application material as specified below. Complete applications must be received in this office by 11:59 p.m. Eastern Time (ET) 04/21/2022. Incomplete applications will not be considered. Do not submit additional items such as copies of additional performance appraisals, position descriptions, etc. Such items may be removed and will not be returned. Also application material cannot be returned. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the View Occupational Questionnaire Click the Submit My Answers button to submit your application package. It is your responsibility to ensure your responses and appropriate documentation is submitted prior to 11:59 p.m. Eastern Time (ET) . To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the more information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. Applicants who fail to submit all information and documents (i.e. Resume, ECQs, TQs, SF50 if applicable, and Performance Appraisal/Letter of Recommendation, Occupational Questionnaire, and other qualifications as applicable) WILL NOT receive consideration for the position. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. You must upload your ECQs, TQs and any Official Transcripts when required. If you have an SF50, please submit that as well. Your performance assessment or a Letter of Recommendation IS mandatory. Upload either document under Performance Appraisal. All Required documents must be uploaded or your application will be considered incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. ************************************************************\nBackground Survey Questionnaire, (OPTIONAL SUBMISSION): Form (O.M.B. No. 3046-0046) located: http://www.archives.gov/careers/jobs/forms/omb-3046-0046.pdf The information from this survey is used to help insure that agency personnel practices meet the requirements of Federal law. This information is provided pursuant to Public Law 93-579 (Privacy Act of 1974), December 31, 1974, for individuals completing Federal records and forms that solicit personal information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application..","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. We will evaluate each applicant who meets the basic qualifications based on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct a suitability and/or security background investigation. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement. If you are determined to be ineligible or not qualified, or your application is incomplete, your application will receive no further consideration. Pay is set based on consideration of selectee's current salary and other factors. Once you enter on duty, you will be required to complete a Confidential Financial Disclosure Report (OGE 278e) within 30 days of entering this position. Please notify your servicing ethics counselor (part of the legal office) as soon as possible after starting your SES duties so the ethics counselor can assign you a new entrant report in the online Integrity system, (https://integrity.gov/efeds-login/).","RequiredDocuments":"To apply for this position, you must provide a complete Application Package which includes:\n1. Your Resume (MANDATORY SUBMISSION): Submit a resume or any other written format you choose to describe your qualifications. Your resume must contain: Vacancy Announcement number Full name, email, mailing address, day and evening telephone numbers. Educational information including the name, city, and state of colleges/universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www2.ed.gov/admins/finaid/accred/index.html Information about paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. Information about honors, awards, and special accomplishments. 2. Executive Core Qualifications (MANDATORY SUBMISSION): A narrative statement specifically addressing each individual ECQ using the Challenge-Context-Action-Result Model.\nEach accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp In lieu of the narrative statement, current career SES members, reinstatement eligible, and SES Candidate Development Program graduates must provide the documentation listed in item #5 - you must load your certificate under the Executive Core Qualifications.\n.\n3. Mandatory Technical Qualification (MANDATORY SUBMISSION): A separate narrative statement specifically addressing the mandatory technical qualification. This separate statement should not exceed two pages (per MTQ) using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: MTQ 1: Ability to manage the overall direction, program management and execution of the Division's Civil Works (Planning and Policy, Environmental Stewardship, Coastal Storm Damage Reduction, Flood Risk Management, Operations - Navigation, Hydropower, Recreation, Aquatic Ecosystem Restoration, Real Estate), Military Construction (Military Construction\n(MILCON), Facilities Sustainment, Restoration, and Modernization (SRM), Hazardous, Toxic, Radiological Waste (HTRW) remediation, Real Estate), and Interagency Programs at distributed locations MTQ 2: Ability to represents the Division as an authorized technical representative with other regional federal and non-federal entities within the Division boundaries. Ability to participate with the Division Commander on Congressional engagements and to establish working relationship with various functional chiefs, Congressional members and their staffs, other federal departments, and state and local government officials within the Division AOR 4. Performance Assessment. (MANDATORY SUBMISSION): Submit ONE of the following: A signed letter of recommendation dated within the last three years that assesses your performance; *or* your most recent signed performance appraisal. (Please do not submit any prior appraisals.) 5. Current or former employees MUST provide an SF-50 showing their status or reinstatement eligibility. SES Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Veteran's Preference: By law Veteran's Preference does not apply to the Senior Executive Service. False Statements: If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or you may be subject to fine, imprisonment, or other disciplinary action. Non Discrimination: All applicants will be considered without regard to race, color, religion, national origin, marital status, political affiliation, age, sex, sexual orientation, disabling condition, membership in an employee organization, or any other non-merit factors. Adverse Information Screening: Applicants proposed for selection are subject to inquiries as to any incidences of misconduct, malfeasance, neglect of duty, or the appearance thereof. Information gained in this check will be considered in the approval decision. E-verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" system. Federal Law requires DHS to use the E-Verify system to verify the employment eligibility of all new hires, and obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system as a condition of continued employment. The U.S. Department of Army is an E-Verify Participant.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"CHONGKIN.CHIN.CIV@ARMY.MIL","AgencyContactPhone":"7036926313","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"647416000","MatchedObjectDescriptor":{"PositionID":"1182345","PositionTitle":"Senior Executive Leader - Chief, Logistics Services","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/647416000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/647416000?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Logistics Management","Code":"0346"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"CompetenciesWEIGHTED SELECTION CRITERIA:\nLeading Change: 20 points- Creates a work environment that encourages creative thinking and innovation.- Understands near-term and long-range plans and uses the information to posture an organization to be competitive and forward-thinking- Adapts behaviors and work methods in response to new information, changing conditions, or unexpected obstacles- Determines objectives and sets priorities while anticipating potential obstacles or opportunities- Takes a long-term view and acts as a catalyst for organizational change: builds a shared vision with others- Deals effectively with stress and fast-moving events- Creates and sustains a culture of quality service and high performance\nLeading People: 20 points- Inspires, motivates, and guides the workforce towards achievement of mission objectives and goals- Establishes clear performance metrics and job objectives- Empowers people to lead change and take responsibility- Resolves conflicts and disagreements in a positive and constructive manner to minimize negative impact- Leads and manages an inclusive workplace that maximizes the talents of each person to achieve sound business results- Instills mutual trust and confidence: creates a culture that fosters a high standard of ethics- Inspires, motivates, and guides others toward goal accomplishment. Consistently develops and sustains cooperative working relationships- Develops leadership in others through coaching, mentoring, rewarding and guiding employees\nResults Driven: 30 points- Holds self and others accountable; monitors and evaluates plans, focuses on results and measuring attainment of objectives- Anticipates and meets the needs of customers; is committed to continuous improvement in services- Balances interests of a variety of customers; readily readjusts priorities to respond to pressing and changing demands- Perceives the impact and implications of decisions; makes effective and timely decisions, even when data is limited- Understands and appropriately applies procedures, requirements, regulations, and policies\nBusiness Acumen: 15 points- Assesses current and future staffing needs based on organizational goals and budget realities. Using merit principles, ensures staff is appropriately selected, developed, utilized, appraised, and rewarded- Develops strategies to enhance overall mission effectiveness- Recognizes and assesses changing requirements and their resource implications- Selects well-qualified employees to fill critical mission needs- Assesses changing needs and advances in technology and customer requirements in order to effect responsive actions- Markets effectively to senior leadership, partners and customers to achieve and promote mission success\nBuilding Coalitions: 15 points- Persuades others; builds consensus through give-and-take; gains cooperation from others to obtain information and accomplish goals; facilitates \"win-win\" solutions- Builds teams/coalitions with leadership as well as across the workforce- Facilitates an open exchange of ideas and fosters an atmosphere of open communication- Makes clear and convincing oral presentations to individuals or groups; listens effectively and clarifies information as needed- Develops networks and builds alliances, engages in cross-functional activities; collaborates across organizational boundaries and finds common ground with a wide range of stakeholders.- Utilizes contacts to build and strengthen internal support bases- Expresses facts and ideas in a clear, convincing, and organized manner- Possesses strong communication skills, bother verbal and written: proven ability to write for audiences of varying levels, and to brief senior management","PositionRemuneration":[{"MinimumRange":"135468.0","MaximumRange":"187300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-06T00:00:00.0000","PositionEndDate":"2022-05-06T23:59:59.9970","PublicationStartDate":"2022-04-06T00:00:00.0000","ApplicationCloseDate":"2022-05-06T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Workforce Support Activities Directorate is seeking a dynamic leader with deep expertise in the logistics services arena to run a world-class global logistics support system to support then National Security Agency's mission worldwide.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","PromotionPotentialAdditionalText":"ES 1/1 - 1/6","OrganizationCodes":"DD/DD28","Relocation":"True","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"TotalOpenings":"1","AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"Leaders at the National Security Agency motivate, support, and cultivate employees at all levels. Leaders at the NSA, where people are a priority, are responsible for leveraging the diversity of their workforce to create innovative solutions that support the Agency's mission.","TravelCode":"1","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15172","MajorDuties":["The Logistics Office is a part of the Installations and Logistics Group and is responsible for the planning, programming, budgeting and execution of logistics operations in the following areas:\n- Receiving &amp; Shipping- Property Management- Cafeteria &amp; Employee Morale, Welfare and Recreational Services- Transportation and Travel Services, to include the operation and maintenance of a sizable worldwide motor vehicle fleet"],"Education":"","Requirements":"The position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI).","Evaluations":"To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n***PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://cicad.us/3J8wXUt.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"NSA&rsquo;s outstanding benefits provide employees with a better quality of life, both on the job and off, including flexible schedules; generous leave programs; health and life insurance; federal retirement plans; on-site fitness facilities; and personal and family wellness resources.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"N/A","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"648005500","MatchedObjectDescriptor":{"PositionID":"DE-11452470-22-RBS","PositionTitle":"DIVISION TECHNICAL DIRECTOR, NAVAL SURFACE WARFARE CENTER, PHILADELPHIA DIVISION","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/648005500","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/648005500?PostingChannelID="],"PositionLocationDisplay":"Naval Business Center, Philadelphia, Pennsylvania","PositionLocation":[{"LocationName":"Naval Business Center, Philadelphia, Pennsylvania","CountryCode":"United States","CountrySubDivisionCode":"Pennsylvania","CityName":"Naval Business Center, Philadelphia, Pennsylvania","Longitude":-75.16379,"Latitude":39.952335}],"OrganizationName":"Naval Sea Systems Command","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"General Engineering","Code":"0801"},{"Name":"General Physical Science","Code":"1301"},{"Name":"Operations Research","Code":"1515"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications will eliminate you from consideration. EXECUTIVE CORE QUALIFICATIONS: You will be assessed against the Executive Core Qualifications (ECQs).They are designed to assess executive experience and potential - not technical expertise. They measure whether you have the broad executive skills needed in a variety of senior executive positions. Failure to meet a qualification requirement will disqualify an applicant. (Each must be addressed separately in your Supplemental Narrative Statement. The ECQs must not exceed 10 pages.) More information on these core qualifications are available at http://www.opm.gov/ses/recruitment/ecq.asp The ECQs describe the leadership skills needed to succeed as an SES; they also reinforce the concept of an \"SES corporate culture.\" Refer to the OPM Guide to SES Qualifications for specific information and guidance on the ECQ requirements, the C-C-A-R model, and examples of good qualifications statements at the website: http://www.opm.gov/policy-data-oversight/senior-executive-service/reference-materials/guidetosesquals_2012.pdf (Note: Current career Senior Executive Service (SES); former career Senior Executive Service (SES) who are reinstatement-eligible; and graduates of OPM-certified Candidate Development Programs are not required to address the ECQs, but must address the Mandatory Technical Qualifications.) 1) Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. 2) Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent in this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. 3) Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent in the ECQ is the ability to make decisions that produce high- quality results by applying technical knowledge, analyzing problems, and calculating risks. 4) Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. 5) Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, state and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Knowledge of defense organization, mission, and operations (including technologies, design, systems engineering, systems acquisition, engineering development, test and evaluation, logistics engineering, Fleet introduction, in-service support, and disposal). 2. Ability to assess and balance current and projected mission requirements, capabilities, and workload demand with current and future workforce of scientists, engineers and requisite facilities. 3. Knowledge of business and financial management systems and principles, and the ability to plan and direct technical and business functions. 4. Ability to plan, direct, and resolve technical and business issues for surface and undersea vehicle machinery, ship systems, equipment and material in the areas of research, development, test and evaluation (RDT&E), fleet support, engineering, acquisition support, cyber-security, comprehensive logistics, and commonality. 5. Knowledge of and competence in science and technology, RDT&E, acquisition policy, and in project management and execution in the broad areas of surface and undersea vehicle machinery, ship systems, equipment. Additional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#GS-PROF\n0801 Professional Engineering Series\n1301 General Physical Science Series\n1515 Operations Research Series Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-12T00:00:00.0000","PositionEndDate":"2022-05-11T23:59:59.9970","PublicationStartDate":"2022-04-12T00:00:00.0000","ApplicationCloseDate":"2022-05-11T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position is in the Senior Executive Service (SES), a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. You will serve as the Division Technical Director of Naval Surface Warfare Center, Philadelphia Division (NSWC PHILA DIV).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV24","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will provide senior civilian perspective and continuity of leadership to the workforce, stewards technical excellence, and enables competency alignment between the Division and headquarters elements.","You will oversee the technical direction of unprecedented and diverse research and development, test and evaluation, acquisition support, engineering, systems integration, in-service engineering, energy and power capabilities programs.","You will oversee the technical direction of cyber security programs of Naval Surface Warfare Center Philadelphia for surface and undersea vehicle machinery, ship systems, equipment and material.","You will be responsible for the long term stewardship of Division technical capabilities, including facilities and people, and the support infrastructure for Technical Authority Warrant Holders.","You will direct the development and execution of Naval Surface Warfare Center Philadelphia strategic planning and goals, incorporating the Strategic Plan tenets and organizational goals, and continually evaluating the progress towards those goals.","You will be responsible for the assessment of future Department of the Navy and Department of Defense needs and the potential of the technology and the political environment affecting national defense efforts."],"Education":"Applicants must meet the following Basic Requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual: FOR THE 801: Successful completion of a bachelor's or higher engineering degree from an accredited college or university. To be acceptable, the program must: (1) lead to a bachelor's degree in a school of engineering with at least one program accredited by ABET; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. Such education must demonstrate the knowledge, skills, and abilities necessary to do the work of the position. -or- Combination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following: (I) Professional registration or licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT), or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions; or (II) Written Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE) examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico; or (III) Specified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in the basic requirements under paragraph A. The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A; or (IV) Related curriculum -- Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions. (The above examples of related curricula are not all inclusive.) -OR- FOR THE 1301: Successful completion of a degree in physical science, engineering, or mathematics that includes 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics; or, a combination of education and experience in one of the above majors that includes at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education. -OR- FOR THE 1515: Successful completion of a degree in operations research; or a degree with at least 24 semester hours in a combination of operations research, mathematics, probability, statistics, mathematical logic, science, or subject-matter courses requiring substantial competence in college-level mathematics or statistics. At least 3 of the 24 semester hours must have been in calculus.","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad-hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g., GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11452470\n3. Supporting documentation. Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 05/11/2022. Applications received after 05/11/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statement must address the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs) listed above. Are you a current or former SES Career employee appointed under Title 5 U.S.C. 3393? You must include a copy of your SES Career appointment personnel action or SF-50. Are you a graduate of an approved SES training program? You must provide a copy of your certificate of completion. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. Veteran's preference does not apply to the Senior Executive Service. Certain incentives (such as Recruitment, Relocation or Student Loan Repayment) may be authorized to eligible selectees. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"641569500","MatchedObjectDescriptor":{"PositionID":"SES-11419501-22-SD","PositionTitle":"Deputy General Counsel","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/641569500","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/641569500?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Washington Headquarters Services","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Attorney","Code":"0905"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), the Mandatory Technical Qualifications, and other qualifications, if applicable, listed below. EXECUTIVE CORE QUALIFICATIONS: All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately, not to exceed a total of 10 pages. You are required to respond to all ECQs. Failure to do so will result in a rating of 'ineligible.' When responding to the Executive Core Qualifications (ECQs), you must clearly show that you possess the experience, knowledge, skills and ability to perform the duties of this position by submitting narrative responses in which you detail your experience in each of the ECQs. Your examples should be clear and emphasize your level of responsibilities, scope and complexity of programs managed, program accomplishments with results of your actions, policy initiatives and level of contacts. You should limit your narrative to two pages per ECQ, and address each ECQ separately. OPM's Guide to Senior Executive Service Qualifications can assist you in writing an effective SES application. In particular, please note the Challenge-Context-Action-Result Model that is recommended and very helpful when drafting ECQ narrative responses. The Guide is available on OPM's Website at:\nhttp://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Applicants must utilize the Challenge-Context-Action-Result (CCAR) Model when writing Executive Core Qualifications (ECQ). Use two examples of relevant experience for each ECQ being sure your experience matches the ECQ criteria. Challenge - Describe a specific problem or goal.\nContext - Describe the individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, co-workers, members of Congress, shrinking budget, low morale).\nAction - Discuss the specific actions you took to address a challenge.\nResult - Give specific examples of measures/outcomes that had some impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. MANDATORY TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. You are required to respond to all of the technical qualifications. If you fail to do so, you will be rated as ineligible. Please limit your written statements to no more than two pages per technical qualification. Comprehensive, professional knowledge of, and experience in, applying Federal statutes, regulations and case law in at least three of the following areas: civilian personnel, labor relations, and equal employment opportunity law; personnel security law; fiscal and appropriations law; federal procurement law; environmental law; information technology; the law of federal installations; standards of conduct; Federal Advisory Committee Act and Freedom of Information Act; criminal law, investigations, rules of engagement, use of force, search and seizure, First Amendment activities, insider threat, and rules of evidence in support of law enforcement and security; and administrative, real estate and real property management law. Demonstrated ability in effective and decisive decision-making, as well as the ability to solve problems of substantial impact, sensitivity, and complexity. Demonstrated ability in leading and managing a law office, legal office, or major legal division/department at the department/headquarters level.","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-18T00:00:00.0000","PositionEndDate":"2022-05-02T23:59:59.9970","PublicationStartDate":"2022-03-18T00:00:00.0000","ApplicationCloseDate":"2022-05-02T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position is located in the Defense Legal Services Agency (DLSA) with duties performed in the Washington Headquarters Services & Pentagon Force Protection Agency, Office of the General Counsel. The GC of the Department of Defense (DoD) serves as the chief legal officer of the Department of Defense. The WHS & PFPA Deputy General Counsel reports to the WHS & PFPA General Counsel.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/DD21","Relocation":"False","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"This position is in the Senior Executive Service (SES), a small, elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The incumbent serves as a legal advisor to organizations reporting to the Director of Administration and Management (DA&M), including the Director, Washington Headquarters Services (WHS); Director, Pentagon Force Protection Agency (PFPA); and the WHS and PFPA office directors. The Deputy General Counsel, WHS and PFPA provides legal advice, counsel, and guidance on the full range of operations of client organizations. Legal areas of emphasis include, but are not limited to: criminal law enforcement, security, anti-terrorism and force protection; personnel and administration; fiscal law, standards of conduct and conflicts of interest; office renovation and major construction initiatives; procurement and contracts, to include contracts for services, design and construction, information technology, and interagency acquisitions. Major duties and responsibilities include, but are not limited to: Serves as a principal legal advisor and provides comprehensive legal advice to the Director, PFPA, and the Director, WHS and the office directors within each organization. Provides comprehensive legal advice to WHS leadership and other personnel, including in the areas of human resources, acquisition; facilities, executive and business services; financial management; boards, commissions, and tasks forces; the WHS security programs; the defense historical office; and the WHS Equal Employment Opportunity program. Provides comprehensive legal advice to PFPA leadership and officers, including in the areas of security, law enforcement, force protection, anti-terrorism, support for investigation and crimes and the execution of law enforcement, and threats to the Department of Defense operations in the National Capitol Region. Provides legal advice and guidance on a wide variety of sensitive matters for the senior officials of WHS, PFPA, and the Office of the Secretary of Defense (OSD); assists the General Counsel, WHS and PFPA, in overseeing WHS and PFPA participation in adversarial proceedings, including hearings before the Merit Systems Protection Board, Equal Employment Opportunity Commission, U.S. District Court (including Magistrate's Court), Government Accountability Office, Armed Services Board of Contract Appeals, and other fora; and oversees the prosecution of cases by WHS & PFPA OGC lawyers acting as Special Assistant United States Attorneys in the Eastern District of Virginia. Provides specialized legal support to certain classified programs and activities of OSD that require operational and administrative legal support as well as to certain classified security and force protection matters assigned to PFPA and WHS; and provides operational counsel in support of the OSD Continuity of Operations Program and Command, Control Survivability Program. Oversees the legal component of training to all PFPA officers in rules of engagement, use of force, search and seizure, First Amendment issues, and rules of Evidence in support of the law enforcement and security services on the Pentagon Reservation."],"Education":"Candidates must meet the following education requirement for career series 0905: You must have a first professional law degree (LL.B. or J.D.). You must have a current license to practice law and be an active member in the bar of at least one state, the District of Columbia, or a U.S. commonwealth or U.S. territory, and be able to demonstrate that in a least one state or jurisdiction in which you are licensed you are permitted to engage in the active practice of law. Active status must be maintained in at least one state or jurisdiction during the course of employment. Applicants are not required to provide an official certificate demonstrating this active status, but must provide such a certificate to the selecting official if selected. A certified copy of a law school transcript is required as proof that you meet the educational requirement for this position (unofficial transcripts are acceptable) and must be provided to the selecting official if selected.","Requirements":"","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments, experience, and education. Your application will be evaluated by a rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the selecting official. Unless you have already been certified by the Office of Personnel Management (OPM) Qualifications Review Board (QRB), your ECQs must be certified by the OPM QRB before your appointment can occur.","HowToApply":"TO SUBMIT AN APPLICATION THROUGH USAJOBS: In order to expedite the review of your application, you must submit a complete online application package to include the Resume, the Mandatory Technical Qualifications, and the Executive Core Qualifications. To apply online, please select the 'Apply Online' button at the bottom of this announcement. Please note: your online resume may not be a complete application. Be sure to carefully read this announcement to see if additional information is required and how it should be submitted. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: https://help.usastaffing.gov/Apply/index.php? title=Alternate_Application_Information","WhatToExpectNext":"After all application packages have been received, we will review your application to ensure you meet the basic qualification requirements. The Executive Evaluation Panel will evaluate each applicant who meets the basic qualifications based on the information provided and will generate a certificate of best qualified candidates for the selecting official. The selecting official may interview the best qualified candidates before making a selection. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement.","RequiredDocuments":"1. Resume - In addition to your written statements addressing the Executive Core Qualifications, the Mandatory Technical Qualification(s), and other qualifications as applicable, submit a resume or any other written format you choose to describe your qualifications, not to exceed five pages. Applicants typically provide the following information: Vacancy Announcement number SES-11419501-22-SD Full name, email and mailing address, and day and evening telephone numbers Educational information including the name, city, and state of colleges or universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://http://www.edu.gov/admins/finaid/accred/index.html Information about your paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary Information about honors, awards, and special accomplishments Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 05/02/2022~ 2. Mandatory Technical Qualifications (MTQs): A narrative statement specifically addressing each mandatory technical qualification. Statement should not exceed two pages per MTQ. 3. Mandatory ECQ Statement: A narrative statement specifically addressing each individual ECQ. In lieu of the narrative statement, current career SES members, reinstatement eligibles, and SES Candidate Development Program graduates must provide the documentation in item #5. 4. Copy of the Notification of Personnel Action (SF-50): Current and former career SES members must provide an SF-50 showing their status. Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.).\nDO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as award certificates will not be considered.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"Veterans preference is not applicable to the Senior Executive Service. Applications MUST be submitted through USAJobs.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"whs.pentagon.hrd.mbx.semo-job-application-assistant@mail.mil","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"647077800","MatchedObjectDescriptor":{"PositionID":"MRL2022-06","PositionTitle":"Deputy Director Security Special Program Oversight and Information Protection","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/647077800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/647077800?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Eligibility will be based upon a clear showing the applicant has training, education and experience of the scope and quality sufficient to effectively carry-out the duties of the position. Candidates must exemplify the corporate perspective, leadership vision, broad experience and character needed in the SES corps not only to satisfy the immediate vacancy, but future vacancies which will occur in a variety of organizations, functions and locations. A. MANDATORY TECHNICAL QUALIFICATIONS (TQs): (NTE 2 pages - PDF format) A supplemental statement must be submitted separately addressing each TQ. TQs must provide specific examples that address relevant experience and accomplishments. Applicants should focus on recent experience, education, and training, as some Recruitment Panel and Executive Resources Board members may consider experience that's over 10 years old to be outdated. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: 1. Comprehensive senior level knowledge of U.S. national and DoD security policy with expertise in developing and disseminating strategies, plans, courses of action, directives and execution in at least two of the following areas: Special Access Program security and oversight; acquisitions security; personnel security; counter insider threat; information security. 2. Demonstrated senior level experience leading multifunction organizations and multidisciplinary teams in addressing, articulating and implementing complex planning and policy issues, policy analysis and risk mitigation, as well as advocating and successfully defending program and policy decisions at the highest levels of our government. In addition, DoD requires an Enterprise Perspective. The individual must possess a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives should demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required--this information should be embedded within the application package [Resume (not to exceed 5 pages) and Technical Qualifications (not to exceed a combined total of 2 pages)].","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"187300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-05T00:00:00.0000","PositionEndDate":"2022-04-18T23:59:59.9970","PublicationStartDate":"2022-04-05T00:00:00.0000","ApplicationCloseDate":"2022-04-18T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. The primary purpose of this position is to provides advice and assistance to the Secretary of the Air Force on all aspects of the DAF policies, plans and programs as they relate to security, special program oversight, and information protection.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/AF00","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The mission of the United States Air Force is to fly, fight and win...airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. SALARY: $163,333.00 - $187,300.00 per annum. (Air Force Tier 1) SES members are eligible for bonuses and/or ranks and stipends in addition to annual salary. AREA OF CONSIDERATION: Applications will be accepted from all qualified persons. SES members are eligible for Performance-Based Salary increases and/or bonuses. This is a SES Career Reserved position and is assigned a precedence priority code of DV-6/ Brig Gen, Tier 1 for protocol purposes. MOBILITY: Organizational and geographical mobility is essential in developing and managing SES and DISES leaders and generally is a key to advancement. Therefore, mobility is a condition of employment and appointed SES and DISES members will be required to sign a Reassignment Rights and Obligation Agreement.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Deputy Director of Security, Special Program Oversight, and Information Protection develops policies and plans, and integrates and coordinates execution for all organization function and activities. The incumbent provides advice and assistance to the Secretary of the Air Force on all aspects of the Department of the Air Force policies, plans and programs as they relate to security, special program oversight, and information protection; to include collective policies, processes and implementation of risk management and mitigation actions instituted to prevent the compromise, loss, unauthorized access/disclosure, destruction, distortion or non-accessibility of information, regardless of physical form or characteristics, over the life cycle of the information. In support of the Director of SAF/AAZ, maintains a continuing extensive interface with other elements throughout the Department of the Air Force, Department of Defense, other government agencies and private industry. Fully participates in executive-level policy formulations, planning and direction required for successful execution and accomplishment of the Departments Air Force Special Program Oversight and Information Protection missions. In this capacity, regulates access to Special Access Programs (SAP), sensitive information, controlled unclassified information, and classified information produced by, entrusted to, or under the control of the Air Force. Incumbent also advocates for resources to effect SAP oversight and information protection programs. The incumbent is the Special Access Program Control Officer (SAPCO) and is responsible for providing analysis to the Department of the Air Force (DAF) and Department of Defense (DoD) on all phases of Special Access Programs (Intelligence/Operational/Acquisition) to include physical, personnel, industrial, information assurance, information operations, antiterrorism, force and technology protection, critical infrastructure and operations security. The incumbent advises the Secretary on substantive Security, Intelligence, and Counter Intelligence issues, to include, analytical, resource management, system integration and architectures, organization and functions in intelligence, information warfare (IW), electronic combat (EC), foreign technology, and administration. Serves as the Secretary's representative to air staff, national intelligence agencies, and other policy-level organizations for intelligence resources, requirements, and future architectures. Provides expert analytical input impacting the Air Force, and also provides policy direction to the force relating to the overall mission to include developing short, intermediate, and long-range plan options, identifying resources\nneeded and deciding on or advising the Secretary on appropriate alternatives to meet changing requirements."],"Education":"","Requirements":"","Evaluations":"A Resume-based Senior Executive Service (SES) Hiring Method will be used for this recruitment. This method provides an alternative to traditional submissions that requires applicants to submit a resume and 10-page written Executive Core Qualification (ECQ) narrative statement. A well-written resume for this announcement should demonstrate to Senior Hiring Officials that you possess the essential ECQs with supporting accomplishments. Applicants should incorporate ECQs and technical competencies as they write their resumes and can refer to the following OPM Link for additional guidance on SES Executive Qualifications: https://www.opm.gov/policy-data-oversight/senior-executive-service/reference-materials/guidetosesquals_2012.pdf. In addition, the Department of the Air Force highly encourages applicants to seek mentoring assistance from a current SES member in preparing and/or reviewing their package. PLEASE NOTE: This position will be filled under the FY2021 NDAA Section 1118, \"Pilot Program for Initial Appointments to Senior Executive Service Positions in the Department of Defense (DoD).\" This authority allows us to appoint qualified individuals to initial career appointments into the Senior Executive Service of the DoD without regard to 5 U.S.C. 3393(c). A career SES appointment made under this authority does not guarantee that you will be eligible to transfer to another career SES appointment outside of the DoD without the need for you to compete. Other Federal agencies may require you to submit ECQs to OPM's QRB prior to your appointment in that agency. Applications will be evaluated against the qualifications requirements. Failure to meet the Mandatory Technical Qualifications standards will eliminate a candidate from further consideration. Candidates will be evaluated for this position by a screening panel composed of a diverse mix of senior executives and/or general officers selected for organizational and/or functional backgrounds relevant to this position. The panel discusses each application and reaches consensus on the resume packages demonstrating a high degree of the executive core qualifications and technical competencies. Only those applicants whose packages demonstrate a mastery of ECQs and technical competencies are selected for interviews. Post interview, the panel will then make a recommendation of those Best Qualified candidates who should be referred to the selecting official, in priority order. Final selection is contingent upon the approval of the Air Force Executive Resources Board and the Under Secretary of the Air Force. REMINDER: Before uploading your required PDF documents (Resume, Technical Qualification narrative), please ensure they DO NOT EXCEED the noted page limits.","HowToApply":"Please follow the below instructions to submit applications. Any applications received that do not include all of the required documents or do not meet format requirements will not be forwarded for consideration. The complete Application Package must be submitted by 11:59 PM (ET) on . To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Note: Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant. PREFERRED RESUME FORMAT: (Limit 5 pages/Times New Roman 12-font) (Do Not Use the USAJOBS Resume Builder) - Please submit a typewritten resume (upload as a PDF), including the following information: Job Information: Announcement number (MRL2022-06) and title of the position to which you are applying. Personal Information: Full name, mailing address (with zip code), day and evening phone numbers (with area code) and complete e-mail address where you would like to receive correspondence regarding your application. **PLEASE DO NOT INCLUDE SOCIAL SECURITY NUMBER** Active-Duty/Retired Military: State highest rank held, date of promotion and date eligible to retire or date of retirement. (e.g., Colonel/June 2006/December 2014). NOTE: IAW 5 U.S.C. 3326, a 180-day waiver will be required for retired or retiring members of the armed forces during the period of 180 days immediately after retirement. Education: Educational information, including the name, city and state of colleges or universities you attended, as well as the type and year of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www.ed.gov/admins/finaid/accred/index.html Work Experience: Give the following information for your paid and non-paid work experience related to the job for which you are applying: (Do not send job descriptions).\n- Starting and ending dates (month and year)\n- Job title (for government position, include civilian series and grade or military rank)\n- Employer's name and address\n- Supervisor's name and phone number, please indicate if we may contact your current supervisor\n- Salary (current) HELPFUL HINTS FOR YOUR RESUME: - Reflect on the ECQs and think about how your past experiences and education relate to each ECQ. Highly encourage using the CCAR format. - Read the vacancy announcement carefully. - Adhere to the 5-page limitation (in PDF format and 12 point font) - Quantify your accomplishments. * Applicants should focus on recency of experience - Recruitment Panels, Executive Resources Boards, and Hiring Officials may consider experience over 10 years outdated.\n* Seek mentoring assistance from a current SES or equivalent to review your package before submission. References: Provide the names, addresses and telephone numbers of three individuals who can comment on your qualifications for this position. Please do not list supervisors already listed above. This agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application or hiring process, please notify this office. The decision on granting reasonable accommodations will be on a case-by-case basis. SAF/MRL CONTACT INFORMATION: Questions regarding this announcement may be directed to Virginia Reynolds at virginia.reynolds@us.af.mil, Melanie McGuire at melanie.mcguire@us.af.mil or the SAF/MRL office at usaf.pentagon.af-a1.mbx.af-a1ls-ann-mbx@mail.mil.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"To receive full consideration, each applicant must submit the documents in the format as designated. Packages that do not include all of the required documents or meet format requirements will not be forwarded for consideration. **************ALL DOCUMENTS MUST BE UPLOADED IN PDF FORMAT******************* The Qualifications Documents must be formatted using Times New Roman, size 12 font, with 1-inch margins. Do not use borders, provide photos, or list a Social Security Number on any of the Qualifications Documents. DO NOT COMBINE DOCUMENTS. A. A resume-based application method will be used. Do NOT submit traditional ECQ narratives. Instead, applicants are required to submit a resume, not to exceed 5 pages, that shows possession of the ECQs. Upload in PDF format. PLEASE DO NOT USE USAJOBS RESUME BUILDER B. Mandatory Technical Qualifications Statement addressing each of the TQs. Your MTQs must not exceed a combined total of 2 pages. Upload in PDF format and include the MTQ statement as indicated in the announcement. C. Most recent completed Performance Appraisal (current and/or former federal employees) or Performance Report (OPR or EPR). For applicants in the private sector, please provide a copy of your equivalent Evaluation Report. D. Current or Former Senior Executives (SES) must provide a copy of their SF50 reflecting current or prior SES career status. OPM QRB certified CDP Graduates should provide a copy of their Qualifications Review Board (QRB) certification. E. Most recent Notification of Personnel Action, SF-50, noting your current position, grade level and salary level (applies only to current or former civilian government employee). F. (Optional) Copies of your transcripts. G. Military: Retired - a copy of your DD214 and/or Retirement orders; Active Duty - submit a Statement of Service Letter and state highest rank held date of promotion and date eligible to retire or date of retirement. Documents are required. H. (Optional): Race and National Origin Identification, SF-181 -- Form available at www.opm.gov I. (Optional): Self-Identification of Handicap, SF-256 -- Form available at www.opm.gov DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as copies of position descriptions, award certificates and transmittal letters will not be forwarded for review.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Education: A bachelor's degree from an accredited institution is desired. A master's or advanced degree from an accredited institution is highly desired. An undergraduate technical degree or an advanced degree in either a technical or management field is highly desired. Veterans' Preference: Veterans' preference is not applicable to the SES. Relocation Authorized: Payment of Permanent Change of Station (PCS) costs is authorized in accordance with the Joint Travel Regulations (JTR). Recruitment/Relocation Incentive: May be offered. Direct Deposit: All federal employees are required to have direct deposit. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities please click here. Subsequently, FTR Bulletin 20-04 issued by GSA, provides further information regarding NDAA FY2020, Public Law 116-92, and the expansion of eligibility beyond \"transferred\" for WTA/RITA allowances. For additional information, please click here. If you have questions regarding this announcement and have hearing or speech difficulties click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"virginia.reynolds@us.af.mil","AgencyContactPhone":"703-695-7677","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"648597100","MatchedObjectDescriptor":{"PositionID":"DA-22-JLA-11461025","PositionTitle":"Deputy Program Executive Officer, Missile and Space","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/648597100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/648597100?PostingChannelID="],"PositionLocationDisplay":"Redstone Arsenal, Alabama","PositionLocation":[{"LocationName":"Redstone Arsenal, Alabama","CountryCode":"United States","CountrySubDivisionCode":"Alabama","CityName":"Redstone Arsenal, Alabama","Longitude":-86.6526,"Latitude":34.6299}],"OrganizationName":"U.S. Army Acquisition Support Center","DepartmentName":"Department of the Army","SubAgency":"Program Executive Office, Missiles & Space","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Eligibility will be based upon a clear showing the applicant has training, education and experience of the scope and quality sufficient to effectively carry-out the duties of the position. Candidates must exemplify the corporate perspective, leadership vision, broad experience and character needed in the SES corps not only to satisfy the immediate vacancy, but future vacancies which will occur in a variety of organizations, functions and locations. In addition, DoD requires an Enterprise Perspective. The individual must possess a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives should demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required--this information should be embedded within the application package (Resume and Technical Qualifications). To meet minimum qualification requirements for this position, you must show in your resume that you possess the five Executive Core Qualifications (ECQs) defined below: 1) Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment.2) Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent in this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution ofconflicts.3) Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent in the ECQ is the ability to make decisions that produce high- quality results by applying technical knowledge, analyzing problems, and calculating risks.4) Business Acumen:\nThis core qualification involves the ability to manage human, financial, and information resources strategically.5) Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, state and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. *** TECHNICAL QUALIFICATION(S) (TQ): (MANDATORY SUBMISSION) A supplemental statement must be submitted separately addressing each TQ. TQ must provide specific examples that address relevant experience and accomplishments. Total TQ write-up may not exceed 1 pages per TQ using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: TQ 1: Knowledge of, and experience in, the management of a large, complex, and diverse organization requiring executive level leadership skills. TQ 2: Knowledge and experience in applying innovative approaches to rapid acquisition processes to include services and/or products in accordance with current acquisition regulations and policies. Please Note: Current career SES members, former career SES members with reinstatement eligibility, and SES Candidate Development Program (DCP), who have been certified by OPM must load your SF-50 or certificate (under other). ADDITIONAL REQUIREMENTS: THIS IS A SENIOR EXECUTIVE SERVICE (SES) LEVEL CRITICAL ACQUISITION POSITION. By statute, 10 United States Code (U.S.C.) Section 1733, specific Acquisition positions, GS-14 and above, are designated as Critical Acquisition Positions (CAPs}. All CAPs must be filled by individuals in or otherwise qualified for membership in the Acquisition Corps (10 U.S.C. Section 1733).Army Acquisition and Technology Workforce applicants must have an Acquisition Career Record Brief (ACRB) on file. A selectee without Acquisition Corps membership is required to become a member of the Army Acquisition Corps prior to appointment to the position.As a SES Level CAP, the following specific statutory and regulatory requirements summarized below must be met in addition to the managerial and technical qualifications specific to this position. There are three components to the assignment qualification standards for Acquisition positions that are CAPs: 1) Army Acquisition Corps (AAC) membership requirements; 2) Tenure Position requirements, and 3) Position Education, Experience and Certification/Training requirements.Note: The failure to satisfy/meet some of these Acquisition requirements below can be waived by the designated agency officials in the appropriate circumstances. In accordance with Title 10 U.S.C. Section 1732, to be a member of or otherwise qualified for membership in the AAC, the individual must:\na. Currently be serving in a position in Grade GS-15 or above (or equivalent military or private sector position).\nb. Have a baccalaureate degree from an accredited institution authorized to grant baccalaureate degrees or have been certified by the appropriate agency official as possessing significant potential for advancement to levels of greater responsibility and authority based on demonstrated analytical and decision-making capabilities, job performance and qualifying experience; education as described in the next section.\nc. At a minimum, possess at least four years of experience in a DoD (or comparable industry or government) position.d. Fulfill other specific requirements imposed by the Secretary of Defense.\ne. Note, exceptions and alternatives to the requirements stated above in paragraphs la-d are as follows:\n(1) An individual who has at least 10 years of experience in acquisition positions (or comparable position in other government agencies or the private sector) on October 1, 1991 is qualified for AAC membership without meeting the education standards cited above.\n(2) An employee who served in an Acquisition Corps position on October 1, 1991, and who does not have 10 years of experience, may meet the management education standard by equivalency examination considered by the Secretary of Defense to demonstrate skills, knowledge, or abilities comparable to that of an individual who has completed at least 24 semester credit hours (or the equivalent) of study from an accredited institution of higher education from among the disciplines listed in paragraph lb(l) above.\n(3) An employee may be exempt from the eligibility requirements in paragraphs la-ld above if the appropriate career program board certifies that he/she possesses significant potential for advancement to levels of greater responsibility and authority, based on demonstrated analytical and decision making capabilities, job performance and qualifying experience.\n4) In accordance with Title 10 U.S.C. Section 1734, Tenure Position Requirements for filling a SES Level Acquisition Position are: CONTINUED IN EDUCATION SECTION","PositionRemuneration":[{"MinimumRange":"135468.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-13T07:43:45.1130","PositionEndDate":"2022-05-03T23:59:59.9970","PublicationStartDate":"2022-04-13T07:43:45.1130","ApplicationCloseDate":"2022-05-03T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"See below.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","SubAgencyName":"Program Executive Office, Missiles & Space","OrganizationCodes":"DD/ARAE","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. This position is in the Senior Executive Service (SES) which is a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. Section 1109 of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2019 provides initial appointments into the Senior Executive Service (SES) within the Department of Defense (DoD) without subject to certification of Executive Core Qualifications (ECQ) by the Office of Personnel Management (OPM), Qualifications Review Board (QRB). Career SES appointments made under this authority does not guarantee you may be eligible to noncompetitively transfer to another career SES appointment outside of the DoD. Other Federal agencies may require submission of ECQs to OPM's QRB prior to appointment in that agency. The Department of the Army is an Equal Opportunity Employer.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Deputy Program Executive Officer Missiles and Space coordinates, integrates, leads and directly controls through subordinate project managers, the accomplishment of all life cycle program phases including research and development, procurement, production and related engineering support, integration, product assurance, test and evaluation, product improvement, sustainment, demilitarization, and international aspects for assigned systems. Provides guidance and direction on the project management concepts applicable to assigned Missiles and Space programs. Issues directives and instructions to all functional or support elements engaged in the execution of actions and services and laces requirements on these elements for completing assigned tasks. Evaluates assigned programs in terms of manpower resource requirements and capabilities. Serves as a policy and decision making entity on matters arising within the Army complex regarding assigned systems. Exercised personnel management and affirmative action responsibilities and supervisory responsibilities. Directly manages an annual budget of $3B and substantially influences a budget of more than $40B."],"Education":"Any person assigned to a CAP shall remain in that position for not less than three years. An employee may not be assigned or selected to fill a CAP unless the person executes a written agreement to remain in Federal service in that position for at least three years. The service obligation contained in such a written agreement shall remain in effect unless and until waived by the Secretary under the appropriate circumstances.5) In accordance with Title 10 U.S.C. Section 1723 and 1734 (b)(4) and DoD statutory requirements (DoD 5000.52). At a minimum, the selectee for this position must have Level Ill certification or training in PROGRAM MANGEMENT Acquisition Career Field at the time of selection, OR within 24 months, the selectee must become Level Ill certified in PROGRAM MANAGEMENT Acquisition Career Field. 6) Limitation. --Any member of the AAC who does not meet the education, training, and experience requirements for a critical acquisition position may not carry out the duties or exercise the authorities of that position, except for a period not to exceed six months, unless a waiver of the requirements is granted by appropriate authority. In addition to series related education requirements you must also have:\n(1) Have completed at least 24 semester credit hours (or equivalent) of study, from an accredited institution of higher education from among the disciplines of accounting, business finance, law, purchasing, economics, industrial management, marketing, qualitative methods, and organization and management,\nOR\n(2) Have completed at least 24 semester credit hours (or equivalent) from an accredited institution of higher education in his/her career field along with 12 semester hours (or equivalent) in the listed disciplines. Education Requirements to be certified in the AAC are listed in the qualifications section of this announcement. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"CONDITIONS OF EMPLOYMENT:\nYou must be a U.S. citizen to be eligible for this position.\nYou must be able to submit and pass designated and/or Random Drug Testing as required.\nYou must be able to obtain/maintain the appropriate clearance and access level for this position.\nThis is a Critical Acquisition Position and may only be filled by individuals qualified for membership in the AAC.\nMobility is a condition of membership in the AAC. You must sign a mobility agreement.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/. Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. Appointment is subject to the completion of a favorable suitability or fitness determination, as determined by a background investigation. Direct deposit of pay is required. This position requires you to submit a Public Financial Disclosure Report (OGE 278) upon entry, and annually thereafter. The incumbent is required to travel on both scheduled and unscheduled aircraft, and other modes as required, under conditions specified under the DoD Joint Travel Regulations. The incumbent is expected to travel on short notice to attend high level meetings to obtain resolution of problems and gather information to assist in the decision making process. Mobility: An essential element of the SES is mobility across geographic, organizational and functional lines. Individuals selected for Army SES positions may be subject to reassignment that requires them to be mobile. The U.S. Army senior leadership considers mobility to be an integral part of employment as an SES member with the Department of the Army.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments and experience. Your resume will be evaluated by an SES rating and ranking panel, and afterwards, highly qualified candidates will undergo the Structured Interview process. The Executive Resources Board (ERB) will review results and make recommendations on final selections to the appointing authority where final interviews and reference checks may occur.","HowToApply":"*** You MUST apply online. Applying online will allow you to review and track the status of your application.*** To receive consideration, applicants must submit application material as specified below. Complete applications must be received in this office by 11:59 p.m. Eastern Time (ET) 05/03/2022. Incomplete applications will not be considered. Do not submit additional items such as copies of additional performance appraisals, position descriptions, etc. Such items may be removed and will not be returned. Also application material cannot be returned. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the View Occupational Questionnaire Click the Submit My Answers button to submit your application package. It is your responsibility to ensure your responses and appropriate documentation is submitted prior to 11:59 p.m. Eastern Time (ET) . To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the more information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. Applicants who fail to submit all information and documents (i.e. Resume, TQs, SF50 if applicable, and Performance Appraisal/Letter of Recommendation, Occupational Questionnaire, and other qualifications as applicable) WILL NOT receive consideration for the position. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. You must upload your TQs (under other) and any Official Transcripts. If you have an SF50, please submit that as well. Your performance assessment or a Letter of Recommendation will need to be uploaded (under other). All Required documents such as your Acquisition Certification Documents must be uploaded or your application will be considered incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. ************************************************************\nBackground Survey Questionnaire, (OPTIONAL SUBMISSION): Form (O.M.B. No. 3046-0046) located: http://www.archives.gov/careers/jobs/forms/omb-3046-0046.pdf The information from this survey is used to help insure that agency personnel practices meet the requirements of Federal law. This information is provided pursuant to Public Law 93-579 (Privacy Act of 1974), December 31, 1974, for individuals completing Federal records and forms that solicit personal information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application..","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. We will evaluate each applicant who meets the basic qualifications based on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct a suitability and/or security background investigation. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement. If you are determined to be ineligible or not qualified, or your application is incomplete, your application will receive no further consideration. Pay is set based on consideration of selectee's current salary and other factors. Once you enter on duty, you will be required to complete a Confidential Financial Disclosure Report (OGE 278e) within 30 days of entering this position. Please notify your servicing ethics counselor (part of the legal office) as soon as possible after starting your SES duties so the ethics counselor can assign you a new entrant report in the online Integrity system, (https://integrity.gov/efeds-login/).","RequiredDocuments":"To apply for this position, you must provide a complete Application Package which includes:\n1. Your Resume (MANDATORY SUBMISSION, NO MORE THAN 5 PAGES): Submit a resume or any other written format you choose to describe your qualifications. Your resume must show that you possess the five Executive Core Qualifications (ECQs) defined below: 1) Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. 2) Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent in this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. 3) Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent in the ECQ is the ability to make decisions that produce high- quality results by applying technical knowledge, analyzing problems, and calculating risks. 4) Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. 5) Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, state and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. It also must contain:: Vacancy Announcement number Full name, email, mailing address, day and evening telephone numbers. Educational information including the name, city, and state of colleges/universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www2.ed.gov/admins/finaid/accred/index.html Information about paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. Information about honors, awards, and special accomplishments. In lieu of the embedding ECQs within your resume, current career SES members, reinstatement eligible, and SES Candidate Development Program graduates must provide the documentation listed in item #4. 2. Technical Qualification (MANDATORY SUBMISSION): A separate narrative statement specifically addressing the mandatory technical qualification. This separate statement may not exceed one page (per TQ) using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: TQ 1: Knowledge of, and experience in, the management of a large, complex, and diverse organization requiring executive level leadership skills. TQ 2: Knowledge and experience in applying innovative approaches to rapid acquisition processes to include services and/or products in accordance with current acquisition regulations and policies. 3. Performance Assessment. (MANDATORY SUBMISSION): Submit ONE of the following: A signed letter of recommendation dated within the last three years that assesses your performance; *or* your most recent signed performance appraisal. (Please do not submit any prior appraisals.) 4. Current or former employees MUST provide an SF-50 showing their status or reinstatement eligibility. SES Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification (under other). 5. Documentation to support AAC membership. (Under Other) As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"***Section 1109 of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2019 provides initial appointments into the Senior Executive Service (SES) within the Department of Defense (DoD) without subject to certification of Executive Core Qualifications (ECQ) by the Office of Personnel Management (OPM), Qualifications Review Board (QRB). Career SES appointments made under this authority does not guarantee you may be eligible to noncompetitively transfer to another career SES appointment outside of the DoD. Other Federal agencies may require submission of ECQs to OPM's QRB prior to appointment in that agency. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Veteran's Preference: By law Veteran's Preference does not apply to the Senior Executive Service. False Statements: If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or you may be subject to fine, imprisonment, or other disciplinary action. Non Discrimination: All applicants will be considered without regard to race, color, religion, national origin, marital status, political affiliation, age, sex, sexual orientation, disabling condition, membership in an employee organization, or any other non-merit factors. Adverse Information Screening: Applicants proposed for selection are subject to inquiries as to any incidences of misconduct, malfeasance, neglect of duty, or the appearance thereof. Information gained in this check will be considered in the approval decision. E-verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" system. Federal Law requires DHS to use the E-Verify system to verify the employment eligibility of all new hires, and obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system as a condition of continued employment. The U.S. Department of Army is an E-Verify Participant.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"JESSICA.L.ARMSTRONG.CIV@ARMY.MIL","AgencyContactPhone":"703-692-3317","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"648688800","MatchedObjectDescriptor":{"PositionID":"DA-2022-CC-11461085","PositionTitle":"Chief Interagency and International Community of Practice","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/648688800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/648688800?PostingChannelID="],"PositionLocationDisplay":"Washington, District of Columbia","PositionLocation":[{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904}],"OrganizationName":"U.S. Army Corps of Engineers","DepartmentName":"Department of the Army","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"**To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), Technical Qualification(s), and other qualifications, if applicable (such as Education - see below). Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp. (1) Executive Core Qualifications (MANDATORY SUBMISSION) (ECQs) All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. Use the Challenge-Context-Action-Result (CCAR) Model to describe your accomplishments. You must address each ECQ separately. You are required to respond to all ECQs. Failure to do so, will result in an 'ineligible' rating. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Please Note: Current career SES members, former career SES members with reinstatement eligibility, and SES Candidate Development Program (DCP), who have been certified by the OPM do not need to address ECQs, However when applying you must load your certificate under the Executive Core Qualifications. ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. (2) TECHNICAL QUALIFICATION(S) (TQ): (MANDATORY SUBMISSION) A supplemental statement must be submitted separately addressing each TQ. Your TQ must provide specific examples that address relevant experience and accomplishments. Total TQ write-up should not exceed 2 pages per TQ using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: TQ: Demonstrated ability to plan and direct strategy, formulate policy, and implement interagency and international programs employing scientific, engineering, and technical capabilities in a large, geographically dispersed, multi-level organization.","PositionRemuneration":[{"MinimumRange":"135468.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-14T00:00:00.0000","PositionEndDate":"2022-05-05T23:59:59.9970","PublicationStartDate":"2022-04-14T00:00:00.0000","ApplicationCloseDate":"2022-05-05T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"See below","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/ARCE","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. This position is in the Senior Executive Service (SES) which is a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. The Department of the Army is an Equal Opportunity Employer.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Chief, Interagency and International Community of Practice works with the Commander, U.S. Army Corps of Engineers; the Assistant Secretary of the Army (Civil Works); the Deputy Under Secretary of the Army (International Affairs); and the Department of Defense (Office of the Secretary of Defense, Joint Chiefs of Staffs, Commander in Chiefs of the Military), this position is responsible for developing and managing USACE corporate IIS strategic business initiatives. The position provides programmatic direction and assistance to all USACE headquarters offices, divisions, districts, laboratories, and other field offices to ensure timely and proper development and maintenance of HQUSACE IIS strategic planning and all supporting MSC plans. These plans must be integrated to ensure alignment of workload and workforce with USACE strategic planning. As Chief of the Interagency and International Services Community, the incumbent is the focal point for corporate IIS strategic planning for USACE and for program- level relationships with external stakeholders. In addition to developing USACE' s strategic alliance profile, this individual is responsible for reimbursable support activities for non-DOD entities and international activities including in direct support of US forces; evaluating nationally significant reimbursable work; and providing non-reimbursable, nationally significant support to US agencies and international organizations. The range of technical expertise provided under this program spans all USACE competencies and skills including engineering, environmental, construction management, real estate, research and development, and related services. Formulates plans and strategies for USACE support to the National Security and National Military Strategies. Develops strategies for cooperation with developed nations and support for developing nations and emerging democracies."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"CONDITIONS OF EMPLOYMENT:\nYou must be a U.S. citizen to be eligible for this position.\nYou must be able to submit and pass designated and/or Random Drug Testing as required.\nYou must sign a mobility agreement.\nYou must be able to obtain/maintain the appropriate clearance and access level for this position.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/\nMale applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. Appointment is subject to the completion of a favorable suitability or fitness determination, as determined by a background investigation. Direct deposit of pay is required. This position requires you to submit a Public Financial Disclosure Report (OGE 278) upon entry, and annually thereafter. The incumbent is required to travel on both scheduled and unscheduled aircraft, and other modes as required, under conditions specified under the DoD Joint Travel Regulations. The incumbent is expected to travel on short notice to attend high level meetings to obtain resolution of problems and gather information to assist in the decision making process. Mobility: An essential element of the SES is mobility across geographic, organizational and functional lines. Individuals selected for Army SES positions may be subject to reassignment that requires them to be mobile. The U.S. Army senior leadership considers mobility to be an integral part of employment as an SES member with the Department of the Army.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments and experience.\nYour resume will be evaluated by an SES rating and ranking panel, and afterwards, highly qualified candidates will undergo the Structured Interview process.\nThe Executive Resources Board (ERB) will review results and make recommendations on final selections to the appointing authority where final interviews and reference checks may occur.","HowToApply":"*** You MUST apply online. Applying online will allow you to review and track the status of your application.*** To receive consideration, applicants must submit application material as specified below. Complete applications must be received in this office by 11:59 p.m. Eastern Time (ET) 05/05/2022. Incomplete applications will not be considered. Do not submit additional items such as copies of additional performance appraisals, position descriptions, etc. Such items may be removed and will not be returned. Also application material cannot be returned. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the View Occupational Questionnaire Click the Submit My Answers button to submit your application package. It is your responsibility to ensure your responses and appropriate documentation is submitted prior to 11:59 p.m. Eastern Time (ET) . To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the more information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. Applicants who fail to submit all information and documents (i.e. Resume, ECQs, TQs, SF50 if applicable, and Performance Appraisal/Letter of Recommendation, Occupational Questionnaire, and other qualifications as applicable) WILL NOT receive consideration for the position. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. You must upload your ECQs, TQs and any Official Transcripts when required. If you have an SF50, please submit that as well. Your performance assessment or a Letter of Recommendation IS mandatory. Upload either document under Performance Appraisal. All Required documents must be uploaded or your application will be considered incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. ************************************************************\nBackground Survey Questionnaire, (OPTIONAL SUBMISSION): Form (O.M.B. No. 3046-0046) located: http://www.archives.gov/careers/jobs/forms/omb-3046-0046.pdf The information from this survey is used to help insure that agency personnel practices meet the requirements of Federal law. This information is provided pursuant to Public Law 93-579 (Privacy Act of 1974), December 31, 1974, for individuals completing Federal records and forms that solicit personal information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application..","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. We will evaluate each applicant who meets the basic qualifications based on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct a suitability and/or security background investigation. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement. If you are determined to be ineligible or not qualified, or your application is incomplete, your application will receive no further consideration. Pay is set based on consideration of selectee's current salary and other factors. Once you enter on duty, you will be required to complete a Confidential Financial Disclosure Report (OGE 278e) within 30 days of entering this position. Please notify your servicing ethics counselor (part of the legal office) as soon as possible after starting your SES duties so the ethics counselor can assign you a new entrant report in the online Integrity system, (https://integrity.gov/efeds-login/).","RequiredDocuments":"To apply for this position, you must provide a complete Application Package which includes:\n1. Your Resume (MANDATORY SUBMISSION): Submit a resume or any other written format you choose to describe your qualifications. Your resume must contain: Vacancy Announcement number Full name, email, mailing address, day and evening telephone numbers. Educational information including the name, city, and state of colleges/universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www2.ed.gov/admins/finaid/accred/index.html Information about paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. Information about honors, awards, and special accomplishments. 2. Executive Core Qualifications (MANDATORY SUBMISSION): A narrative statement specifically addressing each individual ECQ using the Challenge-Context-Action-Result Model.\nEach accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp In lieu of the narrative statement, current career SES members, reinstatement eligible, and SES Candidate Development Program graduates must provide the documentation listed in item #5 - you must load your certificate under the Executive Core Qualifications.\n.\n3. Technical Qualification (MANDATORY SUBMISSION): A separate narrative statement specifically addressing the mandatory technical qualification. This separate statement should not exceed two pages (per MTQ) using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: TQ: Demonstrated ability to plan and direct strategy, formulate policy, and implement interagency and international programs employing scientific, engineering, and technical capabilities in a large, geographically dispersed, multi-level organization. 4. Performance Assessment. (MANDATORY SUBMISSION): Submit ONE of the following: A signed letter of recommendation dated within the last three years that assesses your performance; *or* your most recent signed performance appraisal. (Please do not submit any prior appraisals.) 5. Current or former employees MUST provide an SF-50 showing their status or reinstatement eligibility. SES Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Veteran's Preference: By law Veteran's Preference does not apply to the Senior Executive Service. False Statements: If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or you may be subject to fine, imprisonment, or other disciplinary action. Non Discrimination: All applicants will be considered without regard to race, color, religion, national origin, marital status, political affiliation, age, sex, sexual orientation, disabling condition, membership in an employee organization, or any other non-merit factors. Adverse Information Screening: Applicants proposed for selection are subject to inquiries as to any incidences of misconduct, malfeasance, neglect of duty, or the appearance thereof. Information gained in this check will be considered in the approval decision. E-verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" system. Federal Law requires DHS to use the E-Verify system to verify the employment eligibility of all new hires, and obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system as a condition of continued employment. The U.S. Department of Army is an E-Verify Participant.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"CHONGKIN.CHIN.CIV@ARMY.MIL","AgencyContactPhone":"7036926313","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"648928400","MatchedObjectDescriptor":{"PositionID":"CFO-120963-01-SEMO","PositionTitle":"SENIOR ACQUISITION EXECUTIVE","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/648928400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/648928400?PostingChannelID="],"PositionLocationDisplay":"Washington, District of Columbia","PositionLocation":[{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904}],"OrganizationName":"Defense Intelligence Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Contracting","Code":"1102"}],"JobGrade":[{"Code":"EP"}],"PositionSchedule":[{"Name":"Full Time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"If you are viewing this announcement via USAJobs, please visit www.DIA.MIL to view this announcement and specific qualification requirements. Executive Core Qualification factors Intelligence Community Senior Officer Core Qualification factors Technical Qualification factors","PositionRemuneration":[{"MinimumRange":"135500.0","MaximumRange":"196000.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-13T00:00:00.0000","PositionEndDate":"2022-05-12T23:59:59.9970","PublicationStartDate":"2022-04-13T00:00:00.0000","ApplicationCloseDate":"2022-05-12T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"We are committed to: Teamwork: Partnering at all levels and across organizational boundaries for mission accomplishment. Integrity: Adherence to the highest legal and ethical principles in our responsibilities. Excellence: Unrivaled defense intelligence expertise. Service: Putting the welfare of the Nation and commitment to our mission before oneself.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"0","OrganizationCodes":"DD/DD05","Relocation":"False","HiringPath":["public","vet","ses","nguard"],"AgencyMarketingStatement":"","TravelCode":"-1","MajorDuties":["DIA employs a variety of professionals who serve throughout the workforce to ensure successful operations. To view this positions duties, click Vacancies to be directed to DIAs online application system. Please make note of the position title and 6-digit Job Opening ID number to which you are interested. You can scroll to the bottom of the page to locate the announcement or click on the Advanced Search link and enter in the 6-digit Job Opening ID number in the Job Opening ID field."],"Education":"","Requirements":"All applicants must be U.S. citizens and are subject to a thorough background inquiry.","Evaluations":"All applicants must submit a resume and responses to the technical qualifications and managerial qualifications per the application instruction provided. Applications received which do not include the above information will not be considered. Applications received after the close out date will not be considered.","HowToApply":"DO NOT APPLY FOR THIS JOB ON-LINE.If you are viewing this announcement via USA Jobs, please visit www.dia.mil/careers to view thisannouncement and specific qualification requirements.Follow the instructions, below.All applicants are required to submit a rsum. Format is at your discretion, but must include: fullname, address, and telephone numbers and/or email address where you can be reached. In addition toproviding a current rsum, all applicants must prepare and submit a Supplemental NarrativeStatement describing in sufficient detail the experience, education, and accomplishments that haveprovided them the skills and knowledge required in the IC SOCQs, and technical qualification areasabove.Incomplete application packages will not be considered. Applications will be no longer than 25 pagesto include the resume.We provide reasonable accommodations to applicants with disabilities, where appropriate. If you needa reasonable accommodation for any part of the application or hiring process, please notify us atthe address below. The decision on granting an accommodation will be on a case-by-case basis.HOW TO SUBMIT YOUR APPLICATIONRsum and Supplemental Narrative Statement, and any attachments, should be in MS Word, AdobeAcrobat or similar file formats.We recommend you submit your application via e-mail to avoid possible mail delays. Submit unclassified applications to diasemovacancies@dodiis.mil and Angela.Miller@dodiis.mil.DIA Interagency Distribution - DIA employees may send applications via interagency distribution tothe Senior Executive Management Office, SEMO, (Ms. Miller), DIAC.If none of the above methods are available, you may mail your application to:Defense Intelligence AgencySenior Executive Management Office (Attn: SEMO, DIAC, Ms. Miller)Building 6000 Joint Base Anacostia-Bolling, Washington, D.C. 20340-5100.NOTE: Use of postage paid Government agency envelopes to file job applications is a violation ofFederal law and regulation. Applications received in government franked envelopes will not beconsidered. Please send only one application by one of the methods above. Applications and anysupporting materials you submit will not be returned.REGARDLESS OF WHICH TRANSMISSION METHOD YOU USE, YOUR APPLICATION MUST BE RECEIVED IN THE SENIOR EXECUTIVE MANAGEMENT OFFICE BY CLOSE OF BUS","WhatToExpectNext":"We will notify you when your application has been received. You will also be notified if DIA is, or is not, interested in you as a potential employee of our agency.","RequiredDocuments":"Supplementary Narrative Statement Current non-DIA Federal Civilian Employees must submit a copy of your last SF-50, Notification of Personnel Action.","Benefits":"Please visit our web site, www.dia.mil. Under the \"Careers\" heading on our web site, you will find a listing of benefits available to DIA employees.","BenefitsUrl":"http://www.dia.mil/careers/benefits","OtherInformation":"AuthorityThis position is a Defense Intelligence Senior Executive Service (DISES) position. DIA has the authority to establish and staff these positions through PL 104-201. Privacy Act Statement:The National Security Act of 1947, as amended, (50 U.S.C. 401 et seq.) 10 U.S.C. 113, 5 U.S.C. 301, 44 U.S.C. 3102, and E.O. 9397 (SSN), authorizes collection of the requested information. The information is collected to evaluate individuals for specific employment opportunities. In addition to those disclosures generally permitted under 5 U.S.C. 552a(b) of the Privacy Act, these records or information contained therein may specifically be disclosed outside the Department of Defense as a routine use pursuant to 5 U.S.C. 552a(b)(3) as follows:The DoD 'Blanket Routine Uses' set forth at the beginning of the Defense Intelligence Agency's compilation of systems of records notices apply to this system.Information is requested on a voluntary basis, failure to provide information may delay the employment process.Citizenship, Background Investigations and Pre-Employment Screening/Agreement All DISES candidates must be U.S. citizens able to obtain a Top Secret clearance and are subject to a thorough background inquiry. Information obtained during this inquiry will be considered in the selection decision. Selectees for DISES positions are also subject to mandatory testing for illegal drug use prior to appointment, and may be subject to polygraph examinations. DISES employees will sign an agreement not to disclose, in any fashion, classified information to unauthorized persons. Probationary PeriodApplicants selected for this position must successfully complete a one-year probationary period in conjunction with the appointment at the DISES level. (Applicants selected from outside DIA are also subject to the completion of an additional one-year probationary period [two years total] associated with their initial appointment to the Agency.) Mobility and DeploymentOrganizational, functional and geographical mobility is highly desirable for senior civilians. It can add breadth and depth to the members experience along with greater challenges and responsibilities. All DIA employees are subject to world-wide deployment to crisis situations and may be required to serve anywhere in the world. Direct Deposit Applicants selected for this position must enroll in the DoD Direct Deposit/Electronic Transfer of Pay Program. Required DisclosureThis position is covered under the Ethics in Government Act of 1978 (P.L. 95-521). Incumbents of this position will be required to file an Executive Branch Public Financial Disclosure Report (SF-278) with the DIA Office of General Counsel.Merit Selection Principles and Non-DiscriminationDIA will consider all DISES candidates without regard to race, color, creed, religion, gender, national origin, age, marital status, sexual orientation, political affiliation, physical or mental disability or any other non-merit factors. Selection will be based solely upon merit and qualifications. Veterans preference does not apply to DISES. The filling of DISES positions is not subject to automatic assignment registration programs such as the DoD Priority Placement Program.","KeyRequirements":["- U.S. Citizenship   - Drug Test   - Security Investigation"],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactPhone":"301-619-3165","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}