{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":8,"SearchResultCountAll":8,"SearchResultItems":[{"MatchedObjectId":"613687400","MatchedObjectDescriptor":{"PositionID":"DE-11227500-21-SRM","PositionTitle":"AUDIT PROGRAM MANAGER","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/613687400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/613687400?PostingChannelID="],"PositionLocationDisplay":"Arlington, Virginia","PositionLocation":[{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051}],"OrganizationName":"U.S. Marine Corps","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"EE"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"5 Years","Code":"15319"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the Mandatory Technical Qualifications will eliminate you from consideration. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 1 page.) 1. Expert knowledge of and highly skilled at translation of financial and property systems knowledge into actual application. 2. Ability to translate complex general and real property concepts into actionable recommendations for MCICOM implementation. 3. Ability to conduct inventory analysis and validation testing, conduct internal valuation testing on capital assets, review annual wall-to-wall inventory, and complete the initial placed-in-service date review and document the review for assets. 4. Expert knowledge of and experience in coordinating to include audit planning, providing policies and processes to the Independent Public Accountant (IPA), and conducting entrance conferences. 5. Expert knowledge of internal controls during the review of Process Cycle Narratives for business processes to determine the amount of substantive testing samples required. 6. Expert knowledge of and experience in ensuring the testing phase account balances are supported by underlying documentation and analysis. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"144128.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-09-10T00:00:00.0000","PositionEndDate":"2022-02-09T23:59:59.9970","PublicationStartDate":"2021-09-10T00:00:00.0000","ApplicationCloseDate":"2022-02-09T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. You will serve as the Audit Program Manager for Marine Corps Installations Command (MCICOM).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV27","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will provide technical expertise to reinforce MCICOM commitment to apply resources to national defense requirements and coordinate and plan the Marine Corps full financial statement audit.","You will support an aggressive level of effort required as Marine Corps undergoes its 5th Full Financial Statement Audit and focus on key supporting documentation and substantive testing to support financial and non-financial business transactions.","You will act as MCICOM's government lead to plan and monitor efforts and complete remediation for its focus areas within two Directorates and among the Regional Commands.","You will coordinate these audits with special expertise due to their scope and complexity. Audit planning includes providing policies and processes to the Independent Public Accountant (IPA) and conducting entrance conferences.","You will oversee the internal control of the review of Process Cycle Narratives for the Command's business processes to determine the amount of substantive testing samples required.","You will ensure the testing phase account balances are supported by underlying documentation and analysis, to include the testing phases of existence testing and completeness testing."],"Education":"","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: charles.e.andrews@usmc.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers.","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. A separate narrative statement is required. Your narrative statement must address the Mandatory Technical Qualifications (MTQs) listed above. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This flyer has been amended to extend the closing date. This position is not covered by the Department of Defense Priority Placement Program. Term appointments may be extended up at the discretion of management and in accordance with applicable regulations. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdfHighly Qualified appointments may be extended at the discretion of management and in accordance with applicable regulations. Temporary actions taken under this announcement may be terminated at any time before the established not-to-exceed date. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"charles.e.andrews@usmc.mil","AgencyContactPhone":"571-465-6959","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"630736800","MatchedObjectDescriptor":{"PositionID":"SES-DCAA-22-11347086","PositionTitle":"DIRECTOR DEFENSE CONTRACT AUDIT AGENCY","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/630736800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/630736800?PostingChannelID="],"PositionLocationDisplay":"Fort Belvoir, Virginia","PositionLocation":[{"LocationName":"Fort Belvoir, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Belvoir, Virginia","Longitude":-77.136185,"Latitude":38.68809}],"OrganizationName":"Defense Contract Audit Agency","DepartmentName":"Department of Defense","SubAgency":"DCAA-Headquarters","JobCategory":[{"Name":"Auditing","Code":"0511"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"The recruitment application process for this position is RESUME BASED method. There is no requirement to submit a separate narrative statement specifically addressing the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs) with your application. Evidence of five Executive Core Qualifications (ECQs) and the three Mandatory Technical Qualifications (MTQs) MUST be clearly demonstrated in the five (5) page resume. http://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Eligibility for this position will be based on meeting the basic education requirements below and clear and comprehensive indication that the applicant has had experience of the scope and quality sufficient to carry out the duties and assignments of the position. Applicants must meet the basic education requirements and possess the essential skills, knowledge, and abilities listed in the Executive Core Qualifications and Technical Qualifications paragraphs below. Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). EXECUTIVE CORE QUALIFICATIONS: ECQ 1 - LEADING CHANGE: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - LEADING PEOPLE: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - RESULTS DRIVEN: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - BUSINESS ACUMEN: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - BUILDING COALITIONS: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. MANDATORY TECHNICAL QUALIFICATIONS: 1. Demonstrated executive level experience with principles and practices of performance (operations) auditing and familiarity with fiscal (financial and compliance) auditing. 2. Demonstrated extensive knowledge of Federal Government or other private large professional auditing standards, Cost Accounting Standards and cost allocation principles, and principles and practices for conducting highly complex audits and successfully executing strategic direction and priorities for contract audit programs. 3. Demonstrated extensive experience in communicating clearly and effectively both orally and in writing, with strong interpersonal leadership skills and abilities to represent an Agency to all levels of management in Federal Government, industry associations, or Defense contractors with diplomacy and effectiveness; and the ability to manage a large accounting/auditing organization as demonstrated by progressively responsible supervisory/managerial expertise. DoD Joint Enterprise-Wide Experience: In addition, DoD requires the Enterprise Perspective. The applicant must have the ability to apply a broad point of view and an understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within your resume.","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-12T00:00:00.0000","PositionEndDate":"2022-01-26T23:59:59.9970","PublicationStartDate":"2022-01-12T00:00:00.0000","ApplicationCloseDate":"2022-01-26T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Defense Contract Audit Agency (DCAA) performs contract audits for the Department of Defense (DoD) and other Federal agencies; and provides accounting and financial advisory services regarding contracts/subcontracts to all DoD Components responsible for procurement and contract administration. Its work benefits our men and women in uniform and the American taxpayer.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","SubAgencyName":"DCAA-Headquarters","OrganizationCodes":"DD/DD10","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Responsible for all matters related to the management of the Defense Contract Audit Agency and its resources.","Responsible for the planning, development, direction, execution, and evaluation of comprehensive programs designed to implement public law and Secretary of Defense directives in carrying out the contract audit mission assignment to the Agency.","Establishes policies and objectives aimed at improving operating plans and standards and ensures optimum efficiency of support programs such as budget, personnel, accounting, legal, security, inspection, and program review and analysis.","Reviews and decides extremely sensitive cases involving heavy Congressional interest or strong public sentiment which may have an economic impact on particular industries or segments of the economy.","Appears before Congressional committees and subcommittees as required to present or defend the Department of Defense (DoD) contract audit posture or to testify in special inquiries concerning procurement, accounting, and auditing.","Represents the DoD on the Cost Accounting Standards Board and establishes rules impacting all contracts covered under the Standards across the government and industry.","Under the Foreign Assistance Act, enters into formal agreements to provide audit service to foreign governments."],"Education":"Transcripts for Basic Education Requirements:\nDegree: A Bachelor's degree in accounting; or a degree in a related field such as business administration, finance, or public administration that included or was supplemented by 24 semester hours in accounting is required. The 24 hours may include up to 6 hours of credit in business law. (The term \"accounting\" means \"accounting and/or auditing\" in this standard. Similarly, \"accountant\" should be interpreted, generally, as \"accountant and/or auditor.\") Foreign Education: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by the National Association of Credential Evaluation Services at the time of application. National Association of Credential Evaluation Services . Financial Management Certification:\nAs a condition of employment, the selectee must meet the requirements of the DoD Financial Management (FM) Certification Program. The FM Certification Program is a course- and experience-based program consisting of three certification levels. Level 3 certification must be completed within two years of the selectee's employment start date. Also, this position is covered by the Defense Acquisition Workforce Improvement Act (DAWIA) as a critical acquisition position Level III and acquisition position career category, Auditing. Defense Acquisition Workforce Improvement Act (DAWIA):\nThis position is covered by the Defense Acquisition Workforce Improvement Act (DAWIA) as a critical acquisition position Level III and acquisition position career category, Auditing.","Requirements":"Conditions Of Employment: U.S Citizenship Background investigation required. Bachelor's degree in accounting or equivalent with 24 hours in accounting. Designated and/or Random Drug Test required. Security Requirements: Critical Sensitive. Selectee must be able to acquire and maintain a Top Secret clearance. Drug Testing: This is a drug testing designated position. You must pass a drug test before your assignment to this position and you will be subject to random drug testing subsequent to your assignment. Pursuant to the Executive Order on Requiring COVID 19 Vaccination for Federal Employees, new DoD civilian employees will be required to be fully vaccinated against COVID 19 prior to entry on duty, subject to such exceptions as required by law. More details regarding vaccine requirements can be found at https://www.saferfederalworkforce.gov/faq/vaccinations/. Selected candidates will receive further information during the job offer process. Financial Management Certification:\nAs a condition of employment, the selectee must meet the requirements of the DoD Financial Management (FM) Certification Program. The FM Certification Program is a course and experience based program consisting of three certification levels. Level 3 certification must normally be completed within two years of the selectee's employment start date.","Evaluations":"Applicants will be evaluated on the basis of the quality and extent of their accomplishments, experience and education. An Executive Evaluation Panel will evaluate the resume for each candidate to determine the best qualified candidates who will be referred to the selecting official. Unless you have already been certified by the Office of Personnel Management (OPM) Qualifications Review Board (QRB), your ECQs must be certified by the OPM QRB before your appointment can occur.","HowToApply":"You must submit all application documents by the closing date of the vacancy announcement, 01/26/2022 1. A complete application includes transcripts, a resume addressing the Executive Core Qualifications, the Technical Qualification(s), and any other documents listed below under Required Documents. Click \"Apply Online\" to create an account or log in to your existing USAJOBS account.\n1. Follow the prompts to complete the questionnaire and upload required documents.\n2. Please ensure you click the Submit My Answers button to submit your application.\n3. Check application status by logging into your USAJOBS account, clicking Application Status, then More Information for this position. Return to an incomplete application by logging into your USAJOBS account and clicking Update Application in the vacancy announcement. You must reselect your resume and other documents from your USAJOBS account on your application will be incomplete. You are highly encouraged to establish a USAJOBS account and submit your application package online so that you can receive status updates. If you are unable to apply online, view the following link for information regarding Alternate Application. 1. Click the following link to view and print the assessment questionnaire https://apply.usastaffing.gov/ViewQuestionnaire/11347086","WhatToExpectNext":"Once your completed application is received, we will conduct an evaluation of your qualifications. The most highly qualified candidates will be referred to the hiring manager for further consideration and possible interview. Visit our careers page: http://www.dcaa.mil\nLearn more about what it's like to work at Defense Contract Audit Agency, what the agency does, and about the types of careers this agency offers.","RequiredDocuments":"1. Resume: Your resume must address your qualifications for the position and cannot exceed five pages. You do not need to submit a separate statement specifically addressing the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs), but you must show how you possess the five ECQs and MTQs within the resume narrative. You must submit a resume or any other written format you choose to describe your qualifications for this position and pages MUST be numbered. The following information MUST be included: Vacancy ID# (to be assigned) Full name, mailing and active email addresses, day and evening telephone numbers. Educational information, including the name, city and state of colleges or universities you attended, as well as the type of degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education (http://www.ed.gov/admins/finaid/accred/index.html). Information about your paid and nonpaid work experiences related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. You may also include information about honors, awards, and special accomplishments, but do not send certificates, etc. 2. College Transcripts: A copy of your college transcripts must be submitted for this position. Please refer to the Education Section of this announcement. If you are a current 0511, a transcript is not needed; however ALL 0511 series MUST submit a recent copy of the Notification of Personnel Action (SF-50). 3. Copy of the Notification of Personnel Action (SF-50): If you are a current or former SES member, you MUST submit a recent copy of the Notification of Personnel Action (SF-50). Graduates of an approved SES Candidate Development Program MUST include a copy of their OPM certification of eligibility. Applicants who fail to submit ALL information and documents (i.e., Resume, Transcript, etc., as applicable) WILL NOT receive consideration for the position. DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as award certificates, etc. will not be considered.","Benefits":"","BenefitsUrl":"https://www.usa.gov/benefits-for-federal-employees","BenefitsDisplayDefaultText":false,"OtherInformation":"Financial Disclosure: Incumbent is required to file a financial disclosure statement when appointed and annual reports thereafter, in accordance with Title 5, code of Federal Regulations, Section 2634.202(c). What to Expect Next: Once your completed application is received, we will conduct an evaluation of your qualifications. The most highly qualified candidates will be referred to the hiring manager for further consideration and possible interview. Benefits: For benefits information, please see employment and Benefits at: https://help.usajobs.gov/index.php/Pay_and_Benefits. 1. This is a Tier 3 Senior Executive Service (SES) position. The salaries for positions found in the Tier 3 structure range from $163,333 to $203,700.\n2. You will be required to serve a two year probationary period unless you have previously completed the probationary period.\n3. You will be paid by direct deposit to a financial organization.\n4. Selectee will be required to file an annual financial disclosure statement, form OGE-278.\n5. Some travel of all modes of transportation within Continental United States is required.\n6. Fair Labor Standards Act: Exempt\n7. Bargaining Unit Position: No\n8. An essential element of the SES is mobility across geographic, organizational, and functional lines. Individuals selected for SES positions may be subject to reassignment, which requires you to be mobile. All new appointed Career SES leaders must sign the Reassignment Rights Obligation Agreement as a condition of employment into the SES.\n9. Security Requirements: Critical Sensitive.\n10. Veterans' preference does not apply to positions in the Senior Executive Service.\n11. Permanent Change of Station Cost: Moving expenses may be authorized.\n12. Drug Testing: This is a drug testing designated position. You must pass a drug test before your assignment to this position and you will be subject to random drug testing subsequent to your assignment. DAWIA Statement: As a condition of employment, the selectee must meet the requirements of the Defense Acquisition Workforce Improvement Act (DAWIA) certification program. The appropriate DAWIA certification must be completed within three years of the selectee's employment start date, except that Key Leadership Positions at the GS-14/15 levels require certification completion prior to assignment.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"susan.hummel@dcaa.mil","AgencyContactPhone":"(571) 448-3487","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"630807200","MatchedObjectDescriptor":{"PositionID":"DA-22-JLA-11347724","PositionTitle":"Executive Director","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/630807200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/630807200?PostingChannelID="],"PositionLocationDisplay":"Fort Hood, Texas","PositionLocation":[{"LocationName":"Fort Hood, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Fort Hood, Texas","Longitude":-97.7092,"Latitude":31.2014}],"OrganizationName":"U.S. Army Test and Evaluation Command","DepartmentName":"Department of the Army","JobCategory":[{"Name":"General Engineering","Code":"0801"},{"Name":"General Physical Science","Code":"1301"},{"Name":"Operations Research","Code":"1515"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"**To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), Technical Qualification(s), and other qualifications, if applicable (such as Education - see below). Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp. 1. Executive Core Qualification (MANDATORY SUBMISSION): All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. Use the Challenge-Context-Action-Result (CCAR) Model to describe your accomplishments. You must address each ECQ separately. You are required to respond to all ECQs. Failure to do so, will result in an 'ineligible' rating. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12 pt, Arial or Times New Roman with 1 inch margins. ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Please Note: Current career SES members, former career SES members with reinstatement eligibility, and SES Candidate Development Program (DCP), who have been certified by the OPM do not need to address ECQs, However when applying you must load your certificate under the Executive Core\nQualifications. (2) Technical Qualification (MANDATORY SUBMISSION): A supplemental statement must be submitted separately addressing each TQ. TQ must provide specific examples that address relevant experience and accomplishments. Total TQ write-up should not exceed 2 pages per TQ using 12 pt. Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: TQ: Professional expertise and broad background in the application of advanced engineering, scientific and operations research theories, principles, practices, and techniques and/or systems analysis as evidenced by academic credentials, experience, and standing among peers in the Test & Evaluation and scientific community. ADDITIONAL REQUIREMENTS: THIS IS A SENIOR EXECUTIVE SERVICE (SES) LEVEL CRITICAL ACQUISITION POSITION. By statute, 10 United States Code (U.S.C.) Section 1733, specific Acquisition positions, GS-14 and above, are designated as Critical Acquisition Positions (CAPs}. All CAPs must be filled by individuals in or otherwise qualified for membership in the Acquisition Corps (10 U.S.C. Section 1733).Army Acquisition and Technology Workforce applicants must have an Acquisition Career Record Brief (ACRB) on file. A selectee without Acquisition Corps membership is required to become a member of the Army Acquisition Corps prior to appointment to the position. As a SES Level CAP, the following specific statutory and regulatory requirements summarized below must be met in addition to the managerial and technical qualifications specific to this position. There are three components to the assignment qualification standards for Acquisition positions that are CAPs: 1) Army Acquisition Corps (AAC) membership requirements; 2) Tenure Position requirements, and 3) Position Education, Experience and Certification/Training requirements\n.Note: The failure to satisfy/meet some of these Acquisition requirements below can be waived by the designated agency officials in the appropriate circumstances. In accordance with Title 10 U.S.C. Section 1732, to be a member of or otherwise qualified for membership in the AAC, the individual must:\na. Currently be serving in a position in Grade GS-15 or above (or equivalent military or private sector position).\nb. Have a baccalaureate degree from an accredited institution authorized to grant baccalaureate degrees or have been certified by the appropriate agency official as possessing significant potential for advancement to levels of greater responsibility and authority based on demonstrated analytical and decision-making capabilities, job performance and qualifying experience; education as described in the next section.\nc. At a minimum, possess at least four years of experience in a DoD (or comparable industry or government) position.\nd. Fulfill other specific requirements imposed by the Secretary of Defense.\ne. Note, exceptions and alternatives to the requirements stated above in paragraphs la-d are as follows:(\n1) An individual who has at least 10 years of experience in acquisition positions (or comparable position in other government agencies or the private sector) on October 1, 1991 is qualified for AAC membership without meeting the education standards cited above.\n(2) An employee who served in an Acquisition Corps position on October 1, 1991, and who does not have 10 years of experience, may meet the management education standard by equivalency examination considered by the Secretary of Defense to demonstrate skills, knowledge, or abilities comparable to that of an individual who has completed at least 24 semester credit hours (or the equivalent) of study from an accredited institution of higher education from among the disciplines listed in paragraph lb(l) above.\n(3) An employee may be exempt from the eligibility requirements in paragraphs la-ld above if the appropriate career program board certifies that he/she possesses significant potential for advancement to levels of greater responsibility and authority, based on demonstrated analytical and decision making capabilities, job performance and qualifying experience.\n4) In accordance with Title 10 U.S.C. Section 1734, Tenure Position Requirements for filling a SES Level Acquisition Position are:\nAny person assigned to a CAP shall remain in that position for not less than three years. An employee may not be assigned or selected to fill a CAP unless the person executes a written agreement to remain in Federal service in that position for at least three years. The service obligation contained in such a written agreement shall remain in effect unless and until waived by the Secretary under the appropriate circumstances.\n5) In accordance with Title 10 U.S.C. Section 1723 and 1734 (b)(4) and DoD statutory requirements (DoD 5000.52).At a minimum, the selectee for this position must have Level Ill certification or training in TEST AND EVALUATION Acquisition Career Field at the time of selection, OR within 24 months, the selectee must become Level Ill certified in TEST AND EVALUATION Acquisition Career Field. CONTINUED IN EDUCATION SECTION","PositionRemuneration":[{"MinimumRange":"135468.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-12T08:26:54.7970","PositionEndDate":"2022-01-25T23:59:59.9970","PublicationStartDate":"2022-01-12T08:26:54.7970","ApplicationCloseDate":"2022-01-25T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"See below.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/ARAT","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. This position is in the Senior Executive Service (SES) which is a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. The Department of the Army is an Equal Opportunity Employer.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Executive Director of Operational Test Command (OTC) independently exercises direction and oversight responsibilities over the command's test and evaluation mission which significantly contributes to the Army and Joint Warfighter's success on current and future battlefields worldwide. Additionally, leads ATEC and Army cross-organizational efforts governing modeling & simulation, threats/targets and range investments. Exercise oversight responsibilities over the conduct of realistic, objective, operational tests and assessments, and experiments on weapons, equipment and doctrine using state-of-the-art technology. Reviews test programs and provides expert advice on test procedures, techniques and instrumentation. Resolves complex problems in diverse engineering and scientific disciplines and makes final decision on controversial technical issues cutting across other Army commands and DoD departments. Success of command mission has a substantial impact on the U.S. and allied national defense efforts and posture. Responsible for a budget of over $105M. Servers under the general supervision of the CG, ATEC, who delegates overall responsibility for the technical control, coordination and management of OTC programs and objectives. Oversees a workforce of over 600 military and civilian members augmented by over 400 contractors, directly supervises personal at the NH-04 level."],"Education":"6) Limitation. --Any member of the AAC who does not meet the education, training, and experience requirements for a critical acquisition position may not carry out the duties or exercise the authorities of that position, except for a period not to exceed six months, unless a waiver of the requirements is granted by appropriate authority. In addition to qualify for the 801 series you must have the following education:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/general-engineering-series-0801/ In addition to qualify for the 1301 series you must have the following education:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualificationstandards/\n1300/general-physical-science-series-1301/ In addition to qualify for the 1515 series you must have the following education:\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualificationstandards/\n1500/operations-research-series-1515/ In addition to series related education requirements you must also have:\n(1) Have completed at least 24 semester credit hours (or equivalent) of study, from an accredited institution of higher education from among the disciplines of accounting, business finance, law, purchasing, economics, industrial management, marketing, qualitative methods, and organization and management,\nOR\n(2) Have completed at least 24 semester credit hours (or equivalent) from an accredited institution of higher education in his/her career field along with 12 semester hours (or equivalent) in the listed disciplines. Education Requirements to be certified in the AAC are listed in the qualifications section of this announcement. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"CONDITIONS OF EMPLOYMENT\nYou must be a U.S. citizen to be eligible for this position.\nYou must be able to submit and pass designated and/or Random Drug Testing as required.\nYou must be able to obtain/maintain the appropriate clearance and access level for this position.\nThis is a Critical Acquisition Position and may only be filled by individuals qualified for membership in the AAC.\nMobility is a condition of membership in the AAC. You must sign a mobility agreement.\nPursuant to EO 14043, all Federal employees, regardless of duty location or work arrangement, must be fully vaccinated for COVID-19 by November 22, 2021, or before entrance on duty if after November 22, subject to exceptions as required by law.\nIf selected, the agency will provide information regarding what documentation is needed and how to request any legally required exceptions from this requirement.\nProof of vaccination will be required. To ensure compliance with this mandate, review the vaccination requirements, to include timelines for receiving required doses, at the following: https://www.saferfederalworkforce.gov/faq/vaccinations/ Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year probationary period may be required. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. Appointment is subject to the completion of a favorable suitability or fitness determination, as determined by a background investigation. Direct deposit of pay is required. This position requires you to submit a Public Financial Disclosure Report (OGE 278) upon entry, and annually thereafter. The incumbent is required to travel on both scheduled and unscheduled aircraft, and other modes as required, under conditions specified under the DoD Joint Travel Regulations. The incumbent is expected to travel on short notice to attend high level meetings to obtain resolution of problems and gather information to assist in the decision making process. Mobility: An essential element of the SES is mobility across geographic, organizational and functional lines. Individuals selected for Army SES positions may be subject to reassignment that requires them to be mobile. The U.S. Army senior leadership considers mobility to be an integral part of employment as an SES member with the Department of the Army.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments and experience.\nYour resume will be evaluated by an SES rating and ranking panel, and afterwards, highly qualified candidates will undergo the Structured Interview process. The Executive Resources Board (ERB) will review results and make recommendations on final selections to the appointing authority where final interviews and reference checks may occur.","HowToApply":"*** You MUST apply online. Applying online will allow you to review and track the status of your application.*** To receive consideration, applicants must submit application material as specified below. Complete applications must be received in this office by 11:59 p.m. Eastern Time (ET) 01/25/2022. Incomplete applications will not be considered. Do not submit additional items such as copies of additional performance appraisals, position descriptions, etc. Such items may be removed and will not be returned. Also application material cannot be returned. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the View Occupational Questionnaire. Click the Submit My Answers button to submit your application package. It is your responsibility to ensure your responses and appropriate documentation is submitted prior to 11:59 p.m. Eastern Time (ET) . To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the more information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. Applicants who fail to submit all information and documents (i.e. Resume, ECQs, TQs, Acquisition documentation, SF50 if applicable, and Performance Appraisal/Letter of Recommendation, Occupational Questionnaire, and other qualifications as applicable) WILL NOT receive consideration for the position. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. You must upload your ECQs, TQs and any Official Transcripts. If you have an SF50, please submit that as well. Your performance assessment or a Letter of Recommendation will need to be uploaded (under Performance Appraisal). All Required documents such as your Acquisition Certification Documents must be uploaded or your application will be considered incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. ************************************************************\nBackground Survey Questionnaire, (OPTIONAL SUBMISSION): Form (O.M.B. No. 3046-0046) located: http://www.archives.gov/careers/jobs/forms/omb-3046-0046.pdf The information from this survey is used to help insure that agency personnel practices meet the requirements of Federal law. This information is provided pursuant to Public Law 93-579 (Privacy Act of 1974), December 31, 1974, for individuals completing Federal records and forms that solicit personal information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. We will evaluate each applicant who meets the basic qualifications based on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct a suitability and/or security background investigation. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement. If you are determined to be ineligible or not qualified, or your application is incomplete, your application will receive no further consideration. Pay is set based on selectee's current salary and other factors. Once you enter on duty, you will be required to complete a Confidential Financial Disclosure Report (OGE 278e) within 30 days of entering this position. Please notify your servicing ethics counselor (part of the legal office) as soon as possible after starting your SES duties so the ethics counselor can assign you a new entrant report in the online Integrity system, (https://integrity.gov/efeds-login/).","RequiredDocuments":"1. Resume (MANDATORY SUBMISSION): Submit a resume or any other written format you choose to describe your qualifications. Your resume must contain: Vacancy Announcement number Full name, email, mailing address, day and evening telephone numbers. Educational information including the name, city, and state of colleges/universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www2.ed.gov/admins/finaid/accred/index.html Information about paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. Information about honors, awards, and special accomplishments. 2. Executive Core Qualifications (MANDATORY SUBMISSION): A narrative statement specifically addressing each individual ECQ using the Challenge-Context-Action-Result Model. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp. In lieu of the narrative statement, current career SES members, reinstatement eligible, and SES Candidate Development Program graduates must provide the documentation listed in item #4 - you must load your certificate under the Executive Core Qualifications. 3. Technical Qualification (MANDATORY SUBMISSION): A narrative statement specifically addressing a mandatory technical qualification. TQ must provide specific examples that address relevant experience and accomplishments. Total TQ write-up should not exceed 2 pages using 12 pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following\nTQ: Professional expertise and broad background in the application of advanced engineering, scientific and operations research theories, principles, practices, and techniques and/or systems analysis as evidenced by academic credentials, experience, and standing among peers in the Test & Evaluation and scientific community. 4. Current or former employees MUST provide an SF-50 showing their status or reinstatement eligibility. SES Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. Upload this under the Executive Core Qualification selection. 5. Performance Assessment. (MANDATORY SUBMISSION): Submit ONE of the following: A letter of recommendation within last 3 years that assesses your performance; *or* your most recent signed performance appraisal. (Please do not submit any prior appraisals.) 6. Documentation to support AAC membership. (Under Other) 7. Mandatory Submission: An unofficial copy of your transcripts (undergraduate, graduate, etc.) which includes semester hours and degree received. For more information, you may refer to the following U.S. Department of Education website: http://www2.ed.gov/admins/finaid/accred/index.html As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Veteran's Preference: By law Veteran's Preference does not apply to the Senior Executive Service. False Statements: If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or you may be subject to fine, imprisonment, or other disciplinary action. Non Discrimination: All applicants will be considered without regard to race, color, religion, national origin, marital status, political affiliation, age, sex, sexual orientation, disabling condition, membership in an employee organization, or any other non-merit factors. Adverse Information Screening: Applicants proposed for selection are subject to inquiries as to any incidences of misconduct, malfeasance, neglect of duty, or the appearance thereof. Information gained in this check will be considered in the approval decision. E-verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" system. Federal Law requires DHS to use the E-Verify system to verify the employment eligibility of all new hires, and obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system as a condition of continued employment. The U.S. Department of Army is an E-Verify Participant.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"JESSICA.L.ARMSTRONG.CIV@ARMY.MIL","AgencyContactPhone":"703-692-3317","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"629683000","MatchedObjectDescriptor":{"PositionID":"DCMA-PH-22-11334087-SES","PositionTitle":"Deputy Director, Defense Contract Management Agency","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/629683000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/629683000?PostingChannelID="],"PositionLocationDisplay":"Fort Lee, Virginia","PositionLocation":[{"LocationName":"Fort Lee, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Lee, Virginia","Longitude":-77.33659,"Latitude":37.251705}],"OrganizationName":"Defense Contract Management Agency","DepartmentName":"Department of Defense","SubAgency":"DCMA Headquarters","JobCategory":[{"Name":"General Business And Industry","Code":"1101"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Applicants must possess specialized experience and have developed the knowledge, skills, and abilities required to successfully perform the duties of the position. As a basic requirement for entry into the SES, applicants must provide evidence of progressively responsible leadership experience that is indicative of senior executive level managerial capability, and directly related to the skills and abilities outlined below. Typically, experience of this nature will have been gained at or above the GS-15 grade level in the Federal service, or its equivalent with state or local government, the private sector, or nongovernmental organizations. Candidates must demonstrate the following: A. Executive Core Qualifications (ECQs):\nThe ECQs describe the leadership skills needed to succeed in the Senior Executive Service. The ECQs were designed to assess executive experience and potential and measure whether an individual has the broad executive skills needed in a variety of SES positions. Applicants must submit separate narrative statements to address each of the five ECQs below (maximum length of each statement: 1-2 pages). Each statement must fully describe how their experience demonstrates the specific ECQ. Include two relevant specific examples of actual experience, education, and accomplishments that directly demonstrate competencies for each ECQ. Examples should be clear and concise and emphasize the level of responsibilities and scope and complexity of programs managed. Applicants must use the Challenge-Context-Action-Result (CCAR) model to describe their accomplishments: CHALLENGE: Describe a specific problem or goal. CONTEXT: Describe individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, members of Congress, shrinking budget, low morale). ACTION: Describe the specific actions you took to address a challenge. RESULT: Describe specific examples of measures/outcomes that had impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Additional information on the ECQs is available at www.opm.gov/ses/recruitment/ecq.asp.\n(Exception to ECQ Requirement: Current Career SES members, former Career SES members with reinstatement eligibility, and SES Candidate Development Program graduates who have been certified by OPM do NOT need to submit narrative ECQ statements.) ECQ 1 - LEADING CHANGE: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. (Leadership Competencies: Creativity and Innovation, External Awareness, Flexibility, Resilience, Strategic Thinking, Vision) ECQ 2 - LEADING PEOPLE: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. (Leadership Competencies: Conflict Management, Leveraging Diversity, Developing Others, Team Building) ECQ 3 - RESULTS DRIVEN: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. (Leadership Competencies: Accountability, Customer Service, Decisiveness, Entrepreneurship, Problem Solving, Technical Credibility) ECQ 4 - BUSINESS ACUMEN: This core qualification involves the ability to manage human, financial, and information resources strategically. (Leadership Competencies: Financial Management, Human Capital Management, Technology Management) ECQ 5 - BUILDING COALITIONS: This core qualification involves the ability to build coalitions internally and with other federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. (Leadership Competencies: Partnering, Political Savvy, Influencing/Negotiating) FUNDAMENTAL COMPETENCIES: These competencies are the foundation for success in each of the ECQs: Interpersonal Skills, Oral Communication, Written Communication, Integrity/Honesty, Continual Learning, and Public Service Motivation. DoD Joint Enterprise-Wide Experience Statement: In addition to qualification requirements described above, the DoD requires an Enterprise Perspective. The individual must possess the ability to apply a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within the application package. B. Mandatory Technical Qualifications (MTQ):\nMTQs are essential for successful performance in the position. All applicants must submit separate narrative statements that fully describe how their experience supports each MTQ requirement. The statements should include specific examples of actual experience, education, and accomplishments that directly relate to the MTQ. Examples should be clear and concise, and emphasize the level of responsibilities, scope, and complexity of programs managed, program accomplishments with results of action taken, policy initiatives, and level of contacts. You must address each MTQ separately and you should not exceed 2 pages per MTQ. You are required to respond to all MTQs. If you fail to do so, you will be rated as 'ineligible.' Proven technical and managerial expertise to provide direction, leadership, and policy development for a major Defense acquisition agency, involving superior level of organizational and management skills, mature judgment, and negotiation skills for situations with a high degree of complexity. Mastery of oral and written communications skills required to manage and present complex technical material in terms that can be understood by audiences with various levels of technical expertise. Mastery of contract management and acquisition program management. Demonstrated broad, in-depth knowledge of Federal Acquisition Regulations, Department of Defense regulations, principles, and practices, integral to the successful execution of Defense Acquisition programs and contracts. Demonstrated expertise in developing long-term planning needs, objectives, and priorities for acquisition programs. Demonstrated expertise in representing the Defense organization, or providing liaison to, the principal Office of the Secretary of Defense and service offices involved in establishment of acquisition and contract management policy. Failure to meet any one of the technical qualifications requirements automatically disqualifies an applicant. C. Key Leader Position (KLP) Requirements: Must have 10 years of acquisition experience in an Acquisition Workforce position-- at least 4 years of which was performed while assigned as a Critical Acquisition Position (CAP). Must be a member of the Defense Acquisition Corps upon entry into the position. Must possess level III certification in Contracting or Program Management Career Field. The best-qualified candidates will be distinguished from other applicants by an evaluation panel of senior level subject matter experts and executives referencing the technical and executive core qualifications.","PositionRemuneration":[{"MinimumRange":"149810.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-05T14:45:34.3270","PositionEndDate":"2022-02-02T23:59:59.9970","PublicationStartDate":"2022-01-05T14:45:34.3270","ApplicationCloseDate":"2022-02-02T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position serves as the Deputy Director of the Defense Contract Management Agency (DCMA), working in concert with the Director to provide leadership, oversight and management to a large diverse contract management workforce. This position is in the Senior Executive Service, a small elite group of top government leaders. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","SubAgencyName":"DCMA Headquarters","OrganizationCodes":"DD/DD63","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Join Team DCMA -- Challenge yourself! We are the independent eyes and ears of DoD and its partners, enhancing warfighter lethality by ensuring timely delivery of quality products, and providing relevant acquisition insight supporting affordability and readiness.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Provides executive leadership, oversight, direction, and guidance to DCMA functional staff, senior civilian, and military leaders and authoritative guidance on all related functional, operational, and management activities. In tandem with the Director, leads five Directorates, seven Regional Commands, and 24 Centers, performing a contract management program in 50 Contract Management Field Offices in 900 worldwide geographic locations. These contract management services support the missions of the Army, Navy, Air Force, NASA, Missile Defense Agency, and other customers, and involve highly complex and critical acquisition and special access programs. Extensively involved in DoD contracting and conflict management philosophy and policy development, and is principally concerned with such broad issues as managing the development of major acquisition policy changes and other requirements for major organizational changes throughout DoD. Develops long-term planning needs, forecasts, objectives, and priorities designed to guide the efforts of the extensive DCMA multi-functional contract management workforce. The scope and significance of the DCMA contract management program requires extensive involvement in OSD policy development, legislation formulation, and a continual dialogue at every level with the JCS, CINCs, OSD, NASA, and other Federal agencies and the leadership in the Military Departments. Responsible for the full spectrum of personnel management activities, providing guidance through high-level military and civilian supervisory personnel (SES's, Colonel/O6. and GS-15 levels) to a combined workforce of approximately 11700 professional, military, and civilian personnel. Directly supports USD (Acquisition and Sustainment), Service Secretaries, Directors of Defense Agencies and OSD Office of Cost Assessment and Program Evaluation (CAPE) with forward pricing rate recommendations."],"Education":"In accordance with Section 1732 of Title 10, U.S.C, Defense Acquisition Corp Eligibility Criteria requires a Baccalaureate degree from an accredited educational institution and one of the following: 24 semester credit hours from among the following disciplines: accounting, business, finance, law, contracts, purchasing, economics, industrial management, marketing, quantitative methods, and organization and management. 24 semester credit hours in the person's career field and 12 semester credit hours in the disciplines listed above. Credit hours within the person's career field may also satisfy the requirement for part or all of the 12 credit hours in the disciplines listed above. The same hours may be used to meet both requirements. 24 semester credit hours in the person's career field and training equivalent (American Council on Education recommended credits) to 12 semester credit hours in the disciplines listed above.","Requirements":"","Evaluations":"Your application will be evaluated to determine whether basic qualifications requirements are met, and on the extent to which it shows that you possess the required knowledge, skills, and abilities to successfully perform the duties based on the scope and quality of total accomplishments, experience, and education. Applications of basically qualified candidates will be evaluated by an executive rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the appointing authority. The ECQ statements of the selectee must be certified by the OPM Quality Review Board, unless previously certified.","HowToApply":"The complete application package must be submitted by 11:59 PM (EST) on 02/02/2022 to receive consideration. To begin, click Apply to access an online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your USAJOBS resume and/or other supporting documents. Complete the online application, verify the required documentation, and submit the application. Your application must include your narrative statements addressing all five of the Executive Core Qualifications and each of the Technical Qualification statements. You will receive an email notification when your application has been received for the announcement. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), select the Application Status link and then select the More Information link for this position. The Application Status page will display the status of your application, the documentation received and processed, and your responses submitted to the online application. Your uploaded documents may take several hours to clear the virus scan process.","WhatToExpectNext":"Once your online application is submitted you will receive a confirmation notification by email. Your application will be evaluated to ensure all required documents have been received. All applications that have all required documents will be forwarded to management for panel review and possible interview. All applicants reviewed and/or referred will receive a notification letter.","RequiredDocuments":"1) A current resume (failure to submit will eliminate applicant from further consideration). Include in your resume the following information: Vacancy Announcement Number Full name, mailing and email addresses, day and evening phone numbers Education information (name, city & state of accredited college/university, type of degree and date received from schools accredited by accrediting institutions recognized by the U.S. Department of Education) Information about your paid and unpaid work experiences related to this position (job title, duties and accomplishments, employer's name and address, dates and duration of employment, work schedule and salary) Information about honors, awards, and special accomplishments 2) Mandatory Technical Qualifications (MTQs) Statements (MANDATORY SUBMISSION). A separate narrative statement specifically addressing each MTQ (maximum length of each statement: two pages). Your application should include three separate MTQ statements, totaling no more than six pages. 3) Executive Core Qualifications (ECQs) Statements* (MANDATORY SUBMISSION). A separate narrative statement specifically addressing each individual ECQ, written in the Challenge-Context-Action-Result (CCAR) Model. *NOTE: The ECQ narrative statements are NOT required if the applicant is: (a) current or former Career SES member (These members MUST provide SF50 or DD3434, Notification of Personnel Action, as documentation of SES Appointment) OR (b) graduate of an SES Candidate Development Program (CDP) approved by OPM. DO NOT COMBINE THE MTQ AND ECQ STATEMENTS. Failure to submit mandatory statements will eliminate applicant from further consideration. 4) Performance Appraisal. Applicants who are current or former Federal employees MUST submit a copy of the most recent performance appraisal (or an explanation of why a performance appraisal cannot be provided). Failure to submit will eliminate applicant from further consideration. 5) Copy of the Notification of Personnel Action (SF-50 or DD-3434). Applicants who are current or former Federal employees MUST provide the most recent document that shows their status or reinstatement eligibility and grade and salary. Failure to submit will eliminate applicant from further consideration. 6) Graduates of an approved SES Candidate Development Program MUST provide a copy of their OPM certification of eligibility. Future Military Retirees*: You are required to submit a copy of your retirement DD Form 214 (Member 4 Copy) OR certification document** OR a copy of your retirement letter AND a copy of your terminal leave request (if applicable). You will be required to provide your DD Form 214 (Member 4 Copy) upon issuance.\nNOTE: Within the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326. Future Separation from the Military*: You are required to submit a copy of your most recent DD Form 214 (Member 4 Copy) OR certification document** OR a copy of your most recent active duty orders AND a copy of your terminal leave request (if applicable). You will be required to provide your DD Form 214 (Member 4 Copy) upon issuance. * Active duty military members who are selected may not be appointed unless on terminal leave or already separated from the armed forces. ** The 'certification' is a written document from the armed forces that certifies the service member is expected to be discharged or released from active duty service in the armed forces under honorable conditions not later than 120 days after the date the certification is submitted. The Statement of Service must be signed by, or by direction of, the adjutant, personnel officer, or commander of your unit or higher headquarters, AND the Statement of Service letter must include the branch of service, dates of active duty service, your rank, type of discharge, Character of Service (i.e., honorable), date of expected separation, and, if applicable, when your terminal leave will begin. IMPORTANT: Applicants who fail to submit all required documents WILL NOT receive consideration for this position. Incomplete application submissions, including those received without the required MTQ narrative statements, ECQ narrative statements, SF50, or performance appraisal, will result in an 'Incomplete' rating. It is the applicant's responsibility to submit all required documentation before the closing date of the announcement.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"This position does not meet criteria for appointment of Reemployed Annuitants. The DoD criteria for hiring Reemployed Annuitants can be found at: https://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf Background Investigation: This position is designated special sensitive as defined in DoD 5200.2-R and therefore requires that a personnel security investigation be adjudicated for security eligibility on a pre-appointment basis. This requirement may take 120 days or longer to process. The incumbent must complete a Single Scope Background Investigation (SSBI) and favorable adjudication by a determining authority and be eligible for a Top Secret clearance and access to Sensitive Compartmented Information (SCI). Financial Disclosure: Senior Executives are required to comply with the provisions of the Ethics in Government Act, PL 95-521, which requires the submission of a financial disclosure statement (OGE-278), upon assuming an SES position. This must be submitted annually and upon termination of employment Permanent Change of Station (PCS) expenses will be paid in accordance with the Joint Travel Regulation (JTR). When you perform a civilian PCS with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. Recruitment/Relocation/Retention Incentive may be authorized at Management's discretion. Defense Acquisition Workforce Requirements: Requires Level III certification in the Contracting or Program Management Career Field. A 3-year tenure agreement is required. As required by Executive Order 14043, Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. If selected, you will be required to be vaccinated against COVID-19 and submit documentation of proof of vaccination before appointment or onboarding with the agency. The agency will provide additional information regarding what information or documentation will be needed and how you can request of the agency a legally required exception from this requirement. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you will be required to report to the official duty location and may be expected to temporarily telework. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a specific period of time determined by your supervisory chain. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"melanie.c.driskell3.civ@mail.mil","AgencyContactPhone":"804-609-4062","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"627728300","MatchedObjectDescriptor":{"PositionID":"1174432","PositionTitle":"Contracting Specialist - Entry to Experienced Level (Ft. Meade, MD)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/627728300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/627728300?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Contracting","Code":"1102"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"*The qualifications listed are the minimum acceptable to be considered for the position. Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\nSalary Range: $49,157 - $78,167 (Entry/Developmental) - Entry is with a Bachelor's degree and no experience. A high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $72,750 - $113,362 (Full Performance) - Entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $103,690 - $134,798 (Senior) - Entry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nRelevant experience must be in business management (e.g., acquisition, procurement, finance, contracting, accounting, and logistics). DAWIA Contracting I certification is preferred.","PositionRemuneration":[{"MinimumRange":"49157.0","MaximumRange":"134798.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-17T17:16:29.7600","PositionEndDate":"2022-01-16T23:59:59.9970","PublicationStartDate":"2021-12-17T17:16:29.7600","ApplicationCloseDate":"2022-01-16T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Do you love to negotiate a win-win, desire to impact national security, and enjoy the idea of overseeing multi-million dollar acquisitions? Contracting specialists at NSA acquire commercial goods and services that allow the agency to collect foreign intelligence and protect national security systems. From purchasing comfortable kennels for NSA's working dogs to acquiring computer technology, contracting professionals are the only people authorized to buy goods and services on NSA's behalf.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"13","PromotionPotential":"13","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"The National Security Agency employs a wide variety of business professionals who play a critical role through budgetary and contract activities that support our nation's security every day. We rely on the skills of our acquisition, finance, and accounting professionals to support the internal infrastructure of a federal agency comparable in size and budget to Fortune 100 companies. You formulate and execute budget resources, develop and allocate manpower resources and even provide guidance on implementing policy on cost, finance, and accounting. Start a career where you become a steward of taxpayer dollars, seeking the greatest return that money can provide: a superior intelligence service for the safety and security of our nation.","TravelCode":"-1","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15168","MajorDuties":["We are looking for Contracting Specialists and Contract Managers.\nAs a Contracting Specialist, responsibilities include:\n- Designing acquisition strategies to meet the government's needs through the most appropriate contracting method- Conducting market research- Preparing and issuing Requests for Proposal (RFP) and Requests for Quote (RFQ)- Evaluating proposals from potential contractors/vendors- Negotiating contract terms with selected contractors/vendors- Evaluating procurements to ensure compliance with funding, legal, and program requirements- Preparing and awarding contracts with supporting documentation in accordance with Federal Acquisition Regulations and NSA policy- Administering contracts to include issuing modifications, and monitoring performance, and ensuring payment is issued- Solving complex and unique challenges that arise throughout the life of a contract- If not already completed, training in federal acquisition to become certified in Contracting under the Defense Acquisition Workforce Improvement Act within 24 months of employment\nAs a Contract Manager, responsibilities include:\n- Monitoring contractor performance and ensuring services are delivered in accordance with the contract terms- Meeting frequently with vendors and government technical experts to discuss contract cost, schedule, and performance- Collaborating with technical experts to establish unambiguous contract tasks; validating those tasks are within the contract scope and cost parameters- Leading a team to evaluate contractor proposals and determine which proposal best meets the government's requirements- Presenting status updates on expenditures, delivery timelines, and contractor performance to senior executive leadership- Partnering with contracting, finance, and mission experts to ensure long-term contracts are properly funded and that contract modifications are approved in a timely manner- Forecasting requirements for future contracts- Reviewing contract invoices and collaborate with vendors to resolve any errors or issues- Identifying opportunities to improve contract performance and reduce contract cost- If not already completed, training in federal acquisition to become certified in Contracting and Program Management under the Defense Acquisition Workforce Improvement Act (DAWIA) within 24 months of employment"],"Education":"","Requirements":"We are are looking for someone who:\n- Loves to learn- Is comfortable working in a fast-paced environment- Can juggle multiple priorities and deadlines- Possesses strong communication and interpersonal skills- Enjoys problem-solving and strategic-thinking- Easily juggles multiple priorities and deadlines- Communicates clearly and builds positive working relationships- Practices problem-solving and strategic-thinking- Doesn't mind taking time to get the details right- Enjoys teamwork and collaboration- Curious to learn about unfamiliar topics- Excels at Microsoft Excel","Evaluations":"***PLEASE NOTE: U.S. Citizenship is required for all applicants. Additionally, the Federal Government requires all personnel to be fully vaccinated at the time of employment, subject to exceptions as required by law.\nReasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visithttps://cicad.us/321js9Q .\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"NSA&rsquo;s outstanding benefits provide employees with a better quality of life, both on the job and off, including flexible schedules; generous leave programs; health and life insurance; federal retirement plans; on-site fitness facilities; and personal and family wellness resources.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"N/A","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"630476400","MatchedObjectDescriptor":{"PositionID":"DCMA-P2-11348038-SES","PositionTitle":"Executive Director IT and Chief Information Officer","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/630476400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/630476400?PostingChannelID="],"PositionLocationDisplay":"Multiple Locations","PositionLocation":[{"LocationName":"Carson, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Carson, California","Longitude":-118.262,"Latitude":33.8316},{"LocationName":"Arlington Heights, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Arlington Heights, Illinois","Longitude":-87.99595,"Latitude":42.138016},{"LocationName":"Hanscom AFB, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Hanscom AFB, Massachusetts","Longitude":-71.2763,"Latitude":42.4587},{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051},{"LocationName":"Fort Lee, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Lee, Virginia","Longitude":-77.33659,"Latitude":37.251705}],"OrganizationName":"Defense Contract Management Agency","DepartmentName":"Department of Defense","SubAgency":"DCMA Information Technology Directorate (P2)","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Applicants must possess specialized experience and have developed the knowledge, skills, and abilities required to successfully perform the duties of the position. As a basic requirement for entry into the SES, applicants must provide evidence of progressively responsible leadership experience that is indicative of senior executive level managerial capability, and directly related to the skills and abilities outlined below. Typically, experience of this nature will have been gained at or above the GS-15 grade level in the Federal service, or its equivalent with state or local government, the private sector, or nongovernmental organizations. Candidates must demonstrate the following: A. Executive Core Qualifications (ECQs):\nThe ECQs describe the leadership skills needed to succeed in the Senior Executive Service. The ECQs were designed to assess executive experience and potential and measure whether an individual has the broad executive skills needed in a variety of SES positions. Applicants must submit separate narrative statements to address each of the five ECQs below (maximum length of each statement: 1-2 pages). Each statement must fully describe how their experience demonstrates the specific ECQ. Include two relevant specific examples of actual experience, education, and accomplishments that directly demonstrate competencies for each ECQ. Examples should be clear and concise and emphasize the level of responsibilities and scope and complexity of programs managed. Applicants must use the Challenge-Context-Action-Result (CCAR) model to describe their accomplishments: CHALLENGE: Describe a specific problem or goal. CONTEXT: Describe individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, members of Congress, shrinking budget, low morale). ACTION: Describe the specific actions you took to address a challenge. RESULT: Describe specific examples of measures/outcomes that had impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Additional information on the ECQs is available at www.opm.gov/ses/recruitment/ecq.asp.(Exception to ECQ Requirement: Current Career SES members, former Career SES members with reinstatement eligibility, and SES Candidate Development Program graduates who have been certified by OPM do NOT need to submit narrative ECQ statements.) ECQ 1 - LEADING CHANGE: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. (Leadership Competencies: Creativity and Innovation, External Awareness, Flexibility, Resilience, Strategic Thinking, Vision) ECQ 2 - LEADING PEOPLE: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. (Leadership Competencies: Conflict Management, Leveraging Diversity, Developing Others, Team Building) ECQ 3 - RESULTS DRIVEN: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. (Leadership Competencies: Accountability, Customer Service, Decisiveness, Entrepreneurship, Problem Solving, Technical Credibility) ECQ 4 - BUSINESS ACUMEN: This core qualification involves the ability to manage human, financial, and information resources strategically. (Leadership Competencies: Financial Management, Human Capital Management, Technology Management) ECQ 5 - BUILDING COALITIONS: This core qualification involves the ability to build coalitions internally and with other federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. (Leadership Competencies: Partnering, Political Savvy, Influencing/Negotiating) FUNDAMENTAL COMPETENCIES: These competencies are the foundation for success in each of the ECQs: Interpersonal Skills, Oral Communication, Written Communication, Integrity/Honesty, Continual Learning, and Public Service Motivation. DoD Joint Enterprise-Wide Experience Statement: In addition to qualification requirements described above, the DoD requires an Enterprise Perspective. The individual must possess the ability to apply a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within the application package. B. Mandatory Technical Qualifications (MTQ):\nMTQs are essential for successful performance in the position. All applicants must submit separate narrative statements that fully describe how their experience supports each MTQ requirement. The statements should include specific examples of actual experience, education, and accomplishments that directly relate to the MTQ. Examples should be clear and concise, and emphasize the level of responsibilities, scope, and complexity of programs managed, program accomplishments with results of action taken, policy initiatives, and level of contacts. You must address each MTQ separately and you should not exceed 2 pages per MTQ. You are required to respond to all MTQs. If you fail to do so, you will be rated as 'ineligible.' Expert knowledge and demonstrated leadership in managing a robust Information Technology (IT) program, providing overall strategic direction to a large organization, to include policy and planning, security, systems analysis, applications software, operating systems, network services, systems administration, and customer support. Expertise in the cost-benefit analysis, acquisition, implementation, sustainment, and program management oversight of Cyber Security and network operations efforts in government or industry with demonstrated experience in complying with the NIST 800-53 Risk Management Framework (RMF). Expertise in developing and implementing strategic information plans that include identifying innovative and leading edge solutions, implementing robust project planning, defining and securing funding, building a tech savvy and leading edge workforce, achieving quality improvement, meeting audit requirements, and standardizing systems. Failure to meet any one of the technical qualifications requirements automatically disqualifies an applicant. The best-qualified candidates will be distinguished from other applicants by an evaluation panel of senior level subject matter experts and executives referencing the technical and executive core qualifications.","PositionRemuneration":[{"MinimumRange":"149810.0","MaximumRange":"187300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-10T00:00:00.0000","PositionEndDate":"2022-01-24T23:59:59.9970","PublicationStartDate":"2022-01-10T00:00:00.0000","ApplicationCloseDate":"2022-01-24T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position serves as the Executive Director, Information Technology (IT) and Chief Information Officer (CIO), Defense Contract Management Agency (DCMA). This position is in the Senior Executive Service, a small elite group of top government leaders. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","SubAgencyName":"DCMA Information Technology Directorate (P2)","OrganizationCodes":"DD/DD63","Relocation":"True","HiringPath":["fed-competitive","ses","special-authorities"],"TotalOpenings":"1","AgencyMarketingStatement":"Join Team DCMA -- Challenge yourself! We are the independent eyes and ears of DoD and its partners, enhancing warfighter lethality by ensuring timely delivery of quality products, and providing relevant acquisition insight supporting affordability and readiness.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Serves as the principal advisor and assistant to the Defense Contract Management Agency (DCMA) Director and Senior Leadership Team (SLT) on all aspects and management of the worldwide Information Technology (IT) system, which provides business systems, knowledge management and service delivery for DCMA. Responsible for risk management and delivering a robust, capable and secure information control system, aligned with DCMA priorities and collaborating with other Department of Defense (DoD) components on joint IT programs and initiatives. Establishes systems and technical architecture direction for DCMA, employing a customer-service focus, in order to oversee and direct the agency's acquisition and deployment of hardware equipment, telecommunications capabilities and software applications, all of which required for successful performance of the agency missions. Provides executive leadership, supervision and career development to a highly skilled and professional workforce of more than 300 skilled IT professionals in globally dispersed locations. Leads global, shared services, and delivers stable and resilient world-class information technology and services to nearly 12,000 geographically dispersed DCMA employees and approximately 40,000 external users of DCMA information. Provides governance, oversight and management of Information Technology investment and technology choices and decisions to optimize total cost of ownership and investment return and mitigate risk exposures to DCMA as related to choose solutions, technology, architecture, contractors, and vendors, etc. Ensures technology solutions are designed and implemented based on appropriate data governance requirements and effective life cycle methodology principles. Provides technology risk management assessment strategies and capabilities through effective information security strategies and programs and proactive risk assessment and mitigation to mitigate technology risk exposure to DCMA."],"Education":"This position does not have an education qualification requirement.","Requirements":"","Evaluations":"Your application will be evaluated to determine whether basic qualifications requirements are met, and on the extent to which it shows that you possess the required knowledge, skills, and abilities to successfully perform the duties based on the scope and quality of total accomplishments, experience, and education. Applications of basically qualified candidates will be evaluated by an executive rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the appointing authority. The ECQ statements of the selectee must be certified by the OPM Quality Review Board, unless previously certified.","HowToApply":"The complete application package must be submitted by 11:59 PM (EST) on 01/24/2022 to receive consideration. To begin, click Apply to access an online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your USAJOBS resume and/or other supporting documents. Complete the online application, verify the required documentation, and submit the application. Your application must include your narrative statements addressing all five of the Executive Core Qualifications and each of the Technical Qualification statements. You will receive an email notification when your application has been received for the announcement. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), select the Application Status link and then select the More Information link for this position. The Application Status page will display the status of your application, the documentation received and processed, and your responses submitted to the online application. Your uploaded documents may take several hours to clear the virus scan process.","WhatToExpectNext":"Once your online application is submitted you will receive a confirmation notification by email. Your application will be evaluated to ensure all required documents have been received. All applications that have all required documents will be forwarded to management for panel review and possible interview. All applicants reviewed and/or referred will receive a notification letter.","RequiredDocuments":"1) A current resume (failure to submit will eliminate applicant from further consideration). Include in your resume the following information: Vacancy Announcement Number Full name, mailing and email addresses, day and evening phone numbers Education information (name, city & state of accredited college/university, type of degree and date received from schools accredited by accrediting institutions recognized by the U.S. Department of Education) Information about your paid and unpaid work experiences related to this position (job title, duties and accomplishments, employer's name and address, dates and duration of employment, work schedule and salary) Information about honors, awards, and special accomplishments 2) Mandatory Technical Qualifications (TQs) Statements (MANDATORY SUBMISSION). A separate narrative statement specifically addressing each MTQ (maximum length of each statement: two pages). Your application should include three separate MTQ statements, totaling no more than six pages. 3) Executive Core Qualifications (ECQs) Statements* (MANDATORY SUBMISSION). A separate narrative statement specifically addressing each individual ECQ, written in the Challenge-Context-Action-Result (CCAR) Model. *NOTE: The ECQ narrative statements are NOT required if the applicant is: (a) current or former Career SES member (These members MUST provide SF50 or DD3434, Notification of Personnel Action, as documentation of SES Appointment) OR (b) graduate of an SES Candidate Development Program (CDP) approved by OPM. DO NOT COMBINE THE MTQ AND ECQ STATEMENTS. Failure to submit mandatory statements will eliminate applicant from further consideration. 4) Performance Appraisal. Applicants who are current or former Federal employees MUST submit a copy of the most recent performance appraisal (or an explanation of why a performance appraisal cannot be provided). Failure to submit will eliminate applicant from further consideration. 5) Copy of the Notification of Personnel Action (SF-50 or DD-3434). Applicants who are current or former Federal employees MUST provide the most recent document that shows their status or reinstatement eligibility and grade and salary. Failure to submit will eliminate applicant from further consideration. 6) Graduates of an approved SES Candidate Development Program MUST provide a copy of their OPM certification of eligibility. Future Military Retirees*: You are required to submit a copy of your retirement DD Form 214 (Member 4 Copy) OR certification document** OR a copy of your retirement letter AND a copy of your terminal leave request (if applicable). You will be required to provide your DD Form 214 (Member 4 Copy) upon issuance.\nNOTE: Within the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326. Future Separation from the Military*: You are required to submit a copy of your most recent DD Form 214 (Member 4 Copy) OR certification document** OR a copy of your most recent active duty orders AND a copy of your terminal leave request (if applicable). You will be required to provide your DD Form 214 (Member 4 Copy) upon issuance. * Active duty military members who are selected may not be appointed unless on terminal leave or already separated from the armed forces. ** The 'certification' is a written document from the armed forces that certifies the service member is expected to be discharged or released from active duty service in the armed forces under honorable conditions not later than 120 days after the date the certification is submitted. The Statement of Service must be signed by, or by direction of, the adjutant, personnel officer, or commander of your unit or higher headquarters, AND the Statement of Service letter must include the branch of service, dates of active duty service, your rank, type of discharge, Character of Service (i.e., honorable), date of expected separation, and, if applicable, when your terminal leave will begin. IMPORTANT: Applicants who fail to submit all required documents WILL NOT receive consideration for this position. Incomplete application submissions, including those received without the required MTQ narrative statements, ECQ narrative statements, SF50, or performance appraisal, will result in an 'Incomplete' rating. It is the applicant's responsibility to submit all required documentation before the closing date of the announcement.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"This position does not meet criteria for appointment of Reemployed Annuitants. The DoD criteria for hiring Reemployed Annuitants can be found at: https://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf Background Investigation: This position is designated special sensitive as defined in DoD 5200.2-R and therefore requires that a personnel security investigation be adjudicated for security eligibility on a pre-appointment basis. This requirement may take 120 days or longer to process. The incumbent must complete a Single Scope Background Investigation (SSBI) and favorable adjudication by a determining authority and be eligible for a Top Secret clearance and access to Sensitive Compartmented Information (SCI). Financial Disclosure: Senior Executives are required to comply with the provisions of the Ethics in Government Act, PL 95-521, which requires the submission of a financial disclosure statement (OGE-278), upon assuming an SES position. This must be submitted annually and upon termination of employment Permanent Change of Station (PCS) expenses will be paid in accordance with the Joint Travel Regulation (JTR). When you perform a civilian PCS with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. Recruitment/Relocation/Retention Incentive may be authorized at Management's discretion. Defense Acquisition Workforce Requirements: Requires Level III certification in the Information Technology Career Field. Certification is required within 24 months of appointment. A 3-year tenure agreement is required. As required by Executive Order 14043, Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. If selected, you will be required to be vaccinated against COVID-19 and submit documentation of proof of vaccination before appointment or onboarding with the agency. The agency will provide additional information regarding what information or documentation will be needed and how you can request of the agency a legally required exception from this requirement. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you will be required to report to the official duty location and may be expected to temporarily telework. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a specific period of time determined by your supervisory chain. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"melanie.c.driskell3.civ@mail.mil","AgencyContactPhone":"804-609-4062","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"627853300","MatchedObjectDescriptor":{"PositionID":"S1L-2021-54","PositionTitle":"Director IT Data and Data Analytics","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/627853300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/627853300?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Eligibility will be based upon a clear showing the applicant has training, education and experience of the scope and quality sufficient to effectively carry-out the duties of the position. Candidates must exemplify the corporate perspective, leadership vision, broad experience and character needed in the SES corps not only to satisfy the immediate vacancy, but future vacancies which will occur in a variety of organizations, functions and locations. A. MANDATORY TECHNICAL QUALIFICATIONS (TQs): (NTE 2 pages total - PDF format) An additional supplemental statement must be submitted addressing each TQ separately. TQs must provide specific examples that address relevant experience and accomplishments. Applicants should focus on recent experience, education, and training, as some Recruitment Panel and Executive Resources Board members may consider experience that's over 10 years old to be outdated. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: 1. Demonstrated senior level experience in assessing the overall effectiveness of large-scale enterprise-wide Information Technology (IT) systems. 2. Executive level experience in the development of strategy and policy to advance data discovery and data analytics. B. MANDATORY EXECUTIVE CORE QUALIFICATIONS (ECQs): (NTE 10 pages total - PDF format) The ECQs describe the leadership skills needed to succeed in the Senior Executive Service (SES); they also reinforce the concept of an \"SES corporate culture.\" Submit a supplemental statement of the Executive Core Qualifications (ECQs listed below) in the challenge/context/action/result (C-C-A-R) model format as provided by the Office of Personnel Management (OPM) Guide to SES Qualifications. Applicants should focus on recent experience, education, and training, as some Recruitment Panel, Executive Resources Board, and or OPM Quality Review Board reviewers may consider experience that's over 10 years old to be outdated. [OPM's guidance in the Guide to Senior Executive Service Qualifications (Appendix B)]. Refer to the OPM Guide to SES Qualifications for specific information and guidance on the ECQ requirements, the C-C-A-R model, and examples of good qualifications statements located here. ECQ 1 - LEADING CHANGE. This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - LEADING PEOPLE. This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - RESULTS DRIVEN. This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - BUSINESS ACUMEN. This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - BUILDING COALITIONS: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. In addition, DoD requires an Enterprise Perspective. The individual must possess a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives should demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required--this information should be embedded within the application package [Resume (not to exceed 5 pages) and Technical Qualifications (not to exceed a combined total of 4 pages].","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-20T00:00:00.0000","PositionEndDate":"2022-01-12T23:59:59.9970","PublicationStartDate":"2021-12-20T00:00:00.0000","ApplicationCloseDate":"2022-01-12T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. The United States Space Force (USSF) Director of IT, Data, and Data Analytics (DIDA) assists the Chief Technology and Innovation Officer (CTIO) in the development of strategy and policy to advance employment of cutting edge digital technologies through the delivery of assured USSF Information Technology (IT); effectively managed data; and superior data analytics.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"SALARY: 158,541 - 183,300 per annum. (Air Force Tier 1) SES members are eligible for bonuses and/or ranks and stipends in addition to annual salary. AREA OF CONSIDERATION: Applications will be accepted from all qualified persons. SES members are eligible for Performance-Based Salary increases and/or bonuses. This is a SES Career Reserved position and is assigned a precedence priority code of DV-6/ Brig Gen, Tier 1 for protocol purposes. MOBILITY: Organizational and geographical mobility is essential in developing and managing SES and DISES leaders and generally is a key to advancement. Therefore, mobility is a condition of employment and appointed SES and DISES members will be required to sign a Reassignment Rights and Obligation Agreement.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Director IT Data and Data Analytics (DIDA) provides direction and recommends action on matters pertaining to the formulation, review and execution of policies, programs and plans encompassing Space Force Enterprise-wide IT infrastructure and security, data management and data analytics. The incumbent coordinates all functional transformation activities to ensure consistency with overall installations and logistics enterprise solutions. The DIDA accomplishes these missions through a variety of means including training, providing subject matter expertise, spotlighting key activities to senior leaders and the USSF, bridging linkages among organizations, championing initiatives for funding and collaboration, and providing guidance and direction through the preparation of policies for approval and issues guidance/procedures, via official Space Force publications, to ensure implementation of those policies. The incumbent represents Space Force Information Technology, Data Management, Data Analytics, and employment of artificial intelligence at top-level MAJCOM, Air and Space Staff, Secretariat, OSD and higher level meetings having a wide range of policy, strategy, resource integration policy, information technology, and modernization implications. The incumbent is responsible for planning, managing, and directing the development, modernization and integration of Space Force digital infrastructure. The incumbent influences national security policy for Air and Space Force IT systems and collaborate with the DAF Chief Information Officer on the current state of policy evolution within the Department of Defense and Joint communities. Assesses overall effectiveness of information systems through surveys, special visits, and analysis. Incumbent collaborates with Space Staff and other Air Staff and Secretariat elements in planning and executing strategies critical to establishing and sustaining the digital transformation of the Space Force. Serves as focal point for space and cyber system lifecycle sustainment. Incumbent ensures availability of all space and cyber capabilities through sustainment and modernization of systems, including restoring cyber network services and integrating new services onto Air Force Networks. Assists and provides input to the Chief of Staff and Secretary of the Air Force for their testimony before Congressional committees. Maintains communications with committee staffs and ensures Space Force interests in digital capabilities are in consonance with Congressional intent and public law."],"Education":"A bachelor's degree from an accredited institution is highly desired. A master's or advanced degree is also highly desired.","Requirements":"","Evaluations":"Applications will be evaluated against the qualifications requirements. Failure to meet any one of the Mandatory Technical or Executive Core Qualifications standards will eliminate a candidate from further consideration. Candidates will be evaluated for this position by a screening panel composed of a diverse mix of senior executives and/or general officers selected for organizational and/or functional backgrounds relevant to this position. The panel discusses each application and reaches consensus as to the Best Qualified, Qualified or Not Qualified candidates. Only the Best Qualified candidates will be interviewed. The panel will then make a recommendation of those Best Qualified candidates who should be referred to the selecting official, in priority order. Final selection is contingent upon the Air Force Executive Resources Board, the Under Secretary of the Air Force and OPM Quality Review Board (QRB) Certification. REMINDER: Before uploading your required PDF documents (Resume, Technical Qualification narrative), please ensure they DO NOT EXCEED the noted page limits.","HowToApply":"Please follow the below instructions to submit applications. Any applications received that do not include all of the required documents or do not meet format requirements will not be forwarded for consideration. The complete Application Package must be submitted by 11:59 PM (ET) on January 12, 2022. To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant. PREFERRED RESUME FORMAT (Limit 5 pages/Times New Roman 12-font) (Do Not Use the USAJOBS Resume Builder) - Please submit a typewritten resume (upload as a PDF), including the following information: Job Information: Announcement number (S1L-2021-54) and title of the position to which you are applying. Personal Information: Full name, mailing address (with zip code), day and evening phone numbers (with area code) and complete e-mail address where you would like to receive correspondence regarding your application. **PLEASE DO NOT INCLUDE SOCIAL SECURITY NUMBER** Active-Duty/Retired Military: State highest rank held, date of promotion and date eligible to retire or date of retirement, (e.g., Colonel/June 2006/December 2014). NOTE: IAW 5 U.S.C. 3326, a 180-day waiver will be required for retired or retiring members of the armed forces during the period of 180 days immediately after retirement. Education: Educational information, including the name, city and state of colleges or universities you attended, as well as the type and year of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www.ed.gov/admins/finaid/accred/index.html Work Experience: Give the following information for your paid and non-paid work experience related to the job for which you are applying: (Do not send job descriptions)\n- Starting and ending dates (month and year)\n- Job title (for government position, include civilian series and grade or military rank)\n- Employer's name and address\n- Supervisor's name and phone number, please indicate if we may contact your current supervisor\n- Salary (current) HELPFUL HINTS FOR YOUR RESUME: - Reflect on the ECQs and think about how your past experiences and education relate to each ECQ.\n- Read the vacancy announcement carefully. - Adhere to the 5-page limitation (in PDF format and 12 point font) - Quantify your accomplishments. * Applicants should focus on recency of experience - Recruitment Panels, Executive Resources Boards, and Hiring Officials may consider experience over 10 years outdated.\n* Seek mentoring assistance from a current SES or equivalent to review your package before submission. References: Provide the names, addresses and telephone numbers of three individuals who can comment on your qualifications for this position. Please do not list supervisors already listed above. This agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application or hiring process, please notify this office. The decision on granting reasonable accommodations will be on a case-by-case basis. SAF/MRL CONTACT INFORMATION: Questions regarding this announcement may be directed to Virginia Reynolds at virginia.reynolds@us.af.mil, Melanie McGuire at melanie.mcguire@us.af.mil or the SAF/MRL office at usaf.pentagon.af-a1.mbx.af-a1ls-ann-mbx@mail.mil.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"To receive full consideration, each applicant must submit the documents in the format as designated. Packages that do not include all of the required documents or meet format requirements will not be forwarded for consideration. **************ALL DOCUMENTS MUST BE UPLOADED IN PDF FORMAT******************* The Qualifications Documents must be formatted using Times New Roman, size 12 font, with 1-inch margins. Do not use borders, provide photos, or list a Social Security Number on any of the Qualifications Documents. DO NOT COMBINE DOCUMENTS. A. Resume in the preferred format (Limit 5 pages). Upload in PDF format. PLEASE DO NOT USE USAJOBS RESUME BUILDER. B. Mandatory Technical Qualifications Statement addressing each of the TQs (Limit 2 pages). Upload in PDF format and include the MTQ statement as indicated in the announcement. C. Executive Core Qualifications Statement addressing each of the ECQs (Limit 10 pages - upload in PDF format); OR, OPM Qualifications Review Board (QRB) Certification (1 page). (NOTE: ECQs are not required for current or former Career SES Members who have been certified by the QRB; please provide a copy of an SF-50 showing career SES status. Candidates who are not current or former Career SES Members but have OPM QRB certification of their ECQs must provide their OPM certificate). D. Most recent completed Performance Appraisal or Performance Report (if applicable). E. Most recent Notification of Personnel Action, SF-50, noting your current position, grade level and salary level (applies only to current or former civilian government employee). F. College transcript(s) (copy is acceptable) which demonstrates the acceptable combinations of education and experience as noted by OPM (if using education as a qualification). G. Military (Retired), a copy of your DD214 and/or Retirement orders. Documents are required if applicable. H. (Optional): Race and National Origin Identification, SF-181 -- Form available at www.opm.gov I. (Optional): Self-Identification of Handicap, SF-256 -- Form available at www.opm.gov DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as copies of position descriptions, award certificates and transmittal letters will not be forwarded for review.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Veterans' Preference: Veterans' preference is not applicable to the SES. Relocation Authorized: Payment of Permanent Change of Station (PCS) costs is authorized in accordance with the Joint Travel Regulations (JTR). Recruitment/Relocation Incentive: May be offered. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11307827. Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"robb.levin@us.af.mil","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"626906800","MatchedObjectDescriptor":{"PositionID":"HQKF214680071381SES","PositionTitle":"Director Federal and Commercial Interoperability","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/626906800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/626906800?PostingChannelID="],"PositionLocationDisplay":"Rosslyn, Virginia","PositionLocation":[{"LocationName":"Rosslyn, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Rosslyn, Virginia","Longitude":-77.07267,"Latitude":38.896645}],"OrganizationName":"Defense Health Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: US Citizens In order to qualify, you must meet the requirements described below. Be sure to carefully read this announcement to see if additional information is required and how it should be submitted. QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs) will eliminate you from consideration. EXECUTIVE CORE QUALIFICATIONS: You will be assessed against the Executive Core Qualifications (ECQs). They are designed to assess executive experience and potential - not technical expertise. They measure whether you have the broad executive skills needed in a variety of senior executive positions. Failure to meet a qualification requirement will disqualify an applicant. (Each must be addressed separately in your Supplemental Narrative Statement. The ECQs must not exceed 10 pages.) You are required to respond to all ECQs. If you fail to do so, you will be rated ineligible. When responding to the Executive Core Qualifications (ECQs), you must clearly show that you possess the experience, knowledge, skills and ability to perform the duties of this position by submitting narrative responses in which you detail your experience in each of the ECQs. Your examples should be clear and emphasize your level of responsibilities, scope and complexity of programs managed, program accomplishments with results of your actions, policy initiatives and level of contacts. You should limit your narrative to two pages per ECQ, and address each ECQ separately. More information on these core qualifications are available at: http://www.opm.gov/ses/recruitment/ecq.asp The ECQs describe the leadership skills needed to succeed as an SES: they also reinforce the concept of an \"SES corporate culture.\" Refer to the OPM Guide to SES Qualifications for specific information and guidance on the ECQ requirements, the Challenge-Context-Action-Result (C-C-A-R) model, and examples of good qualifications statements at the website: https://www.opm.gov/policy-data-oversight/senior-executive-service/reference-materials/guidetosesquals_2012.pdf (Note: Current career Senior Executive Service (SES); former career Senior Executive Service (SES) who are reinstatement-eligible; and graduates of OPM-certified Candidate Development Programs are not required to address the ECQs, but must address the Mandatory Technical Qualifications.) ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. You are required to respond to all of the technical qualifications. If you fail to do so you will be rated as ineligible. Each MTQ must not exceed 2 pages.) Proven ability to manage and lead a diverse professional, technical and administrative staff across multiple functional areas in a complex and dynamic environment involving multiple organizations with differing missions and often with differing views of issues. Includes the ability to bring together divergent views for common solutions to complicated problems. Demonstrated executive-level IT or healthcare IT experience and related experience as applied to successfully analyzing complex issues, working with external bodies and standards development organizations (SDOs) and translating organizational goals to executable programs of national significance and/or wide public interest to deliver cost-effective and business-focused solutions. Substantive knowledge of laws, policies, regulations, and guidelines governing Federal, Department of Defense (DoD), Department of Veterans' Affairs and the Private Sector related to implementing national health data standards for interoperability. DoD Joint Enterprise-Wide Experience Statement: In addition, DoD requires an Enterprise Perspective. This individual must have the ability to apply a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities is required. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within the application package (Resume, Technical Qualifications and Executive Core Qualifications). Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g. professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"199300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-15T00:00:00.0000","PositionEndDate":"2022-01-14T23:59:59.9970","PublicationStartDate":"2021-12-15T00:00:00.0000","ApplicationCloseDate":"2022-01-14T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: You will serve as the Director, Federal and Commercial Interoperability, located in the Defense Health Agency (DHA) with assignment to the Federal Electronic Health Record Modernization Office. This position reports to the Director, Federal Electronic Health Record Modernization (FEHRM).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/DD60","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"At the Defense Health Agency (DHA), our Mission is to support the National Defense Strategy and Service Military Departments by leading the Military Health System (MHS) as an integrated, highly reliable system of medical training, readiness, and health. As the health care delivery arm of the MHS, DHA is crucial to supporting the Department of Defense's integrated system of readiness and health. DHA manages a global health care network of military and civilian medical professionals and more than 400 military hospitals and clinics around the world. DHA is a joint, integrated Combat Support Agency that enables the Army, Navy, and Air Force medical services to provide a medically ready force and ready medical force to Combatant Commands in both peacetime and wartime. The DHA supports the delivery of integrated, affordable, and high quality health services to the MHS beneficiaries and is responsible for driving greater integration of clinical and business processes across the MHS.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Lead the FEHRM's efforts to implement national health data standards for interoperability.","Establish, monitor, and approve the clinical and technical standards profiles and processes to ensure seamless integration of health data between private health care providers and the Departments.","Actively engage with national and international health standards setting organizations to ensure their resulting standards meet the needs of DoD, VA and other federal partners.","Oversee/approve adoption of and mapping to national and international health standards in coordination with the Office of the National Coordinator for Health Information Technology.","Ensure content/format of health data uses common language to improve data exchange with private sector, that clinicians have an integrated, computable view of patient's comprehensive health record, and enable population health/analytics capabilities.","Manage the portfolio of data domain and messaging standards for the FEHRM solutions that are necessary to create seamless integration of DoD, VA, and other federal partners with private sector health care record data based on functional use cases.","Monitor and report on the Departments' use of approved national and international health standards.","Monitor and report on the Departments' compliance with the certification of data domain and messaging standards for department information technology (IT) solutions necessary to create a seamless integration of health care record data.","Provide forthright, timely and independent reports to stakeholders and oversight organizations, regarding the Departments' use and compliance with adopted, identified and approved standards","Coordinate and communicate within the FEHRM and across the Departments to ensure advances in interoperability capabilities enhance the quality, safety, efficiency, and effectiveness of health care services.","Provide input for the Joint Executive Committee's (JEC) Joint Strategic Plan, as appropriate, in coordination with the Departments.","Assist the Departments with additional responsibilities as agreed upon by the FEHRM Director, Deputy Director, the DoD and the VA through the JEC.","Provide Senior Executive direction to address and resolve issues and requirements resulting from new or modified legislation and/or regulations that may impact the interoperability of electronic health record systems or capabilities.","Define and communicate future state architectural visions, based on the desired state of interoperability.","Provide input to the FEHRM Strategic Plan to optimize/progress the necessary resourcing, staffing expertise and infrastructure required to meet/ exceed and drive clinical and technical data interoperability at the national/international level.","Conduct briefings, presentations, or discussions on substantive EHRs interoperability/data sharing issues to senior officials, Congressional committees, and other government/non-government agencies (including health care standards organizations).","Ensure understanding, integration and communication to the clinical provider level on the use systems and contribute to the continuity of care for Service members and Veterans.","May be required to testify to Congressional oversight committees or to meet with Congressional staff on items related to the mission of the FEHRM.","Participate in various committees with senior management officials from Federal, State or private sector organization on electronic health records interoperability.","Ensure proper standards/architecture is defined to ensure confidentiality, integrity, and availability of medical records and privacy. This requires the incumbent, as needed, to attend Secret and Top Secret vulnerabilities and threat briefings."],"Education":"","Requirements":"","Evaluations":"Applicants will be evaluated on the quality and extent of your accomplishments, experience, and education. Your application will be evaluated by a rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the appointing authority. Unless you have already been certified by the Office of Personnel Management (OPM) Qualifications Review Board (QRB), your ECQs must be certified by the OPM QRB before your appointment can occur. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section below. The complete application package must be submitted by 11:59 PM (EST) on 01/14/2022to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11321381). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"To apply for this position, you must provide a complete Application Package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. A complete Application Package includes: 1. Your Resume. In addition to your written statements addressing the Executive Core Qualifications, the Mandatory Technical Qualifications, and other qualifications as applicable, submit a complete resume to describe your qualifications, not to exceed five pages. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide else wherein your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. 2. Mandatory Technical Qualifications (MTQs): Separate narrative statements specifically addressing each mandatory technical qualification. This statement should not exceed two pages per MTQ. 3. Mandatory Executive Core Qualifications (ECQs): A narrative statement specifically addressing each individual ECQ using the Challenge-Context-Action-Result Model. Total ECQ write-up should not exceed 10 pages. In lieu of the narrative statement, current career SES members, reinstatement eligibles, and Candidate Development Program graduates must provide the documentation in item #4. 4. Copy of the Notification of Personnel Action (SF-50): Current and former career SES members must provide an SF-50 showing their status or reinstatement eligibility. Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership,license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees must be supported by unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. You may submit a copy of your degree(s) if specific coursework does not have to be verified.Claims for approved \"grandfather\" clauses must be fully supported with documentation. NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"This position is in the Senior Executive Service (SES), a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. Male applicants born after December 31, 1959 must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct Deposit of Pay is required. This position requires you to submit a Public Financial Disclosure Report (OGE 278) upon entry, and annually thereafter. This position is not covered by the Department of Defense Priority Placement Program (PPP). Veterans' preference is not applicable to the Senior Executive Service. You will be required to sign the Reassignment Rights and Obligations Agreement as a condition of appointment into the SES in accordance with DoD Directive 1403.03. Within the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions in 5 United States Code 3326. This position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time. Supervisors in the executive branch have a heightened personal responsibility for advancing government ethics. You will be required to review the 14 General Principles of Ethical Conduct at 5 CFR 2635.101. A recruitment incentive MAY be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive MAY be authorized. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Permanent Change of Station (PCS) allowances may be authorized, subject to the provisions of the Joint Travel Regulations and an agency determination that a PCS move is in the Government Interest. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}