{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":2,"SearchResultCountAll":2,"SearchResultItems":[{"MatchedObjectId":"622159400","MatchedObjectDescriptor":{"PositionID":"9L-AFPC-11296792-426536-ARN","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/622159400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/622159400?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"HQ USAF and Support Elements","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"01 APR 24","Code":"15319"}],"QualificationSummary":"This is a Term position NTE 01 April 2024; the individual selected for this position may be extended without further competition. Current Federal civilian employees may apply for this position using \"Reinstatement\" eligibility and if selected, a break in service of at least 4 calendar days may be required prior to appointment to this position. This is an Obligated Position in which an employee has return rights. Upon the employee's return, incumbent may be required to vacate this position. In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: EDUCATION: Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-13, or equivalent in other pay systems. Examples of specialized experience includes expert knowledge of political-military affairs expertise and policy oversight of Air Force plans, programs, and requirements involving international affairs for a command AOR; expert knowledge of interfacing directly with embassies in Washington DC and their headquarters throughout all regions by serving as the focal point for all weapon systems sales, transfers, transfers, and support provided through Foreign Military Sales; mastery of advanced management and organizational principles and practices along with a comprehensive knowledge of providing direction to field agencies to successfully develop and execute international programs in the regions; mastery with working with the US Ambassador's staff and their Country Teams to assess and support country requirements in the regions; knowledge of military command structure, missions, programs, and organizational relationships plus a thorough knowledge of quantitative and qualitative methods and techniques to develop staffing standards covering complex program functions or missions, e.g., management of agency research operations, or staffing requirements for new or substantially altered training or operational missions and programs. NOTE: You must submit a copy of official transcripts. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&#173;grade requirements to be considered eligible. One year at the GS-13 level is required to meet the time-in-grade requirements for the GS-14 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Knowledge of Security Cooperation laws, regulations, policies and procedures; thorough understanding of associated acronyms, directives and instructions. 2. Knowledge of historical and geopolitical environment of the European/NATO area. 3. Working knowledge of and/or experience with Air Force operations, aircraft, and weapons system programs. 4. Ability to analyze, plan, and adjust work operations of one or more organizational segments to meet program requirements and objectives within available resources. 5. Ability to gather, assemble, and analyze data to prepare budget estimates, develop alternatives, and make recommendations to resolved budget/funding problems. 6. Skill in the application of analytical methods and techniques to evaluate effects of changes in program plans and funding. 7. Ability to communicate, both orally and in writing, to justify, defend, present, and/or advise on processes/actions. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"122530.0","MaximumRange":"159286.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-11-15T12:28:13.9600","PositionEndDate":"2021-11-30T23:59:59.9970","PublicationStartDate":"2021-11-15T12:28:13.9600","ApplicationCloseDate":"2021-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to serves as the Deputy Division Chief, Europe & NATO Division overseeing and advising an office of regional experts (military and civilian) to build, sustain and expand relationships in Europe and NATO on behalf of the Secretary of the Air Force. Acts as the Division Chief in the absence of the Colonel/O-6 Division Chief.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"None","OrganizationCodes":"DD/AF13","Relocation":"True","HiringPath":["fed-transition","fed-competitive","disability","mspouse","vet","overseas"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanMilitary Spouse PreferenceNon-DoD TransferPeople with Disabilities, Schedule A","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Political-Military Advisor.","Resource Management.","Represents SAF/IA with a variety of installation and functional area organizations.","Plans, organizes, and oversees the activities of the Europe/NATO Division."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 11/30/2021 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11296792 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Current Federal Civilian employees may apply for temporary and term positions and if selected, a break in service may be required prior to appointment to the position. Temporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11296792. Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"623638000","MatchedObjectDescriptor":{"PositionID":"9L-AFPC-11306215-447644-TJM","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/623638000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/623638000?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"HQ USAF and Support Elements","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Series 0130. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of transcripts. OR Combination of Education and Experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. NOTE: You must submit a copy of transcripts. OR Experience: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below. SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-12, or equivalent in other pay systems. Examples of specialized experience includes extensive knowledge of national security, strategic policy, international relations, foreign affairs, foreign assistance programs, and related fields. Specific experience is required in performing these functions with the CENTCOM area of responsibility countries. Ability to develop and analyze political-military alternatives as they relate to the USAF and Europe. Must be able to acquire and comprehend a working knowledge of security assistance laws, regulations, principles, policy, national and international politics, and economic and military operations sufficiently to assist agency technical experts in one or more very broad aspects of foreign military sales and other security assistance programs. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-12 level is required to meet the time-in-grade requirements for the GS-13 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Knowledge of foreign affairs and national security policies and objectivities; US defense programs and policies doctrine, strategy, and political-military structures as they pertain to the CENTCOM region.\n2. Knowledge of US foreign policy, legislation/directives, the Arms Export Control Act (AECA), the Foreign Assistance Act (FAA), and other DoD and Air Force directives/regulations governing the sale of military articles and services to foreign governments.\n3. Ability to research and analyze information/situations to provide sound advice and recommendation in support of senior Air Force officials' decision making.\n4. Skill and diplomacy in dealing with senior officials in the Federal Government, industry and the international community.\n5. Ability to communicate effective, both orally and in writing to justify, defend, present, advocate, and/or advise on Security Assistance processes, actions, and decisions.\n6. Ability to perform work requiring a professional knowledge of the formulation and implementation of foreign policy of the United States in the conduct of the relations, primarily of a political or politico-economic nature, of the United States with other governments. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"103690.0","MaximumRange":"134798.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-11-24T00:00:00.0000","PositionEndDate":"2021-12-02T23:59:59.9970","PublicationStartDate":"2021-11-24T00:00:00.0000","ApplicationCloseDate":"2021-12-02T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to serve as Country Director in the Central Division (Political-Military Affairs Specialist). Reviews, analyzes, and makes recommendations on the political -military, economic, and security assistance aspect of the United States Air Force relations with and interests in the countries in the Central Command area of responsibility.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"13","OrganizationCodes":"DD/AF13","Relocation":"False","HiringPath":["fed-transition","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Responsible for recommending and implementing policy guidance for the direction, integration, management and supervision of international programs and activities affiliated with the Department of the Air Force.","Areas of direct responsibility include implementation of US and USAF policy, military contacts and cooperative activities, country and regional reviews, security assistance, disclosure policy, related activities, and other USAF international programs","Reviews and establishes policy on current developments in the Central Division. Identifies items that impact USAF bilateral or regional programs.","Represents USAF at weekly, monthly, and annually occurring interagency and departmental conferences and meetings. Represents SAF/IA as a member of appropriate committees and working groups."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 12/02/2021 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11306215 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11306215. Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. If you have questions regarding this announcement and have hearing or speech difficulties click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}