{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":8,"SearchResultCountAll":8,"SearchResultItems":[{"MatchedObjectId":"632649000","MatchedObjectDescriptor":{"PositionID":"EUJU224630524872","PositionTitle":"International Relations Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/632649000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/632649000?PostingChannelID="],"PositionLocationDisplay":"Camp Arifjan, Kuwait","PositionLocation":[{"LocationName":"Camp Arifjan, Kuwait","CountryCode":"Kuwait","CityName":"Camp Arifjan, Kuwait","Longitude":48.162018,"Latitude":28.87174}],"OrganizationName":"U.S. Army Central","DepartmentName":"Department of the Army","SubAgency":"ASG-Kuwait","JobCategory":[{"Name":"International Relations","Code":"0131"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Excepted Service Overseas Family Member AppointmentFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentNon-Appropriated Fund Instrumentality (NAFI)Non-Department of Defense (DoD) TransferPeople with Disabilities, Schedule AReinstatementVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. BASIC REQUIREMENT: 1. Degree: Bachelor's degree (or higher degree) with a major or equivalent, or a combination of courses totaling at least 24 semester hours in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR 2. Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, in one or more of the social sciences, or in the humanities, as shown in A above, plus appropriate experience or additional education. OR 3. Experience: four years of appropriate experience in one or more of the fields, as shown in A above, in work associated with international organizations, problems, or other aspects of foreign affairs. In addition to meeting the basic requirement above, to qualify for this position, you must also meet the specialized experience listed below. Specialized Experience: One year of specialized experience which includes: (1) providing guidance to management on all issues involving politico-military relations between the U.S. and Kuwait; (2) .developing policies and procedures for relations with the Kuwaiti Host Nation; AND (3) representing a U.S. organization at meetings, ceremonies, and official/unofficial social occasions of significance to Kuwaiti-American relations. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-12). You will be evaluated on the basis of your level of competency in the following areas:\nIntegration, Outreach & CollaborationIntercultural RelationsInternational Engagement Action Planning Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-???????12).","PositionRemuneration":[{"MinimumRange":"81216.0","MaximumRange":"105579.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-24T09:37:49.5770","PositionEndDate":"2022-02-07T23:59:59.9970","PublicationStartDate":"2022-01-24T09:37:49.5770","ApplicationCloseDate":"2022-02-07T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: The position is located at Camp Arifjan, Kuwait, a US Avides off base housing with a vehicle for those who qualify. The base provides permanent support facilities, base exchanges (AAFES), three gyms, a pool, three Military Dining Facilities, as well as paved roads throughout Camp Arifjan.rmy installation which accommodates elements of deployed Military forces from all over the world. The Kuwait Ministry of Defense pro","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"None","SubAgencyName":"ASG-Kuwait","OrganizationCodes":"DD/AR3A","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","disability","land","mspouse","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Army values diversity of perspectives, backgrounds, cultures and skills, which connects employees to organizations that are committed to building an inclusive work environment where they can contribute to their fullest potential.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As an International Relations Specialist for the Directorate of Host Nation Affairs, Area Support Group - Kuwait (ASG-KU). You will:","- Provide guidance on all, often sensitive and contentious, issues involving Host Nations-ASG-KU politico-military relations.","- Interact with senior leaders and maintains awareness on a broad range of host nation matters through liaison with staff and providing relevant host nation input.","- Assist Director prepare for and engage with U.S. and host nation military and government institutions and civilian organizations as required.","- Represent the Directorate during interactions with key host nation officials.","- Develop and implement policies and procedures for relations with the Host Nation, currently Kuwait.","- Stay abreast of all coordination for precedent-setting, potentially sensitive and/or contentious coordination between senior U.S. military officials and Kuwait military and government officials."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 02/07/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11344872). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs and Strategic Planning position. The initial length of this overseas tour is 12 months, unaccompanied, and can be extended up to 5 years. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction.htm for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations. Relocation/Recruitment Incentive may be authorized. Domicile to duty transportation will be provided at no cost to employees.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"632650800","MatchedObjectDescriptor":{"PositionID":"EUJU224630524873D","PositionTitle":"International Relations Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/632650800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/632650800?PostingChannelID="],"PositionLocationDisplay":"Camp Arifjan, Kuwait","PositionLocation":[{"LocationName":"Camp Arifjan, Kuwait","CountryCode":"Kuwait","CityName":"Camp Arifjan, Kuwait","Longitude":48.162018,"Latitude":28.87174}],"OrganizationName":"U.S. Army Central","DepartmentName":"Department of the Army","SubAgency":"ASG-Kuwait","JobCategory":[{"Name":"International Relations","Code":"0131"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: US Citizens In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. BASIC REQUIREMENT: 1. Degree: Bachelor's degree (or higher degree) with a major or equivalent, or a combination of courses totaling at least 24 semester hours in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR 2. Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, in one or more of the social sciences, or in the humanities, as shown in A above, plus appropriate experience or additional education. OR 3. Experience: four years of appropriate experience in one or more of the fields, as shown in A above, in work associated with international organizations, problems, or other aspects of foreign affairs. In addition to meeting the basic requirement above, to qualify for this position, you must also meet the specialized experience listed below. Specialized Experience: One year of specialized experience which includes: (1) providing guidance to management on all issues involving politico-military relations between the U.S. and Kuwait; (2) .developing policies and procedures for relations with the Kuwaiti Host Nation; AND (3) representing a U.S. organization at meetings, ceremonies, and official/unofficial social occasions of significance to Kuwaiti-American relations. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-12). You will be evaluated on the basis of your level of competency in the following areas:\nIntegration, Outreach & CollaborationIntercultural RelationsInternational Engagement Action Planning","PositionRemuneration":[{"MinimumRange":"81216.0","MaximumRange":"105579.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-24T09:38:28.1270","PositionEndDate":"2022-02-07T23:59:59.9970","PublicationStartDate":"2022-01-24T09:38:28.1270","ApplicationCloseDate":"2022-02-07T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: The position is located at Camp Arifjan, Kuwait, a US Army installation which accommodates elements of deployed Military forces from all over the world. The Kuwait Ministry of Defense provides off base housing with a vehicle for those who qualify. The base provides permanent support facilities, base exchanges (AAFES), three gyms, a pool, three Military Dining Facilities, as well as paved roads throughout Camp Arifjan.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"None","SubAgencyName":"ASG-Kuwait","OrganizationCodes":"DD/AR3A","Relocation":"True","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Army values diversity of perspectives, backgrounds, cultures and skills, which connects employees to organizations that are committed to building an inclusive work environment where they can contribute to their fullest potential.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Provide guidance on all, often sensitive and contentious, issues involving Host Nations-ASG-KU politico-military relations.","Interact with senior leaders and maintains awareness on a broad range of host nation matters through liaison with staff and providing relevant host nation input.","Assist Director prepare for and engage with U.S. and host nation military and government institutions and civilian organizations as required.","Represent the Directorate during interactions with key host nation officials.","Develop and implement policies and procedures for relations with the Host Nation, currently Kuwait.","Stay abreast of all coordination for precedent-setting, potentially sensitive and/or contentious coordination between senior U.S. military officials and Kuwait military and government officials."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Basis for Rating: Qualified candidates will be assigned to one of three quality categories: Best Qualified, Highly Qualified and Qualified. Veteran preference eligibles are listed ahead of non-preference eligibles within each quality category. Best Qualified. Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements for the announced position. Highly Qualified. Candidates in this category possess good skills and experience above the minimum requirements for the announced position. Qualified. Candidates in this category meet the minimum experience requirements for the announced position. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 02/07/2022 to receive consideration To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11344873). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on whether or not you are eligible for preference in federal employment. A complete description of preference categories and the associated required documents is in the Applicant Checklist (External). As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you will not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct Deposit of Pay is required. This is a Career Program (CP) 60 - Foreign Affairs and Strategic Planning position. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. You may claim military spouse preference. Applicants must comply with the Exceptional Family Member Program requirements as outlined in the DoD Instruction 1315.19 U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. Applicants must comply with the Exceptional Family Member Program requirements as outlined in the DoD Instruction 1315.19 U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. Employees who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Movement overseas may require you to initiate a change in your health benefits plan to ensure coverage. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. http://www.dtic.mil/whs/directives/corres/pdf/1400.25-V1250.pdf For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. The initial length of this overseas tour is 12 months, unaccompanied, and can be extended up to 5 years. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction.htm for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations. Relocation/Recruitment Incentive may be authorized. Domicile to duty transportation will be provided at no cost to employees.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"633432800","MatchedObjectDescriptor":{"PositionID":"FEFK211500760355R","PositionTitle":"Language Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/633432800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/633432800?PostingChannelID="],"PositionLocationDisplay":"Camp Humphreys, South Korea","PositionLocation":[{"LocationName":"Camp Humphreys, South Korea","CountryCode":"South Korea","CityName":"Camp Humphreys, South Korea","Longitude":127.1077,"Latitude":36.9703}],"OrganizationName":"U.S. Army, Pacific","DepartmentName":"Department of the Army","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Defense Civilian Intelligence Personnel System (DCIPS) Interchange AgreementExcepted Service Overseas Family Member AppointmentFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentMilitary Spouse Preference (MSP) for Overseas Employment 30 Days PRIOR TO ARRIVAL PilotNon-Department of Defense (DoD) TransferReinstatementVeterans Employment Opportunity Act (VEOA) of 1998 ***Special Note for Military Members*** MILITARY RETIREES: A retired member of the Armed Forces may not be appointed to a civilian position in DoD (including a non-appropriated fund position) within 180 days after retirement [** unless the following conditions have been met: the Secretary concerned authorizes the appointment; or the position is authorized special pay under 5 U.S.C. 5305; or a state of national emergency exists] MILITARY SEPARATED (NON-RETIREE): Military members may be appointed while on terminal leave, before the effective date of their military separation. Applications will only be accepted from members of the Armed Forces that indicate they are immediately appoint-able within 120 days. If you are currently stationed in the overseas area, all of your overseas time will be credited toward your current overseas tour end date. Your overseas time served will not reset upon accepting this assignment. If you have returned from OCONUS within the past 2 years or less, your time previously served in the OCONUS area will be credited to your 5 year overseas rotation upon accepting this assignment. If you are currently stationed in the overseas area, all of your overseas time will be credited toward your current overseas tour end date. Your overseas time served will not reset upon accepting this assignment. If you have returned from OCONUS within the past two (2) years or less, your time previously served in the OCONUS area will be credited to your five (5) year overseas rotation upon accepting this assignment. In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Specialized Experience: One year of specialized experience which includes experience with interpreting and translating the Korean language into the English language and vice versa; Translating (written) and interpreting (oral) technical documents and discussions from Korean to English and English to Korean and applying Korean customs, courtesies, protocol, and culture in a government, business or legal setting. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11). You will be evaluated on the basis of your level of competency in the following areas:\nForeign LanguageOral CommunicationWritten Communication Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-???????11).","PositionRemuneration":[{"MinimumRange":"68299.0","MaximumRange":"88792.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-28T00:00:00.0000","PositionEndDate":"2022-02-07T23:59:59.9970","PublicationStartDate":"2022-01-28T00:00:00.0000","ApplicationCloseDate":"2022-02-07T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: Serves as principle Hangul-English and English-Hangul interpreter & translator for United States Forces Korea (USFK), Combined Forces Command (CFC), and United Nations Command (UNC) Strategy, Plans, Policy and Communication Strategy Directorate (U/C/J5) with special tasking in CFC C5 Plans and U/C/J5 Communication Strategy Divisions.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"12","HighGrade":"12","PromotionPotential":"None","OrganizationCodes":"DD/ARP1","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","land","mspouse","vet"],"AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Army values diversity of perspectives, backgrounds, cultures and skills, which connects employees to organizations that are committed to building an inclusive work environment where they can contribute to their fullest potential.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Provide accurate, real-time, unscripted translation support to meetings, interactions, and other engagements","Responsible for accurate and rapid translations of written communications from or into English, Korean characters (Hangul), mixed Korean and Chinese characters (Hanmun), or phonetics prior to and during meetings.","Translates written communications, from Korean into English and vice-versa, pertaining to a range of specialized fields having functionally peculiar terms and expressions.","Provides spoken interpretation support to bilateral meetings involving technical, scientific, economic, legal and/ or administrative nature with very specialized terminology.","Provide cultural insights and advice to Division chief and members.","Conducts formal and informal briefings, analysis and recommendations, reports, studies, and assessments for presentation to senior leaders.","Serve as a bridge between Korean and US members in Division and in other organizations.","Supports the translation of international relations and information environment material.","Serves as the senior translator/interpreter who works out of the UCJ-5 with priority of support to a Colonel division leader and the Korean and US division members."],"Education":"Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 02/07/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11360575). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration. Effective 1 September 21, the Republic of Korea will require all visa-free foreign visitors (e.g. US passport holders) to obtain a Korean Electronic Travel Authorization (K-ETA) prior to arrival. DoD Civilians, Eligible Family Members (EFM) and DoD Contractors must comply with the K&#172;ETA requirement. Military members are exempt. For requirements, application, and fee (after 1 Sep 21) refer to: https: //m.k-eta.go.kr/. DoD Civilians, their eligible family members and eligible military family members on official travel using a US passport must have either a Special Issuance Passport (SIP) or, as a temporary measure, a memorandum from a DoD Passport Agent stating the SIP application was submitted prior to departure from the point of origin. The memorandum must identify each applicant, date of submission, country of travel for PCS/TDY /TAD and DoD Visa Passport Automated System (VPAS) ID. For a limited time, boarding a flight while on official travel status with a Regular (blue tourist) Passport is permissible ONLY with such a memorandum, which is to be presented to boarding officials, upon request. NOTE: This temporary exception, i.e., allowing official travel on a Regular Passport with memorandum (in lieu of a SIP), will expire on 31 March 2022. Effective 1 April 2022, official travel must be conducted with a SIP. Non-US passport users and non-Korean passport users must comply with ROK requirements. These travelers from a third country must verify and coordinate all passport and visa or K-ETA requirements prior to traveling. In many cases a visa must be obtained prior to travel. All travelers entering South Korea, including Korean nationals, are required to submit a negative COVID-19 Polymerase Chain Reaction (PCR) test result. Negative PCR test results must be issued no earlier than 48 hours prior to departure on the international leg.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. If an employee brings a child to an overseas location and that child is entitled to attend a DoD school on a space-required basis in accordance with DoDEA Regulation 1342.13, the DoDEA and the Military Department responsible for providing related services will ensure that the child, if eligible for special education, receives a free appropriate public education, including related services pursuant to DoDI 1342.12 and DoDM 1342.12. If an employee brings an infant or toddler (up to 3 years of age) to an overseas location, and that infant or toddler, but for the child's age, is entitled to attend the DoDEA on a space-required basis in accordance with DoDEA Regulation 1342.13, then the Military Department responsible for EIS will provide the infant or toddler with the required EIS in accordance with the eligibility criteria consistent with DoDI 1342.12 and DoDM 1342.12. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs/Strategic Planning position. The initial length of this overseas tour is 36 months. Defense National Relocation Program will not be authorized. Multiple positions may be filled from this announcement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"USARMY.APG.CHRA-NE.MBX.APPLICANTHELP@MAIL.MIL","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"True","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585167300","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-10XX-SPLASH","PositionTitle":"Information and Arts Family","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585167300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585167300?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Arts And Information","Code":"1001"},{"Name":"Museum Curator","Code":"1015"},{"Name":"Public Affairs","Code":"1035"},{"Name":"Language Specialist","Code":"1040"},{"Name":"Visual Information","Code":"1084"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public","fed-competitive","fed-excepted","disability","land","mspouse","peace","graduates","student","vet"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"633846400","MatchedObjectDescriptor":{"PositionID":"9L-AFPC-11371951-508152-ARN","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/633846400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/633846400?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"HQ USAF and Support Elements","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"This is a Security Cooperation (SC) position due to the nature of the position's duties and responsibilities. Position requires incumbent to attain DoD Security Cooperation Certification in accordance with the National Defense Authorization Act (NDAA) 2017, Title 10 U.S. C., Sect. 384. Incumbent must maintain \"good-standing\" in an appropriate Area of Concentration (AoC) and certification level as determined by supervisor. Employee must meet DoD Security Cooperation Workforce Certification requirements applicable to the duties of the position. Selectee must meet the education and experience requirements for the designated Certification AoC and Certification Level within one year (Basic-level) or two years (Intermediate-level, Advanced-level and Expert-level) from Security Cooperation Workforce Development-Database entry date to become certified in accordance DoD SC Workforce Certification requirements as outlined in the Implementation Guidelines for the DoD SC Workforce Certification Program signed by the Director, DSCA. Incumbent of this position is required to comply with all Department of Defense and Defense Security Cooperation Agency requirements of this certification program. This certification requirement is a condition of employment for this position. Failure to obtain DoD SC certification within the required time may subject the incumbent to adverse action. Incumbent is required to maintain 20 hours of Security Cooperation professional development continuous learning every two-year period to maintain good standing in the DoD Security Cooperation Workforce Certification\nProgram. This position has been designated by the Air Force as a Testing Designated Position (TDP) under the Air Force Civilian Drug Demand Reduction Program. Employee must pass initial and periodic short notice drug testing. Illegal drug use by employees in sensitive positions presents a clear threat to the mission of the Air Force, national security, and public safety. In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: EDUCATION: Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-13, or equivalent in other pay systems. Examples of specialized experience includes extensive knowledge of national security, strategic policy, international relations, foreign affairs, foreign assistance programs, and related fields; knowledge of DAF/USAF/USSF security assistance and foreign military sales programs, US defense alliances, personnel exchange programs, intelligence sharing programs, and US peacekeeping and trade sanction activities; and knowledge of foreign military sales law, principles, and policies, national and international politics, economic, and military operations, sufficient to serve as a technical expert in one or more very broad aspects of foreign military sales or other security assistance programs. Note: You must submit a copy of official transcripts. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-13 level is required to meet the time-in-grade requirements for the GS-14 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Extensive knowledge of foreign affairs and national security policies and objectivities; US defense programs and policies doctrine, strategy, and political-military structures as they pertain to the INDOPACOM region. 2. Extensive knowledge of US foreign policy, legislation/directives, the Arms Export Control Act, (AECA), the Foreign Assistance Act (FAA), and other DoD, Air Force, and Space Force directives/regulations governing the sale of military articles and services to foreign governments. 3. Ability to research and analyze information/situations to provide sound advice and recommendations in support of senior Air Force officials' decision-making. 4. Skill and diplomacy in dealing with senior officials in the Federal Government, industry, and the international community. 5. Ability to communicate effectively, both orally and in writing, to justify, defend, present, advocate, and/or advise on Security Assistance processes, actions, and decisions. 6. Ability to perform work requiring a professional knowledge of the formulation and implementation of foreign policy of the United States in the conduct of the relations, primarily of a political or politico-military nature, of the United States with other governments. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"126233.0","MaximumRange":"164102.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-28T12:18:44.7930","PositionEndDate":"2022-02-11T23:59:59.9970","PublicationStartDate":"2022-01-28T12:18:44.7930","ApplicationCloseDate":"2022-02-11T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to provide analysis and advice to SAF/IA and other senior DAF/USAF/USSF leaders on the political, military, economic, and security assistance aspects of the United States Air/Space Force relations with, and having interests in, the region; provides direction, integration, management, and supervision of international programs.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"14","OrganizationCodes":"DD/AF13","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Oversees USAF political-military affairs with countries and international organizations in the INDOPACOM region. Distributes and balances the workload among employees to ensure timely accomplishments of the assigned tasks. Senior analyst and advisor to SAF/IA, the Chief of Staff of the Air Force, the Chief of Space Operations, the Secretary of the Air Force, and other DAF/USAF/USSF, DoD, JCS, and USG agency and department leadership on activities in the INDOPACOM region. Responsible for developing, coordinating and establishing security assistance programs unique to theater."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 02/11/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11371957 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11371957. Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. Additionally, please do not disclose your vaccination status on your resume. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"634859600","MatchedObjectDescriptor":{"PositionID":"9L-AFPC-11379303-506190-ARN","PositionTitle":"Foreign Affairs Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/634859600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/634859600?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"HQ USAF and Support Elements","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"This position has been designated by the Air Force as a Testing Designated Position (TDP) under the Air Force Civilian Drug Demand Reduction Program. Employee must pass initial and periodic short notice drug testing. Illegal drug use by employees in sensitive positions presents a clear threat to the mission of the Air Force, national security, and public safety. In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: EDUCATION: Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-12, or equivalent in other pay systems. Examples of specialized experience includes expert knowledge in applying qualitative and/or quantitative methods to the development and assessment of Joint strategy, plans, and concepts; comprehensive knowledge of the range of administrative laws, policies, regulations, and precedents applicable to the administration of one or more important public programs and mission, capabilities, strategy, and strategy-making processes; knowledge of relationships with other programs and key administrative support functions within the employing agency or in other agencies; and knowledge of the formulation and implementation of foreign policy of the United States in the conduct of the relations, primarily of a political or politico-economic nature, of the United States with other governments. Note: You must submit a copy of official transcripts. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&#173;grade requirements to be considered eligible. One year at the GS-12 level is required to meet the time-in-grade requirements for the GS-13 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Expert knowledge in applying qualitative and/or quantitative methods to the development and assessment of Joint strategy, plans, and concepts. 2. Comprehensive knowledge of the range of administrative laws, policies, regulations, and precedents applicable to the administration of one or more important public programs and mission, capabilities, strategy, and strategy-making processes. 3. Knowledge of relationships with other programs and key administrative support functions within the employing agency or in other agencies 4. Knowledge of the formulation and implementation of foreign policy of the United States in the conduct of the relations, primarily of a political or politico-economic nature, of the United States with other governments. 5. Skill to plan, organize, and direct team study work and to negotiate effectively with management to accept and implement recommendations, where the proposals involve substantial agency resources, require extensive changes in established procedures, or may be in conflict with the desires of the activity studied. Ability to communicate effectively both orally and in writing, negotiate complex issues, and maintain good working relationships and in reviewing others work for both format and content. 6. Ability to plan, organize, and negotiate effectively with other action officers, senior analysts, and management to accept and implement tasks and to monitor until completion. Ability to provide constructive criticism to ensure a high quality product. Ability to synthesize complex, and often competing, information and viewpoints to determine best course of action and advocate recommendations across the Air Staff and to senior Air Force leaders. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"106823.0","MaximumRange":"138868.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-02T15:09:13.0270","PositionEndDate":"2022-02-16T23:59:59.9970","PublicationStartDate":"2022-02-02T15:09:13.0270","ApplicationCloseDate":"2022-02-16T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to perform the duties of a Foreign Affairs Strategist within the Strategy Development and Application Team (SDAT), AF/A5SS Strategy Division.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"None","OrganizationCodes":"DD/AF13","Relocation":"False","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Performs expert level professional work as a foreign affairs specialist developing and implementing USAF strategy in support of National Defense Strategy by identifying impacts of emerging global and regional pressures such as climate change and changing international relationships on behalf of the SECAF, CSAF and CSO. Maintains a continuous liaison with other Air Staff, OSD, Joint Staff, Services, and other DOD offices to ensure informed decision-making by senior Air Force leadership. Provides documentation to support various strategy and/or process-oriented concepts and issues. Develop Air Force strategies that include how allies and partners contribute to Air Force efforts to meet the National Defense Strategy (NDS) requirements."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 02/16/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11379303 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11379303. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"633065600","MatchedObjectDescriptor":{"PositionID":"9P-AFPC-11368391-487638-EC","PositionTitle":"FOREIGN DISCLOSURE SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/633065600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/633065600?PostingChannelID="],"PositionLocationDisplay":"Randolph AFB, Texas","PositionLocation":[{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Employee must be comfortable in dealing with high ranking foreign representatives, Air Force and DoD senior leadership, and the ability to utilize diplomacy to include an understanding of cultural sensitivity on all occasions. Completion of a Senior Service School, (i.e. AWC, AFIT, EIG, RAND, DSLDP, STRAT I, etc), within four years of accepting the position is highly desirable. This position is designated as a key position IAW AFI 36-507. Duties of this position are essential to the accomplishment of wartime/contingency operations. Incumbents of key positions must be removed from their military recall status if alternative for filling of the position during an emergency are not available. The employee must be able to obtain and maintain a Government Travel Credit Card in order to perform assigned duties. The employee must able to perform multiple long-term (up to 90-days) TDYs at several global locations to attend to training and conferences. In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENTS FOR FOREIGN AFFAIRS SPECIALIST 0130 SERIES: A Bachelor's degree (or higher degree) or a degree with a major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-13, or equivalent in other pay systems. Examples of specialized experience includes: comprehensive mastery/expert level knowledge of the concepts, principles, and practices of NDP-1 and its implementation through the agency Foreign Disclosure Program, as well as thorough knowledge of the program's guiding principles codified in the ITAR; DoD and DoS policies; and agency, Major Command and specific policies, directives and instructions governing the release of CMI and CUI; the establishment and management of various international programs supporting FMS, commercial weapon systems sales, and development and acquisition programs; and establishment and implementation of multinational agreements with foreign governments; extensive knowledge of agency security assistance and foreign military training programs, US defense alliances, personnel exchange programs, US government and commercial international cooperative research and development agreement (CRADA) programs, US country and regional defense policies, and combined exercise programs. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-13 level is required to meet the time-in-grade requirements for the GS-14 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: Expert knowledge of NDP-1, the Arms Export Control Act, and other DoD and Air Force policies, directives, instructions and disclosure principles and how they are applied to issues relating to FMS and commercial exports of defense equipment, technology, information, and assistance. Experience planning, administering, and monitoring conference, visits, travel teams, and other multiple tasks associated a high-ranking international audience. Ability to lead, review complex technical material and approve the disclosure and/or export to foreign entities. Expert/mastery level knowledge of general Air Force and specific foreign disclosure operations, politico-military affairs, Air Force operations, technologies used in military command and control systems, technologies used in military weapons systems, information and industrial security processes for classified material handling, various international airmen assignment procedures and guidance, and general management practices. Expert/mastery level knowledge to plan and implement an Air Force foreign disclosure program, and to understand and work effectively with an industry export compliance program. Ability to effectively write and orally communicate foreign disclosure, export information, and international airmen assignment programs to various audiences, to include U.S. and foreign staff, management, senior executives, and corporate officers. Ability to perform work requiring a professional knowledge of the formulation and direction of foreign affairs of the Government or in the study and disposition of information bearing on international relations. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"112663.0","MaximumRange":"146460.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-26T00:00:00.0000","PositionEndDate":"2022-02-09T23:59:59.9970","PublicationStartDate":"2022-01-26T00:00:00.0000","ApplicationCloseDate":"2022-02-09T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is: Serves as the Division Chief, senior Foreign Disclosure Officer (FDO), and career corporate knowledge expert for foreign disclosure in the Foreign Disclosure Division, Directorate of International Training and Education, at Headquarters Air Education and Training Command (AETC).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Plans, develops, and implements foreign disclosure procedures and provides direction and guidance on assigned international programs to AETC personnel. Reviews visits and re-delegates visits originating from the Foreign Visit System (FVS). Reviews and approves classified and unclassified export controlled documents and information for release and transmission to foreign governments, agencies, and nationals. Directs and approves all aspects of the assignment of foreign Airmen within AETC, including USAF MPEP, CLO, guest instructors, APEP, ESEP, and CPP personnel."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 02/09/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11368391 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11368391. Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. Additionally, please do not disclose your vaccination status on your resume. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"632895200","MatchedObjectDescriptor":{"PositionID":"EUJD215019130824","PositionTitle":"International Relations Specialist (Military Exchange)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/632895200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/632895200?PostingChannelID="],"PositionLocationDisplay":"Wiesbaden, Germany","PositionLocation":[{"LocationName":"Wiesbaden, Germany","CountryCode":"Germany","CityName":"Wiesbaden, Germany","Longitude":8.2423,"Latitude":50.0846}],"OrganizationName":"Immediate Office of the Commander-in-Chief of the U.S. Army","DepartmentName":"Department of the Army","SubAgency":"G-5 Headquarters, International Operations Division","JobCategory":[{"Name":"International Relations","Code":"0131"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Family Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. International Relations Specialist (MILITARY EXCHANGE) GS-11\nSpecialized Experience: one year of specialized experience equivalent to the GS-09 grade level in the Federal service which includes: 1) Assist with the coordination, integration, and implementation of policies, plans and programs; 2) Provide administrative support to personnel, students, and their families; and 3) Track and complete the support requests, exceptions to policy, and administrative actions for programs.\nOR\nEducation: Master's or equivalent graduate degree or 2 full years of progressively higher level graduate education leading to such a degree with a major study in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. (Note: You must attach a copy of your transcripts.)\nOR\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-09). International Relations Specialist (MILITARY EXCHANGE) GS-12\nSpecialized Experience: one year of specialized experience equivalent to the GS-11 grade level in the Federal service which includes: 1) Prepare executive summaries and/or briefings on important military issues, events or anticipated problems to stakeholders; 2) Analyze interrelated issues (personnel, operations, political-economic, logistics and/or intelligence) in order to synchronize activities with staff; and 3) Establishment and negotiation of Memorandums of Agreements (MOA) with partner nations.\nOR\nEducation: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. (Note: You must attach a copy of your transcripts.)\nOR\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11). International Relations Specialist (MILITARY EXCHANGE) GS-13\nSpecialized Experience: one year of specialized experience equivalent to the GS-12 grade level in the Federal service which includes: 1) Ensure program requirements for the military education and selection are in compliance with procedural guidance for operation and participation on a Theater-wide basis; 2) Advise officials on government policy and programs related to bilateral relations, foreign policy, regional politico-military and international security issues; and 3) Preparing project papers and staff reports, and in organizing and delivering briefings to encourage understanding and acceptance of recommendations.\nOR\nEducation: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. (Note: You must attach a copy of your transcripts.)\nOR\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-12). Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--No substitution of education for experience is permitted. You will be evaluated on the basis of your level of competency in the following areas:\nAdministration and ManagementIntegration, Outreach & CollaborationInternational Engagement Assessment & AnalysisProgram Management","PositionRemuneration":[{"MinimumRange":"56983.0","MaximumRange":"105579.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-01T00:00:00.0000","PositionEndDate":"2022-02-14T23:59:59.9970","PublicationStartDate":"2022-02-01T00:00:00.0000","ApplicationCloseDate":"2022-02-14T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: This position is located with the G-5 HQ Directorate, International Operations Division, Military Exchange Program in Wiesbaden, Germany.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"13","PromotionPotential":"13","SubAgencyName":"G-5 Headquarters, International Operations Division","OrganizationCodes":"DD/ARE1","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","land","mspouse","vet"],"TotalOpenings":"FEW","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. Wiesbaden is without a doubt one of the most attractive cities in Germany. The capital city of Hessen is sometimes referred to as \"Nice of the North\" and rightfully so considering the many mansions, the historic Kurhaus, the casino and the State Theater. Wiesbaden has been well known as a great spa city since ancient times. It has 27 hot, saline springs and its mild climate and park-like setting continue to make it a popular resort and conference center. Wiesbaden is a city with an abundance of leisure activities, providing a cosmopolitan atmosphere blended with an attractive cultural ambiance, extraordinary architecture and marked by endearing charm. Wiesbaden, located in one of the premier wine growing areas in Germany, is on the Rhine River only 20 minutes from the Frankfurt International Airport. Efficient mass transportation systems are readily available. Visit the Wiesbaden Army Community website at: www.wiesbaden.army.mil for local garrison support and http://www.wiesbaden.de for city plans and attractions.","TravelCode":"5","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Military Personnel Exchange Program (MPEP/SON) Specialist within the International Operations Division, G5, at Headquarters, United States Army Europe (HQ USAREUR).","Responsible for the coordination, integration, and implementation of policies, plans and programs related to the execution of the USAREUR Military Personnel Exchange Program (MPEP) and the U.S. Army Schools of Other Nations (SON) Program.","Oversees administrative support to the MPEP personnel and SON students and their families."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&eacute;sum&eacute; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&eacute;sum&eacute; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 02/14/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11360824). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. If an employee brings a child to an overseas location and that child is entitled to attend a DoD school on a space-required basis in accordance with DoDEA Regulation 1342.13, the DoDEA and the Military Department responsible for providing related services will ensure that the child, if eligible for special education, receives a free appropriate public education, including related services pursuant to DoDI 1342.12 and DoDM 1342.12. If an employee brings an infant or toddler (up to 3 years of age) to an overseas location, and that infant or toddler, but for the child's age, is entitled to attend the DoDEA on a space-required basis in accordance with DoDEA Regulation 1342.13, then the Military Department responsible for EIS will provide the infant or toddler with the required EIS in accordance with the eligibility criteria consistent with DoDI 1342.12 and DoDM 1342.12. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs and Strategic Planning position. The initial length of this overseas tour is 36 months. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}