{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":20,"SearchResultCountAll":20,"SearchResultItems":[{"MatchedObjectId":"613687400","MatchedObjectDescriptor":{"PositionID":"DE-11227500-21-SRM","PositionTitle":"AUDIT PROGRAM MANAGER","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/613687400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/613687400?PostingChannelID="],"PositionLocationDisplay":"Arlington, Virginia","PositionLocation":[{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051}],"OrganizationName":"U.S. Marine Corps","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"EE"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"5 Years","Code":"15319"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the Mandatory Technical Qualifications will eliminate you from consideration. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 1 page.) 1. Expert knowledge of and highly skilled at translation of financial and property systems knowledge into actual application. 2. Ability to translate complex general and real property concepts into actionable recommendations for MCICOM implementation. 3. Ability to conduct inventory analysis and validation testing, conduct internal valuation testing on capital assets, review annual wall-to-wall inventory, and complete the initial placed-in-service date review and document the review for assets. 4. Expert knowledge of and experience in coordinating to include audit planning, providing policies and processes to the Independent Public Accountant (IPA), and conducting entrance conferences. 5. Expert knowledge of internal controls during the review of Process Cycle Narratives for business processes to determine the amount of substantive testing samples required. 6. Expert knowledge of and experience in ensuring the testing phase account balances are supported by underlying documentation and analysis. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"144128.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-09-10T00:00:00.0000","PositionEndDate":"2021-12-09T23:59:59.9970","PublicationStartDate":"2021-09-10T00:00:00.0000","ApplicationCloseDate":"2021-12-09T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. You will serve as the Audit Program Manager for Marine Corps Installations Command (MCICOM).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV27","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will provide technical expertise to reinforce MCICOM commitment to apply resources to national defense requirements and coordinate and plan the Marine Corps full financial statement audit.","You will support an aggressive level of effort required as Marine Corps undergoes its 5th Full Financial Statement Audit and focus on key supporting documentation and substantive testing to support financial and non-financial business transactions.","You will act as MCICOM's government lead to plan and monitor efforts and complete remediation for its focus areas within two Directorates and among the Regional Commands.","You will coordinate these audits with special expertise due to their scope and complexity. Audit planning includes providing policies and processes to the Independent Public Accountant (IPA) and conducting entrance conferences.","You will oversee the internal control of the review of Process Cycle Narratives for the Command's business processes to determine the amount of substantive testing samples required.","You will ensure the testing phase account balances are supported by underlying documentation and analysis, to include the testing phases of existence testing and completeness testing."],"Education":"","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: charles.e.andrews@usmc.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers.","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. A separate narrative statement is required. Your narrative statement must address the Mandatory Technical Qualifications (MTQs) listed above. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This position is not covered by the Department of Defense Priority Placement Program. Term appointments may be extended up at the discretion of management and in accordance with applicable regulations. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdfHighly Qualified appointments may be extended at the discretion of management and in accordance with applicable regulations. Temporary actions taken under this announcement may be terminated at any time before the established not-to-exceed date. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"charles.e.andrews@usmc.mil","AgencyContactPhone":"571-465-6959","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617817200","MatchedObjectDescriptor":{"PositionID":"DCSA-22-11228545-DISL","PositionTitle":"Senior Advisor, Defense Insider Threat","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617817200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617817200?PostingChannelID="],"PositionLocationDisplay":"Arlington, Virginia","PositionLocation":[{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051}],"OrganizationName":"Defense Counterintelligence and Security Agency","DepartmentName":"Department of Defense","SubAgency":"Threat and Counterintelligence","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"TECHNICAL QUALIFICATIONS (TQ): All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. Please limit your written statements to not exceed 2 pages per technical qualification. Expert knowledge of the principles, theories, risk reduction methods, and concepts that govern the field of Counter Insider Threat. Broad knowledge of enterprise program management (professionalization efforts, training, analytic support, acquisition, etc). Broad knowledge of intelligence and/or insider threat tradecraft, operations, analyst tools, and mitigation.","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-19T11:39:43.5970","PositionEndDate":"2021-11-18T23:59:59.9970","PublicationStartDate":"2021-10-19T11:39:43.5970","ApplicationCloseDate":"2021-11-18T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Defense Counterintelligence and Security Agency (DCSA) is a separate Agency of the Department of Defense (DoD) under the direction, authority, and control of the Under Secretary of Defense for Intelligence and Security (USD (I&amp;S)). This position is located in the Office of Threat and Counterintelligence and reports to the Assistant Director, Threat Directorate.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","SubAgencyName":"Threat and Counterintelligence","OrganizationCodes":"DD/DD12","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"DCSA Mission Statement:\nThrough vetting, industry engagement, counterintelligence support, and education, secure the trustworthiness of the United States Government's\nworkforce, the integrity of its cleared contractor support, and the uncompromised nature of its technologies, services, and supply chains. http://www.dcsa.mil","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As the Senior Advisor, Defense Insider Threat, you will: Advise, coordinate, plan, organize, and help provide an enterprise-level capability for insider threat information management across the military services and Defense agencies, covering all cleared and un-cleared civilians, contractors, active duty, and other personnel with access to DoD facilities, personnel, assets, and information. Provide technical advice assuring the maximum possible security of information through recommendation and development of Insider Threat Management and Analysis policies. Advise on agency level guidelines and international responsibilities regarding cleared U.S. company involvement with foreign governments, foreign contractors, and NATO as the Cognizant Security Agency. Serves as Chief, DITMAC ensuring all responsibilities, specifically, the broad scope of insider threat analysis, are performed in accordance with its charter. Develop risk threshold standards for actions and compile results to evaluate actions or threats insiders may pose to their colleagues and/or DoD missions and resources; establish standards to ensure DoD's Insider Threat Program is compliant with applicable Executive Orders/DoD regulations; and fulfill certain requirements of National Insider Threat policy and minimum standards; Assure that a single repository for DoD Insider Threat related information exists; and promote collaboration and information sharing on insider threats to DoD personnel and facilities."],"Education":"This position does not have a positive education requirement.","Requirements":"","Evaluations":"DCSA is undergoing a multi-year transformation that includes a significant expansion of predecessor agencies' authorities and responsibilities. Mission accretion and associated growth in personnel and resources requires deliberate coordination and planning across operations and support activities to achieve effective outcomes while simultaneously establishing and integrating new activities, initiatives and projects. The new organization will be comprised of nearly 13,000 government and contractor personnel operation throughout the United States and overseas supporting stakeholders across the federal government. We will review your resume and supporting documents, for the quality and extent of your total accomplishments, experience and education as it relates to the fundamental competencies required for this position. Your application will be evaluated by a rating and ranking panel, and highly qualified candidates may undergo an interview and a reference check process. Experience: Your experience refers to paid and unpaid experience, including volunteer work done through National Service program (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","HowToApply":"To apply for this position, you must provide a complete Application Package as described in Required Documents section. Click 'Apply Online' to create an account or log in to your existing USAJOBS account. 1. Follow the prompts to upload required documents.\n2. Applications must be received by the closing date of the announcement to receive consideration. To review the status of an application through USAJOBS: 1. Log into your USAJOBS account\n2. Click Application Status within your profile to expand your application\n3. Locate the job announcement and click the more information link under the Status column for this position. You will be routed to Application Manager. The Details tab displays by default. The Details tab displays comprehensive information about the selected Application Package including: supporting documents and their status, correspondence sent to you by the hiring agency, and your application processing status. Please review the General Application Information and Definitions at:\nhttp://www.dla.mil/Portals/104/Documents/Careers/downloads/DoDGenAppInfo.pdf","WhatToExpectNext":"Once you successfully complete the application process, you will receive a notification of receipt. Your application package will be reviewed to ensure you meet the basic eligibility and qualifications requirements, and you will receive a notification. A review will be made of the documentation you submitted to support your responses. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision. REGARDING INTERVIEWS: Interviews may be required for this position. Accommodations may be made to conduct telephonic interviews to preclude travel hardships for applicants. Note: Declining to be interviewed or failure to report for a scheduled interview will be considered as a declination for further consideration for employment against this vacancy. The Defense Counterintelligence Security Agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the point of contact for this job announcement. Your requests for reasonable accommodation will be addressed on a case-by-case basis.","RequiredDocuments":"To apply for this position, you must provide a complete application package which includes: 1. Resume - Your Resume listing your name, contact information, work schedule, hours worked per week, dates of employment and duties performed. If multiple resumes are submitted by an applicant, only the last resume submitted will be referred for consideration. 2. Technical Qualifications - Completed supplemental narrative in a separate document that gives specific examples of work experiences addressing each technical qualification. Your narrative should be no more than 2 pages for each technical qualification. 3. Standard Form (SF) 50 -, Notification of Personnel Action (if applicable)- If you are a current or former Federal civilian employee you must submit your last or most recent SF-50 showing grade and tenure. 4. Veteran's Documents -: If applying using veteran's preference you must submit the following documents:- DD214 showing character of service (SERVICE-2 OR MEMBER-4) or Statement of Service that includes a character of service, and if claiming Disabled Veteran preference you must also submit an SF-15 Form and VA letter AB-4 showing final percentage. 5. Joint Duty Credit Information - If selected, additional documentation may be required prior to appointment. DO NOT submit additional information (i.e. cover letters, awards, appraisals, pages in excess of the page limit for technical qualifications.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID19 - All Federal Employees must be fully vaccinated by November 22, 2021. Proof of vaccination will be required. To ensure compliance with this mandate, please review the vaccination requirements, to include timelines for receiving required doses, at the following: https://www.saferfederalworkforce.gov/faq/vaccinations/ Please review the General Application Information and Definitions at:\nhttp://www.dla.mil/Portals/104/Documents/Careers/downloads/DoDGenAppinfo.pdf Other Notes: If selected, Federal employees currently serving in the competitive service must acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS excepted service positions. If selected, non-DCIPS candidates must acknowledge in writing that the position they have been selected for is in the excepted service and covered by DCIPS. Selection under this appointment authority does not confer civil service competitive status. All current and former Federal employees must submit a copy of your latest SF-50 (Notification of Personnel Action) showing your tenure, grade and step, and type of position occupied (i.e., Excepted or Competitive); or similar Notification of Personnel Action documentation, i.e., Transcript of Service, Form 1150, etc. Joint Duty Credit: All DCSA executive level positions require Joint Duty Credit. Only those candidates who meet the Joint Duty Credit requirement will be eligible to compete/be considered for a senior executive position. Employees will receive joint duty credit for many almost any rotational assignments assignment to another IC component and may also be eligible to receive credit for service outside the IC (military, other government, or private sector) that was at least at the GS/GG-1113 or DCIPS Pay Band 3 level, that and it occurred after September 11, 2001. An external candidate, if selected, will be required to immediately apply for Joint Duty credit. Note: Employees without Joint Duty Credit may apply for the position and can be considered. If selected, a waiver would be required prior to final appointment. DCSA seniors without Joint Duty at the same tier level may lateral into the position if selected without requesting a waiver.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"maria.i.mendoza7.civ@mail.mil","AgencyContactPhone":"(571) 305-6353","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"620728200","MatchedObjectDescriptor":{"PositionID":"ST-11285786-22-SRM","PositionTitle":"ELECTRICIAN SUPERVISOR II","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/620728200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/620728200?PostingChannelID="],"PositionLocationDisplay":"Bremerton, Washington","PositionLocation":[{"LocationName":"Bremerton, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Bremerton, Washington","Longitude":-122.6257,"Latitude":47.565002}],"OrganizationName":"U.S. Pacific Fleet","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Electrician","Code":"2805"}],"JobGrade":[{"Code":"WS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Although a specific length of time and experience is not required for most trade and labor occupations, you must show through experience and training that you possess the quality level of knowledge and skill necessary to perform the duties of the position at the level for which you are applying. Qualification requirements emphasis is on quality of experience, not necessarily the length of time. Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the job elements and screen out listed below. This job has a screen-out element which will be used to determine minimum eligibility for this job. Applicants who do not receive a minimum of two points on the screen-out element(s) will be found ineligible. The Screen-out Element for this position is: ABILITY TO SUPERVISE THROUGH SUBORDINATE SUPERVISORS. Applicants must meet the requirements of the Office of Personnel Management (OPM) Job Qualification Handbook for Trades and Labor Occupations. Additional qualification information can be found at: https://www.opm.gov/policy-data-oversight/classification-qualifications/federal-wage-system-qualifications/#url=List-of-Approved-Job-Elements Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"43.56","MaximumRange":"50.8","RateIntervalCode":"Per Hour"}],"PositionStartDate":"2021-11-08T00:00:00.0000","PositionEndDate":"2021-11-15T23:59:59.9970","PublicationStartDate":"2021-11-08T00:00:00.0000","ApplicationCloseDate":"2021-11-15T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as a ELECTRICIAN SUPERVISOR II in the PRODUCTION DEPARTMENT of PSNS and IMF.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"14","OrganizationCodes":"DD/NV70","Relocation":"False","HiringPath":["fed-transition","fed-internal-search","land","mspouse","ses","vet"],"TotalOpenings":"2","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will plan work assignments on an immediate and long range basis.","You will determine manpower.","You will analyze work schedules, assignments, productions costs, methods of operation.","You will assign and explain work to subordinate supervisors.","You will schedule leave, rate subordinate supervisors on performance and review recommendations for disciplinary action, promotions, awards, and training.","You will manage and direct work in a specific portion of a ship overhaul.","You will establish priorities and work sequences.","You will study continuing problems and take or recommend corrective action."],"Education":"","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities, to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities, as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. When the application process is complete, we will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this announcement. You will be rated based on the information provided in your resume and responses to the Occupational Questionnaire, along with your supporting documentation to determine your ability to demonstrate the following job elements: ABILITY TO MEET DEADLINE DATES UNDER PRESSUREABILITY TO PLAN AND ORGANIZE THE WORKABILITY TO SUPERVISE THROUGH SUBORDINATE SUPERVISORSABILITY TO WORK WITH OTHERSINGENUITY (ABILITY TO SUGGEST AND APPLY NEW METHODS) You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, your score may be adjusted to more accurately reflect your abilities or you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All eligibility, qualifications, and time-in-grade requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. 2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11285786\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 11/15/2021. Applications received after 11/15/2021 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. NOTE: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made. NOTE: Due to COVID19, if you have any questions or need assistance, please email the DON Employment Information Center at DONEIC@navy.mil","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This position is covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Pay retention may be granted when certain conditions are met. This position is subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required. If you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf ICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher. ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DONEIC@navy.mil","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"621625900","MatchedObjectDescriptor":{"PositionID":"PACOM-120329-01-SEMO","PositionTitle":"SDIA FOR CHINA INDO-PACOM","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/621625900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/621625900?PostingChannelID="],"PositionLocationDisplay":"Camp H.M. Smith Marine Corp Base, Hawaii","PositionLocation":[{"LocationName":"Camp H.M. Smith Marine Corp Base, Hawaii","CountryCode":"United States","CountrySubDivisionCode":"Hawaii","CityName":"Camp H.M. Smith Marine Corp Base, Hawaii","Longitude":-157.9064,"Latitude":21.38583}],"OrganizationName":"Defense Intelligence Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Intelligence","Code":"0132"}],"JobGrade":[{"Code":"SL"}],"PositionSchedule":[{"Name":"Full Time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"If you are viewing this announcement via USAJobs, please visit www.DIA.MIL to view this announcement and specific qualification requirements. Executive Core Qualification factors Intelligence Community Senior Officer Core Qualification factors Technical Qualification factors","PositionRemuneration":[{"MinimumRange":"132552.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-11-05T00:00:00.0000","PositionEndDate":"2021-12-07T23:59:59.9970","PublicationStartDate":"2021-11-05T00:00:00.0000","ApplicationCloseDate":"2021-12-07T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"We are committed to: Teamwork: Partnering at all levels and across organizational boundaries for mission accomplishment. Integrity: Adherence to the highest legal and ethical principles in our responsibilities. Excellence: Unrivaled defense intelligence expertise. Service: Putting the welfare of the Nation and commitment to our mission before oneself.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"0","OrganizationCodes":"DD/DD05","Relocation":"False","HiringPath":["public","vet","ses","nguard"],"AgencyMarketingStatement":"","TravelCode":"-1","MajorDuties":["DIA employs a variety of professionals who serve throughout the workforce to ensure successful operations. To view this position’s duties, click Vacancies to be directed to DIA’s online application system. Please make note of the position title and 6-digit Job Opening ID number to which you are interested. You can scroll to the bottom of the page to locate the announcement or click on the “Advanced Search” link and enter in the 6-digit Job Opening ID number in the “Job Opening ID” field."],"Education":"","Requirements":"All applicants must be U.S. citizens and are subject to a thorough background inquiry.","Evaluations":"All applicants must submit a resume and responses to the technical qualifications per the application instruction provided. Applications received which do not include the above information will not be considered. Applications received after the close out date will not be considered.","HowToApply":"DO NOT APPLY FOR THIS JOB ON-LINE.If you are viewing this announcement via USA Jobs, please visit www.dia.mil/careers to view this announcement and specific qualification requirements.Follow the instructions, below.All applicants are required to submit a résumé. Format is at your discretion, but must include: full name, address, and telephone numbers and/or email address where you can be reached. In addition to providing a current résumé, all applicants must prepare and submit a Supplemental Narrative Statement describing in sufficient detail the experience, education, and accomplishments that have provided them the skills and knowledge required in the IC SOCQs, and technical qualification areas above. Incomplete application packages will not be considered. Applications will be no longer than 25 pages to include the resume.We provide reasonable accommodations to applicants with disabilities, where appropriate. If you need a reasonable accommodation for any part of the application or hiring process, please notify us at the address below. The decision on granting an accommodation will be on a case-by-case basis.HOW TO SUBMIT YOUR APPLICATION:Résumé and Supplemental Narrative Statement, and any attachments, should be in MS Word, Adobe Acrobat or similar file formats.We recommend you submit your application via e-mail to avoid possible mail delays. Submit unclassified applications to diasemovacancies@dodiis.mil and Angela.Miller@dodiis.mil.DIA Interagency Distribution - DIA employees may send applications via interagency distribution tothe Senior Executive Management Office, SEMO, (Ms. Miller), DIAC.If none of the above methods are available, you may mail your application to:Defense Intelligence AgencySenior Executive Management Office (Attn: SEMO, DIAC, Ms. Miller)Building 6000 Joint Base Anacostia-Bolling, Washington, D.C. 20340-5100.NOTE: Use of postage paid Government agency envelopes to file job applications is a violation of Federal law and regulation. Applications received in government franked envelopes will not beconsidered. Please send only one application by one of the methods above. Applications and any supporting materials you submit will not be returned.REGARDLESS OF WHICH TRANSMISSION METHOD YOU USE, YOUR APPLICATION MUST BE RECEIVED IN THE SENIOR EXECUTIVE MANAGEMENT OFFICE BY MIDNIGHT ON THE CLOSING DATE STATED ON THIS VACANCY ANNOUNCEMENT.","WhatToExpectNext":"We will notify you when your application has been received. You will also be notified if DIA is, or is not, interested in you as a potential employee of our agency.","RequiredDocuments":"Supplementary Narrative Statement Current non-DIA Federal Civilian Employees must submit a copy of your last SF-50, Notification of Personnel Action.","Benefits":"Please visit our web site, www.dia.mil. Under the \"Careers\" heading on our web site, you will find a listing of benefits available to DIA employees.","BenefitsUrl":"http://www.dia.mil/careers/benefits","OtherInformation":"Privacy Act Statement:The National Security Act of 1947, as amended, (50 U.S.C. 401 et seq.) 10 U.S.C. 113, 5 U.S.C. 301, 44 U.S.C. 3102, and E.O. 9397 (SSN), authorizes collection of the requested information. The information is collected to evaluate individuals for specific employment opportunities. In addition to those disclosures generally permitted under 5 U.S.C. 552a(b) of the Privacy Act, these records or information contained therein may specifically be disclosed outside the Department of Defense as a routine use pursuant to 5 U.S.C. 552a(b)(3) as follows:The DoD 'Blanket Routine Uses' set forth at the beginning of the Defense Intelligence Agency's compilation of systems of records notices apply to this system.Information is requested on a voluntary basis, failure to provide information may delay the employment process.AuthorityThis position is a Defense Intelligence Senior Level (DISL) position. DIA has the authority to establish and staff these positions through PL 104-201. Citizenship, Background Investigations and Pre-Employment Screening/Agreement All DISL candidates must be U.S. citizens able to obtain a Top Secret clearance and are subject to a thorough background inquiry. Information obtained during this inquiry will be considered in the selection decision. Selectees for DISL positions are also subject to mandatory testing for illegal drug use prior to appointment, and may be subject to polygraph examinations. DISL employees will sign an agreement not to disclose, in any fashion, classified information to unauthorized persons. Probationary PeriodApplicants selected for this position must successfully complete a one-year probationary period in conjunction with the appointment at the DISL level. (Applicants selected from outside DIA are also subject to the completion of an additional one-year probationary period [two years total] associated with their initial appointment to the Agency.) Mobility and DeploymentOrganizational, functional and geographical mobility is highly desirable for senior civilians. It can add breadth and depth to the member’s experience along with greater challenges and responsibilities. All DIA employees are subject to world-wide deployment to crisis situations and may be required to serve anywhere in the world. Direct Deposit Applicants selected for this position must enroll in the DoD Direct Deposit/Electronic Transfer of Pay Program. Required DisclosureThis position is covered under the Ethics in Government Act of 1978 (P.L. 95-521). Incumbents of this position will be required to file an Executive Branch Public Financial Disclosure Report (SF-278) with the DIA Office of General Counsel.Merit Selection Principles and Non-DiscriminationDIA will consider all DISL candidates without regard to race, color, creed, religion, gender, national origin, age, marital status, sexual orientation, political affiliation, physical or mental disability or any other non-merit factors. Selection will be based solely upon merit and qualifications. The filling of DISL positions is not subject to automatic assignment registration programs such as the DoD Priority Placement Program.","KeyRequirements":["- U.S. Citizenship   - Drug Test   - Security Investigation"],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactPhone":"Commercial Phone: 301-619-3165","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"620208600","MatchedObjectDescriptor":{"PositionID":"S1L-2021-47","PositionTitle":"Technical Advisor - Space Security Defense Program","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/620208600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/620208600?PostingChannelID="],"PositionLocationDisplay":"Colorado Springs, Colorado","PositionLocation":[{"LocationName":"Colorado Springs, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Colorado Springs, Colorado","Longitude":-104.82173,"Latitude":38.83311}],"OrganizationName":"United States Space Force Forces","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Engineering","Code":"0801"}],"JobGrade":[{"Code":"SL"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"This is a Critical Acquisition Position (CAP) and has been designated as a Key Leadership Position which carries significant responsibility, primarily involving supervisory or managerial duties in acquisition. A 3-year tenure agreement is required for the position. The incumbent must meet the\nDefense Acquisition Workforce Improvement Act (DAWIA) requirements cited below, unless a waiver is granted by the AF Senior Acquisition Executive (SAE). a. Level III certification in Systems Planning, Research, Development, and Engineering (SPRDE) or Program Management (PM), or can be obtained within 24 months.\nb. 10 years of acquisition experience or equivalent, 4 of which were in a CAP or equivalent position. QUALIFICATIONS: Eligibility will be based upon a clear showing the applicant has training, education and experience of the scope and quality sufficient to effectively carry-out the duties of the position. Candidates must exemplify the corporate perspective, leadership vision, broad experience and character needed in the Civilian Senior Executive Service corps not only to satisfy the immediate vacancy, but future vacancies which will occur in a variety of organizations, functions and locations. A. SPECIALIZED EXPERIENCE: Candidates must have one year (1) specialized experience at the next lower grade (GS-15/GG-15/Pay Band 4/5) or equivalent or specialized experience obtained in the private sector related to the duties of this SL position. B. MANDATORY TECHNICAL QUALIFICATIONS (TQs): A supplemental statement must be submitted separately addressing each TQ (not to exceed (four (4) pages total). TQs must provide specific examples that address relevant experience and accomplishments. Applicants should focus on recent experience, education, and training, as some Recruitment Panel members may consider experience that's over 10 years old to be outdated. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: 1. Demonstrated experience applying sound engineering practices in the development of comprehensive threat projections and vulnerability assessments. 2. Extensive knowledge of space protection strategy, policy, and funding, including Intelligence Community (IC) equities. C. SENIOR PROFESSIONAL QUALIFICATIONS: Applicants should focus on recent experience, education, and training, as some Recruitment Panel and Executive Resources Board members may consider experience that's over 10 years old to be outdated. Supplemental statement (three (3) pages max) addressing the following: 1. Contributions: This position will apply significant influence within Space Security and Defense Program as the program office and center of excellence on options and strategies (material, nonmaterial, cross-title, cross-domain leading to a more resilient National Security Space (NSS) Enterprise. SSDP activities center on finding solutions to current space protection needs, with a common sense approach to balancing near term results with long-term acquisition architectures, integrated intelligence and strategic activities. 2. Leadership: Must have the ability to analyze and integrate extremely complex technological programs and to continually motivate a diverse group of professional scientists and engineers. 3. Professional Stature: Nationally and internationally recognized standing as indicated by memberships and activity in professional organizations and/or within the larger DoD/Industry professional community. This includes citations, honors, awards, patents, and publications and other forms of recognition, such as requests for professional consultation, which indicate acceptance by peer group as an authoritative source in the field.","PositionRemuneration":[{"MinimumRange":"132552.0","MaximumRange":"199300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-11-02T15:23:51.8200","PositionEndDate":"2021-11-19T23:59:59.9970","PublicationStartDate":"2021-11-02T15:23:51.8200","ApplicationCloseDate":"2021-11-19T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. Serves as the primary technical and programmatic advisor to the Director, Space Security and Defense Program in the development of materiel & non-materiel solutions. As a recognized executive of a major program office with national scope and interest, the incumbent plays a substantive role in the refinement of space protection strategy, policy, and funding for OSD & ODNI.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/AF6F","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses","public","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"Codified in Title 10 USC, the FY2020 National Defense Authorization Act (NDAA) established the United States Space Force (USSF) as an armed service within the Department of the Air Force. The USSF organizes, trains, and equips forces and develops concepts, doctrine, tactics, techniques, and procedures to ensure freedom of operation in, from, and to the space domain. LOCATION: The Space Security and Defense Program (SSDP) is located in both Colorado Springs, Colorado and Reston, Virginia. However, the incumbent will work primarily in Colorado Springs, Colorado. SALARY: $132,552 - $199,300 per annum. Recruitment/Relocation Bonus and Moving Expenses may be authorized. This is a Senior Level (SL) Competitive Service position and is assigned a precedence priority code of DV-6 (equivalent to a Brigadier General) for protocol purposes. AREA OF CONSIDERATION: Applications will be accepted from current and former, career or career-conditional, permanent competitive service employees and Veterans Employment Opportunity Act (VEOA) eligibles. Consideration will be extended without discrimination for any non-merit reason such as race, color, religion, gender, national origin, political affiliation, marital status, age, membership or non-membership in any employee organization, or disability.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["1. The Technical Advisor influences and coordinates the individual and collective efforts of a multi-disciplined staff of military, civilian, and contractors to develop vulnerability assessments, mitigation strategies and architecture evaluations involving critical and complex efforts of national scope, interest, and significance. Shares a full range of responsibilities concerning SSDP-assigned missions and D/SSDP objectives by applying intelligence, programmatic, and technical expertise to OSD and ODNI, civil, commercial and international space protection programs and strategies, as directed. As necessary, leads or actively supports the development, implementation, integration and analysis of space protection activities for direct actions as well as exercises. Ensures SSDP supporting staff works collaboratively with all primary participants to properly addressed SSDP-assigned missions and D/SSDP objectives. Recommends and assists with revisions to the plan while supporting investigation of emergent issues of interest to the chain of command. Represents the SSDP office at higher levels, as necessary. 2. Demonstrates ability to lead and facilitate collaborative discussions among operational, intelligence, scientific, technical and program specialists, to solicit and synthesize information relevant to defining the overall space protection scenario, including threats and solutions. Interfaces with senior National Security Space (NSS) enterprise requirement, acquisition, operations, and policy leads to advocate for and ensure \"protection\" standards, methodologies and measures are understood and applied. Facilitates Joint/Combined discussion and resolution of strategic and technical concerns by applying analytical expertise and programmatic knowledge identifies, evaluates and recommends implementation of strategies and solutions; and ensures resulting strategies and solutions represent current understanding of projected threats, including information derived from detailed discussions with other intelligence scientific, technical and program specialists. 3. Works with a broad range of Intelligence Community (IC) partners to obtain foundational-level intelligence collection and analysis for the benefit of SSDP efforts. Must formulate collection and analysis priorities for each effort and work with the IC to implement. At SSDP effort completion, helps develop operational-level intelligence collection strategies to support transition of materiel and nonmaterial solutions into the operational community. Assists division leads with project definition and development. Identifies tasks, required resources, dependencies, schedules, and deliverables required to successfully complete tasks. Provides program management oversight to tasks in support of the D/SSDP as necessary. Ensures commitments and deliverables in the Annual Work Plan are delivered on schedule and cost. Applies sound engineering practices in the development of comprehensive threat projections and vulnerability assessments. Assesses the data, analytical methodologies, assumptions, and conclusions of both vulnerability and mitigation strategies to ensure they are sound and represent reasonable engineering judgment."],"Education":"For 0800, General Engineering Series:\na. A professional engineering degree from an accredited institution is required. To be acceptable, the curriculum must: (1) be in a school of engineering with at least one curriculum accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics.\n-OR-\nb. A combination of education and experience as required by the U.S. Office of Personnel Management (OPM). Acceptable combinations of education and experience can be found at: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/general-engineering-series-0801/. Additionally, a master's degree in engineering is highly desired.","Requirements":"","Evaluations":"Applications will be evaluated against the foregoing qualification requirements. Failure to meet any one of the mandatory technical or senior professional qualification standards will eliminate a candidate from further consideration. A screening panel will evaluate the candidates for this position composed of a diverse mix of senior executives selected for organizational and/or functional backgrounds relevant to this position. The panel members will individually review each of the applications in terms of the qualifications criteria contained in this announcement. The qualifications stated are the minimum requirements of the position to be Qualified, a rating schedule will be applied by a screening panel to determine which candidates are considered to be Best Qualified. Then, they will meet to discuss each application, and reach a consensus decision as to the best qualified, qualified or not qualified candidates. The panel will interview all of the best-qualified candidates based upon consistently applied criteria. The panel will then make a recommendation of those best-qualified candidates who should be referred to the selecting official, in priority order. Final selection of a candidate is contingent upon Under Secretary of the Air Force approval.","HowToApply":"Please follow the below instructions to submit applications. Any applications received that do not include all of the required documents or do not meet format requirements will not be forwarded for consideration. The complete Application Package must be submitted by 11:59 PM (ET) on November 19, 2021. To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant. RESUME FORMAT: (Limit 5 pages/Times New Roman 12-font) (Do Not Use the USAJOBS Resume Builder) - Please submit a typewritten resume (upload as a PDF), including the following information: Job Information: Announcement number (S1L-2021-47) and title of the position to which you are applying. Personal Information: Full name, mailing address (with zip code), day and evening phone numbers (with area code) and complete e-mail address where you would like to receive correspondence regarding your application. **PLEASE DO NOT INCLUDE SOCIAL SECURITY NUMBER** Active-Duty/Retired Military: State highest rank held, date of promotion and date eligible to retire or date of retirement. (e.g., Colonel/June 2006/December 2014). NOTE: IAW 5 U.S.C. 3326, a 180-day waiver will be required for retired or retiring members of the armed forces during the period of 180 days immediately after retirement. Education: Educational information, including the name, city and state of colleges or universities you attended, as well as the type and year of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www.ed.gov/admins/finaid/accred/index.html Work Experience: Give the following information for your paid and non-paid work experience related to the job for which you are applying: (Do not send job descriptions).\n- Starting and ending dates (month and year)\n- Job title (for government position, include civilian series and grade or military rank)\n- Employer's name and address\n- Supervisor's name and phone number, please indicate if we may contact your current supervisor\n- Salary (current)\n*Applicants should focus on recency of experience, as hiring officials may consider experience over 10 years outdated. References (optional): Provide the names, addresses, and telephone numbers of three individuals who can comment on your qualifications for this position. Please do not list supervisors already listed above. This agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application or hiring process, please notify this office. The decision on granting reasonable accommodations will be on a case-by-case basis. AF/A1LS CONTACT INFORMATION: Questions regarding this announcement may be directed to Robb Levin at Robb.Levin@spaceforce.mil","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"To receive full consideration, each applicant must submit the documents in the format as designated. Packages that do not include all of the required documents or meet format requirements will not be forwarded for consideration. **************ALL DOCUMENTS MUST BE UPLOADED IN PDF FORMAT******************* The Qualifications Documents must be formatted using Times New Roman, size 12 font, with 1-inch margins. Do not use borders, provide photos, or list a Social Security Number on any of the Qualifications Documents. DO NOT COMBINE DOCUMENTS. A. Resume in the indicated format in How To Apply section below (limit five (5) pages).\nB. Mandatory Technical Qualifications Statement addressing each of the TQs (limit four (4) pages total).\nC. Senior Professional Qualifications briefly addressing all three factors (limit three (3) pages).\nD. College transcript(s) (copy is acceptable) that demonstrates the acceptable combinations of education and experience as noted by OPM and required for this occupational series.\nE. (Optional): Current or former federal employees only. Documentation to verify eligibility to apply for this position is required. Most recent Notification of Personnel Action, SF-50, noting your current position, grade level and salary level.\nF. (Optional): Race and National Origin Identification, SF-181 -- Form available at www.opm.gov\nG. (Optional): Self-Identification of Handicap, SF-256 -- Form available at www.opm.gov\nH. (Optional): Military (retired), a copy of your DD-214 and/or retirement orders. Documents are required, if applicable. DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as copies of position descriptions, award certificates, and transmittal letters will not be forwarded for review.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Education: A professional engineering degree from an accredited institution is required. Additionally, a master's degree in engineering is highly desired. Veterans' Preference: Veterans' preference is applicable to Department of Air Force Senior Level (SL) positions. Relocation Authorized: Payment of Permanent Change of Station (PCS) costs is authorized in accordance with the Joint Travel Regulations (JTR). Recruitment/Relocation Incentive: May be offered. Direct Deposit: All federal employees are required to have direct deposit. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities please click here. Subsequently, FTR Bulletin 20-04 issued by GSA, provides further information regarding NDAA FY2020, Public Law 116-92, and the expansion of eligibility beyond \"transferred\" for WTA/RITA allowances. For additional information, please click here. If you have questions regarding this announcement and have hearing or speech difficulties click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"robb.levin@us.af.mil","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617114900","MatchedObjectDescriptor":{"PositionID":"1171236","PositionTitle":"Capabilities Development Specialist - Entry/Experienced Level","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617114900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617114900?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Computer Science","Code":"1550"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $73,076 - $91,057 (Entry/Developmental) NSA-MD locationSalary Range: $84,529 - $113,362 (Full Performance) NSA-MD locationSalary Range: $103,690 - $159,286 (Senior) NSA-MD locationSalary Range: $144,128 - $172,500 (Expert) NSA-MD location\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nDegree must be in Computer Science (CS) or related field (e.g., Computer Engineering, Software Engineering, Systems Engineering, Mathematics, Physics, Electrical Engineering, Mechanical Engineering, Computer Security, Computer Forensics, Network Engineering). Degrees in Information Technology, Information Systems, Information Security, Networking (Systems Administration), and Information Assurance may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and upper-level mathematics (for example, calculus, discrete mathematics).","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"172500.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-11T00:00:00.0000","PositionEndDate":"2021-11-11T23:59:59.9970","PublicationStartDate":"2021-10-11T00:00:00.0000","ApplicationCloseDate":"2021-11-11T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Do you have skills in computer science and seek a higher calling? Do your hobbies include building robots, computers, or innovating solutions? Do you possess a strong grasp on low-level development principles surrounding hardware, software, and networking?\nIf so, join the nation's high-priority mission as a capabilities development specialist (CDS).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"15","PromotionPotential":"15","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15153","MajorDuties":["As a CDS, you will apply your expertise in computer science and engineering to develop offensive and defensive technical solutions to solve critical technical challenges for the NSA. CDS' conduct innovative research to target computer security vulnerabilities and develop new approaches to computer network attack, exploitation, and defense. Apply your passion for knowledge and unique abilities to make a significant impact on the protection of the nation and its citizens.\nJob roles may include:- Developing exploitation capabilities and analytics to enable foreign target network collection- Designing hardware components and systems to further signals intelligence missions- Analyzing sophisticated malware"],"Education":"Entry is with a Bachelor's degree plus relevant experience, or a Master's degree plus relevant experience or a Doctoral degree and no experience. A high school diploma, GED, or an Associate's degree plus relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSee qualifications section for type of relevant experience and number of years of relevant experience that is needed to qualify.","Requirements":"The ideal candidate is someone with a desire for continual learning and who holds knowledge, skill in experience in one or more of the following:- Programming in languages such as C, C++, and/or Java, especially in kernel development and device driver development, network/socket programming, and embedded systems development- Scripting languages (e.g., Python, Perl, or Ruby)- Assembly language(s)- Hardware design (e.g., FPGA, VHDL, Verilog, PCB)- RF system design (e.g., DSP, SDR)- Software reverse engineering/interactive debugging tools (e.g., Ghidra, Ollydbg, gdb)- Hardware analysis tools (e.g., JTAG, Oscilloscopes)- Software vulnerability analysis and exploitation- Protocol and network analyzers (e.g., Wireshark, tcpdump)- Computer networking (e.g., communication protocols, routing and switching)\nRelevant experience must be in engineering hardware and/or software over their lifecycle (i.e., requirements analysis, design, development, implementation, testing, integration, deployment/installation, and maintenance), programming, vulnerability analysis, penetration testing, computer forensics, and/or systems engineering. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).","Evaluations":"***PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1171236.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"Please attach an unofficial copy of your transcripts when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a CS/CE degree OR a degree that demonstrates a concentration of CS coursework. For example, degrees in Computer Networking, Information Science, Information Systems, Information Technology, Information Security, Information Assurance, Cyber Security, and Digital Forensics MAY be considered for this position IF your coursework/transcripts demonstrate a concentration of CS coursework. Foundational CS coursework includes the following courses: Computer Architecture, Programming Languages, Data Structures, and Algorithms.\nIf you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"On-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617115100","MatchedObjectDescriptor":{"PositionID":"1171224","PositionTitle":"Computer Scientist - Development Programs - Entry/ Mid-Level","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617115100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617115100?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Computer Science","Code":"1550"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $73,076 - $91,057 (Entry/Developmental) - Entry is with a Bachelor's degree and no experience. An Associate's degree plus 2 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $84,529 - $113,362 (Full Performance) - Entry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"113362.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-11T00:00:00.0000","PositionEndDate":"2021-11-11T23:59:59.9970","PublicationStartDate":"2021-10-11T00:00:00.0000","ApplicationCloseDate":"2021-11-11T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"NSA's development programs help employees enhance their skills and improve their understanding of a specific discipline. The programs are generally three years long and feature rotational tours throughout the Agency. Designed for entry to mid-level employees, development program participants are afforded the opportunity to receive tailored training, often with a cohort, and multiple assignments across Agency Directorates to develop skills and experience to ground their career at the NSA.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"12","PromotionPotential":"12","OrganizationCodes":"DD/DD28","Relocation":"True","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"Does solving unique problems energize you? Do you like to create distinctive solutions? The difference between NSA Computer Scientists and others are the problems we MUST solve. Our culture believes in solving \"unsolvable\" problems, which we do by creating new science and new technologies not yet discovered, that will protect and advance our Nation in the 4th Industrial Revolution. Are you ready for the challenge? Are you fearless? ...then read more!","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15152","MajorDuties":["As an NSA computer science development program participant your responsibilities may include:- creating analytic applications that scale across multiple, very large, data sets from disparate sources- leveraging and integrating open source, commercial off-the-shelf, and government developed software- analyzing user/customer requirements related to software and/or software system design- building software prototypes- designing, developing, and debugging software applications- troubleshooting and debugging computer code- applying mathematical or computational methods and lines of reasoning to complex software systems- identifying target communications within the global network- designing and optimizing algorithms, data structures, modeling, and analytics to solve real-world scientific problems- solving cryptanalytic, high-performance computing, and computer network problems- leading new advances in computer science, such as:- microprocessor-based advances- beyond the horizon supercomputers- signals processing (including analog control)- user interfaces- deep learning- cybersecurity- design and implementation of encryption- advanced algorithms- detecting, identifying, and evaluating vulnerabilities in cyberspace systems and/or networks- developing software and/or hardware exploitation capabilities that enable collection of foreign intelligence from target networks and systems- designing solutions to defend against adversarial threats directed towards the US, to include cutting-edge technologies such as mobile, SCADA, and Internet of Things- analyzing sophisticated malware to thwart cyber attacks and identify new threats- developing methods and applications for tools to exploit and analyze computer systems"],"Education":"Degree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). Information Technology (IT) or Information Systems (IS) degrees may be considered relevant if the programs contain the amount and type of coursework equivalent to a CS major.\nRelevant experience must be in the software development process (i.e., requirements analysis, software design, implementation, testing, integration, deployment/installation, and maintenance) and programming.","Requirements":"The ideal candidate is someone who thrives on solving hard problems, has excellent communication and interpersonal skills, and is able to:\n- work independently as well as in a team environment to build solutions- handle multiple assignments- synthesize information to solve complex problems- apply knowledge of data structures and algorithms to software engineering problems- develop, diagnose, and operate complex computer systems- identify customer needs and validate product design\nAdditionally, the ideal candidate is someone with knowledge and experience in one or more of the following:\n- programming and scripting experience (e.g., C, C++, Java, Assembly, Python, Perl, Ruby, Bash, Node.js, Spark, Puppet, SALT, KAFKA, HADOOP, VHDL, Verilog)- building user facing services, middleware, and backend systems- full-stack development- computer networking (e.g., communication protocols, distributed systems, Internet of Things, real-time systems, routing and switching)- protocol analysis (e.g. Wireshark, tcpdump)- data spaces, data modeling, data analysis, storage design, and administration- simulation/model development &amp; prototyping- information retrieval, machine learning, artificial intelligence, statistics and analytics- hardware and software vulnerability analysis- software reverse engineering/interactive debugging tools (e.g., IDA Pro, Ollydbg, gdb)- hardware reverse engineering tools (e.g., JTAG, Oscilloscopes)- software development life-cycle (design, develop, implementation, debug, testing)- kernel and device driver development- network/socket programming- embedded systems development- operating systems- computational science- algorithm analysis and design- reverse engineering- cryptanalysis- high performance computing","Evaluations":"***PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1171224.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"Please attach an unofficial copy of your transcripts when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a Computer Science degree OR a related degree that demonstrates a concentration of CS coursework. For example, degrees in Engineering, Mathematics, Information Systems, Information Technology, Information Security, Information Assurance, Computer Security, and Digital Forensics MAY be considered for this position IF your coursework/transcripts demonstrate a concentration of CS coursework. Foundational CS coursework includes the following courses: Computer Architecture, Programming Languages, Data Structures, and Algorithms.\nIf you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"On-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617244900","MatchedObjectDescriptor":{"PositionID":"1171223","PositionTitle":"Digital Network Exploitation Analyst - Development Programs - Entry/Full Level (Ft. Meade, MD)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617244900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617244900?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Computer Science","Code":"1550"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $73,076 - $91,057 (Entry/Developmental) - Entry is with a Bachelor's degree and no experience. An Associate's degree plus 2 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $84,529 - $113,362 (Full Performance) - Entry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"113362.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-12T00:00:00.0000","PositionEndDate":"2021-11-13T23:59:59.9970","PublicationStartDate":"2021-10-12T00:00:00.0000","ApplicationCloseDate":"2021-11-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Digital Network Exploitation Analysts employ computer science skills to perform discovery and target technology analysis of digital network and mobile communications.\nNSA's development programs help employees enhance their skills and improve their understanding of a specific discipline. The programs are generally three years long and feature rotational tours throughout the Agency.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"12","PromotionPotential":"12","OrganizationCodes":"DD/DD28","Relocation":"True","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations ' join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15157","MajorDuties":["As a Digital Network Exploitation Analyst at the NSA, responsibilities may include:\n- conducting analysis of metadata- conducting target analysis and research- identifying target communications within the global network- performing global network analysis and mapping- using knowledge of customer requirements to analyze and process intelligence information- performing exploitation and operations on target networks"],"Education":"Degree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). Information Technology (IT) or Information Systems (IS) degrees may be considered relevant if the programs contain the amount and type of coursework equivalent to a CS major.\nRelevant experience must be in computer or information systems design/development/analysis. In addition, it may also include engineering hardware and/or software, programming, computer/network security, vulnerability analysis, penetration testing, computer forensics, information assurance, systems engineering and/or network and system administration. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).","Requirements":"The ideal candidate is someone with a desire for continual learning and strong problem-solving, analytic and interpersonal skills who is:\n- flexible- able to communicate effectively- able to collaborate with others\nSpecialized skills and experience in one or more of the following is desired:\n- Knowledge of network protocols (especially TCP/IP, VOiP, wireless protocols)- Understanding of Internet- Understanding of WAN and LAN- Vulnerability analysis- Programming experience (prefer one or more of the following: C, C++, Java, Assembly, Python)","Evaluations":"***PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1171223.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"Please attach an unofficial copy of your transcripts when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a CS/CE degree OR a degree that demonstrates a concentration of CS coursework. For example, degrees in Computer Networking, Information Science, Information Systems, Information Technology, Information Security, Information Assurance, Cyber Security, and Digital Forensics MAY be considered for this position IF your coursework/transcripts demonstrate a concentration of CS coursework. Foundational CS coursework includes the following courses: Computer Architecture, Programming Languages, Data Structures, and Algorithms.\nIf you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"On-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617246100","MatchedObjectDescriptor":{"PositionID":"1170875","PositionTitle":"Program Manager Development Program (Technical)- Entry Level","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617246100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617246100?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $73,076 - $91,057 (Entry/Developmental)\n*The qualifications listed are the minimum acceptable to be considered for the position. Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\nEntry is with a Bachelor's degree and no experience. An Associate's degree plus 2 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"91057.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-12T00:00:00.0000","PositionEndDate":"2021-11-13T23:59:59.9970","PublicationStartDate":"2021-10-12T00:00:00.0000","ApplicationCloseDate":"2021-11-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The PMDP is a 3-year program designed to develop new hires by providing direct program manager experience as well as developmental opportunities through formal classroom training, on-the-job training, and professional certifications. Participants complete defense acquisition training as well as National Cryptologic School (NCS) training in acquisition, systems engineering, leadership, and resource management.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"09","PromotionPotential":"09","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"PMDP aims to develop future National Security Agency (NSA) key leaders by providing guidance and opportunities for professionally broadening experiences and career progression. This program will introduce program participants to the leadership skills necessary to enhance program stability, strengthen management accountability, and ensure effective use of all assigned resources.","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15155","MajorDuties":["As a Program Manager at the NSA, your responsibilities may include:\n- Establishing and managing cost, schedule and performance baselines for programs\n- Implementing best practices and processes to track progress of services and development of capabilities in terms of defined cost, schedule, and performance outcomes\n- Adjusting priorities and resource allocation based upon objective program performance data\n- Providing metrics and analysis to support forward-looking decision-making based on data\n- Establishing governance processes for program and related reviews\n- Overseeing testing that satisfies DoD/ODNI/Industry guidelines while demonstrating that an acceptable level of customer expectations have been assessed and met\n- Leveraging data and analysis from systems engineers, configuration managers, contracting officers, and/or financial managers to inform program performance measures\n- Providing program status reports and briefings to internal management, NSA senior leadership and government oversight officials in the DoD, ODNI, and Congress\n- Collaborating with senior leaders, senior technical leaders, system engineers, and fellow program managers to help develop a strategic vision and goal for the organization\n- Supporting the development and decomposition of technical requirements for programs and communicating those requirements to software and/or hardware development teams\n- Using technical expertise to propose new, or changes to, existing technical architectures or processes\n- Reviewing government or contractor developed technical documents (e.g. proposals, whitepapers) and using that information to inform programmatic decisions"],"Education":"Degree must be in Computer Science (CS) or related field (e.g., Computer Engineering, Software Engineering, Systems Engineering, Mathematics, Physics, Electrical Engineering, Mechanical Engineering, Computer Security, Computer Forensics, Network Engineering). Degrees in Information Technology, Information Systems, Information Security, Networking (Systems Administration), and Information Assurance may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and upper-level mathematics (for example, calculus, discrete mathematics).\nRelevant experience must be in engineering hardware and/or software over their lifecycle (i.e., requirements analysis, software design, implementation, testing, integration, deployment/installation, and maintenance), and/or programming. Experience leading a software or hardware development team, Project Management Professional (PMP), and/or DAWIA certifications are preferred.","Requirements":"The ideal candidate is someone with a desire for continual learning and strong communication, problem-solving, and interpersonal skills who is adaptable and has a great eye for detail.\nKnowledge and experience in the following areas is desired:\n- Conducting quantitative and qualitative program/project analysis such as Earned Value Management\n- Leading people and/or projects at a significant level of responsibility preferred\n- Delivering program requirements\n- General understanding of financially-centric matters\n- Identifying, assessing, and tracking risks\n- Monitoring contract performance and execution across its life-cycle (for example, perform duties of Contracting Officer's Representative)\n- Working in a blended environment with civilian, military, and contractor personnel\n- Understanding information technology and telecommunications products, programs, tools, and processes\n- Possessing technical expertise in applicable area\n- Effective utilization of the Microsoft Office suite of tools\nThe follow certifications are preferred:\n- DAWIA in program management or equivalent (level depends on position)\n- Project Management Professionalization (PMP)\n-Other Program/Project Management certifications considered\nKnowledge or experience in one or more of the following areas is required:- Computer Science- Computer Security- Computer Forensics- Network Engineering- Computer Engineering- Software Engineering- Systems Engineering- Mathematics- Physics- Electrical Engineering- Mechanical Engineering","Evaluations":"***PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1170875.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"Proof of highest education level completed.\nIf you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"Benefits shall be discussed by the recruiter.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617246700","MatchedObjectDescriptor":{"PositionID":"1171232","PositionTitle":"Software Engineer - Entry to Expert Level","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617246700","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617246700?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Computer Science","Code":"1550"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $73,076 - $91,057 (Entry/Developmental) - Entry is with a Bachelor's degree and no experience. An Associate's degree plus 2 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $84,529 - $113,362 (Full Performance) - Entry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $103,690 - $159,286 (Senior) - Entry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nSalary Range: $144,128 - $172,500 (Expert) - Entry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree plus 5 years of relevant experience. An Associate's degree plus 11 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"172500.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-12T00:00:00.0000","PositionEndDate":"2021-11-13T23:59:59.9970","PublicationStartDate":"2021-10-12T00:00:00.0000","ApplicationCloseDate":"2021-11-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Do you desire to do something bigger than yourself? Do you want your job to matter to you and to others? You can do that by providing the technical capabilities necessary to successfully execute NSA's mission to protect our Nation. The increased complexity of supporting NSA's mission requires world class researchers, programmers, and developers who operate in teams in software engineering, information technology infrastructure, high performance computing, &amp; more. You can be part of that team!","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"15","PromotionPotential":"15","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"Does solving unique problems energize you? Do you like to create distinctive solutions? The difference between NSA Computer Scientists and others are the problems we MUST solve. Our culture believes in solving \"unsolvable\" problems, which we do by creating new science and new technologies not yet discovered, that will protect and advance our Nation in the 4th Industrial Revolution. Are you ready for the challenge? Are you fearless? ...then click to read more!","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15156","MajorDuties":["Given the pace of technologies and myriad of adversaries in the cyber realm and foreign nation state actors, software engineers at the NSA develop the technologies and abilities to maintain our advantage in national defense and information gathering. Software engineers develop the systems needed to manage data (collect, extract value, route, etc.) at scale, build user interfaces, protect the nation's systems, and identify and develop support infrastructure as a service provider to the agency and Intelligence Community.\nResponsibilities\n- Creating secure applications that scale from small platforms to globally interconnected data centers- Identifying and retrieving the most important pieces of information out of 100s of petabytes of data- Leveraging open source software- Integrating off-the-shelf and government developed software- Conducting cybersecurity evaluations of system/architecture components- Designing, developing, and implementing cybersecurity solutions based on established standards- Leading new advances in computer science and riding the leading edge of computing technologies:- Microprocessor-based and other architectural advances- Beyond the horizon supercomputers- Signals processing (including analog control)- User interfaces- Deep learning- Information security and access controls- Design and implementation of encryption and cryptography- Advanced algorithms"],"Education":"Degree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). Information Technology (IT) or Information Systems (IS) degrees may be considered relevant if the programs contain the amount and type of coursework equivalent to a CS major.\nRelevant experience must be in the software development process (i.e., requirements analysis, software design, implementation, testing, integration, deployment/installation, and maintenance) and programming. Formal or informal leadership experience is preferred.","Requirements":"We're looking for someone who:\n- Loves to learn- Loves working as a contributing member of a team in a fast-paced environment- Can juggle multiple priorities and deadlines- Possesses strong communication and interpersonal skills- Enjoys problem-solving and strategic-thinking","Evaluations":"***PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1171232.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"Please attach an unofficial copy of your transcripts when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a CS/CE degree OR a degree that demonstrates a concentration of CS coursework. For example, degrees in Computer Networking, Information Science, Information Systems, Information Technology, Information Security, Information Assurance, Cyber Security, and Digital Forensics MAY be considered for this position IF your coursework/transcripts demonstrate a concentration of CS coursework. Foundational CS coursework includes the following courses: Computer Architecture, Programming Languages, Data Structures, and Algorithms.\nIf you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"On-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617250900","MatchedObjectDescriptor":{"PositionID":"1170797","PositionTitle":"Systems Engineer - Entry to Experienced Level (NSAW, NSAC, NSAG, NSAH, NSAT)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617250900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617250900?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Information Technology Management","Code":"2210"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $73,076 - $91,057 (Entry/Developmental) - NSA Headquarters (Ft Meade, MD)/NSA Texas/NSA Colorado/NSA Georgia/NSA Hawaii - With a professional Engineering degree, entry is with a Bachelor's degree and no experience. - With a degree in either (1) Physics or Astronomy from an accredited college or university or (2) a relevant professional technical field (e.g. chemistry, architecture, computer science, mathematics, hydrology, geology), entry is with a Bachelor's degree plus 1 year of relevant experience.\nSalary Range: $84,529 - $113,362 (Full Performance) - NSA Headquarters (Ft Meade, MD)Salary Range: $84,529 - $112,583 (Full Performance) - NSA Texas/NSA Colorado/NSA Georgia/NSA Hawaii - With a degree in professional Engineering, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. - With a degree in either (1) Physics or Astronomy from an accredited college or university or (2) a relevant professional technical field (e.g. chemistry, architecture, computer science, mathematics, hydrology, geology), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience.\nSalary Range: $103,690 - $159,286 (Senior) - NSA Headquarters (Ft Meade, MD)Salary Range: $94,760 - $142,549 (Senior) - NSA TexasSalary Range: $101,028 - $155,196 (Senior) - NSA ColoradoSalary Range: $94,760 - $141,548 (Senior) - NSA GeorgiaSalary Range: $95,012 - $145,955 (Senior) - NSA Hawaii - Entry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience. - Degree must be in either (1) professional Engineering, (2) Physics or Astronomy from an accredited college or (3) a relevant professional technical field (e.g. chemistry, architecture, computer science, mathematics, hydrology, geology).\nSalary Range: $144,128 - $172,500 (Expert) - NSA Headquarters (Ft Meade, MD)Salary Range: $128,984 - $167,679 (Expert) - NSA TexasSalary Range: $140,428 - $172,500 (Expert) - NSA ColoradoSalary Range: $128,078 - $166,502 (Expert) - NSA GeorgiaSalary Range: $132,066 - $171,686 (Expert) - NSA Hawaii - Entry is with a Bachelor's degree plus 10 years of relevant experience, or a Master's degree plus 8 years of relevant experience, or a Doctoral degree plus 6 years of relevant experience. - Degree must be in either (1) professional Engineering, (2) Physics or Astronomy from an accredited college or (3) a relevant professional technical field (e.g. chemistry, architecture, computer science, mathematics, hydrology, geology).","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"172500.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-12T00:00:00.0000","PositionEndDate":"2021-11-13T23:59:59.9970","PublicationStartDate":"2021-10-12T00:00:00.0000","ApplicationCloseDate":"2021-11-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"With the ever-accelerating technological advances and growing system complexity, NSA needs System Engineers to integrate systems and reduce the cost to operate and maintain systems. To meet these demands, the NSA hires and trains talented and highly motivated junior and senior systems engineers, electrical engineers, computer scientists, computer engineers, and other related professionals.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"15","PromotionPotential":"15","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15158","MajorDuties":["We need our System Engineers to provide program oversight and implement Systems Engineering best practices across the organization in the NSA enterprise. The need to maintain our core System Engineers group is vital to provide the technical capabilities necessary to successfully execute NSA's mission. The ever increasing complexity of supporting NSA's mission requires world class System Engineers to solve challenging systems engineering problems to enable NSA to successfully execute its mission.\nRecent college graduates and junior System Engineers are hired into positions directly supporting a technical mission office or one of two Development Programs (The System Engineer Development Program (SEDP) or the Information Technology Development Program (ITDP)).\nThe SEDP prepares recent college graduates and junior level technical staff for a career in Systems Engineering at NSA. During the three-year program, participants will rotate assignments, attend training that covers the full breadth of systems engineering disciplines, and earn DoD DAWIA and other important credentials.\nThe ITDP is a three-year full-time development program designed to provide entry-level information technology specialists (that is, individuals with degrees in computer science, information systems, information technology, and related degrees and experience) the opportunity to learn the various facets of the NSA mission, including:\n- Systems Engineering/Security Engineering- Software Engineering- SW Project Management- System Architecture- Database Design\nAs a System Engineer at the NSA responsibilities may include:\n- requirements definition, requirements analysis and requirements management- system architecture and design- integration and testing- configuration management- risk management- decision analysis- security engineering- provide system engineering expertise, guidance and support to the development and implementation of mission capabilities that align with mission driven priorities- lead and implement system engineering effort, mentor junior personnel- capture high-level concepts and translate into engineering documents and other artifacts- act as advocates for and implement Systems Engineering and Enterprise Architecture best practices and principles- craft high-level system design, specify system/component performance and interface requirements and develop installation, integration and acceptance test plans"],"Education":"","Requirements":"The ideal candidate has a desire for continual learning with excellent problem-solving, communication, and interpersonal skills who is:\n- motivated- innovative- well-organized- able to handle and prioritize multiple assignments- able to communicate effectively both orally and written- able to work effectively across several different functional areas in a collaborative environment\nKnowledge, skills, and experience in one or more of the following is desired:\n- Systems Engineering principles- Systems architecture, framework, and standards- System Engineering Certifications (DoD DAWIA Certification, INCOSE)- Technology/System Readiness Assessment- Modeling and Simulation- Security Design Engineering- Developmental Test &amp; Evaluation","Evaluations":"PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1170797.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"On-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.","OtherInformation":"For all of the above degrees, if program is not ABET EAC accredited, it must include specified coursework.*\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\nRelevant experience must be in designing engineering systems over their lifecycle (e.g., concept, design, fabrication, test, installation, operation, maintenance, and disposal). Experience in optimization and modeling is preferred.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617253900","MatchedObjectDescriptor":{"PositionID":"1171226","PositionTitle":"Contracting Specialist - Entry to Experienced Level (Ft. Meade, MD)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617253900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617253900?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Contracting","Code":"1102"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: $49,157 - $78,167 (Entry/Developmental)Entry is with a Bachelor's degree and no experience. A high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nRelevant experience must be in business management (e.g., acquisition, procurement, finance, contracting, accounting, and logistics). DAWIA Contracting I certification is preferred.\nSalary Range: $72,750 - $113,362 (Full Performance)Entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nRelevant experience must be in business management (e.g., acquisition, procurement, finance, accounting, and logistics). Federal contracting experience and DAWIA Contracting II certification is preferred.\nSalary Range: $103,690 - $134,798 (Senior)Entry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nRelevant experience must be in business management (e.g., acquisition, procurement, finance, accounting, and logistics). Federal contracting experience and DAWIA Contracting II certification is preferred.","PositionRemuneration":[{"MinimumRange":"49157.0","MaximumRange":"134798.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-12T00:00:00.0000","PositionEndDate":"2021-11-13T23:59:59.9970","PublicationStartDate":"2021-10-12T00:00:00.0000","ApplicationCloseDate":"2021-11-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Contracting specialists at NSA acquire commercial goods and services that allow the agency to collect foreign intelligence and protect national security systems. From purchasing comfortable kennels for NSA's working dogs to acquiring the latest and greatest computer technology, contracting professionals are the only people authorized to buy goods and services on NSA's behalf.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"13","PromotionPotential":"13","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"The National Security Agency employs a wide variety of business professionals who play a critical role through budgetary and contract activities that support our nation's security every day. We rely on the skills of our acquisition, finance, and accounting professionals to support the internal infrastructure of a federal agency comparable in size and budget to Fortune 100 companies. You formulate and execute budget resources, develop and allocate manpower resources and even provide guidance on implementing policy on cost, finance, and accounting. Start a career where you become a steward of taxpayer dollars, seeking the greatest return that money can provide: a superior intelligence service for the safety and security of our nation.","TravelCode":"0","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15159","MajorDuties":["- Designing acquisition strategies to meet the government's needs through the most appropriate contracting method - Conducting market research - Preparing and issuing Requests for Proposal (RFP) and Requests for Quote (RFQ) - Evaluating proposals from potential contractors/vendors - Negotiating contract terms with selected contractors/vendors - Evaluating procurements to ensure compliance with funding, legal, and program requirements - Preparing and awarding contracts with supporting documentation in accordance with Federal Acquisition Regulations and NSA policy - Administering contracts to include issuing modifications, and monitoring performance, and ensuring payment is issued - Solving complex and unique challenges that arise throughout the life of a contract - If not already completed, training in federal acquisition to become certified in Contracting under the Defense Acquisition Workforce Improvement Act within 24 months of employment"],"Education":"","Requirements":"The Ideal CandidateWe're looking for someone who:- Loves to learn- Is comfortable working in a fast-paced environment- Can juggle multiple priorities and deadlines- Possesses strong communication and interpersonal skills- Enjoys problem-solving and strategic-thinking","Evaluations":"Please note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.\nThe National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS). All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1171226.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"Benefits shall be discussed by the recruiter.","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617689600","MatchedObjectDescriptor":{"PositionID":"1171301","PositionTitle":"Cyber Mitigations Analyst/System Vulnerability Analyst - Entry to Expert Level (Maryland & Texas)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617689600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617689600?PostingChannelID="],"PositionLocationDisplay":"Fort Meade, Maryland","PositionLocation":[{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Information Technology Management","Code":"2210"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"MD Salary Range: $73,076 - $91,057 (Entry/Developmental)TX Salary Range: $73,076 - $91,057 (Entry/Developmental)MD Salary Range: $84,529 - $113,362 (Full Performance)TX Salary Range: $84,529 - $112,583 (Full Performance)MD Salary Range: $103,690 - $159,286 (Senior)TX Salary Range: $94,760 - $142,549 (Senior)MD Salary Range: $144,128 - $172,500 (Expert)TX Salary Range: $128,984 - $167,679 (Expert)\nEntry is with a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience. An Associate's degree plus 11 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\nDegree must be in Computer Science or a related field (e.g., General Engineering, Computer Engineering, Electrical Engineering, Systems Engineering, Mathematics, Computer Forensics, Cyber Security, Information Technology, Information Assurance, and Information Security).\nRelevant experience must be in vulnerability analysis, penetration testing, and/or computer forensics. In addition, may include computer or information systems design/development, programming, information/cyber/network security, information assurance, systems engineering, and/or network and/or system administration. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course), Undergraduate Cyber Training (UCT), Network Warfare Bridge Course (NWBC)/Intermediate Network Warfare Training (INWT), Cyber Defense Operations will be considered towards the relevant experience requirement (i.e., 20-24 weeks course will count as 6 months of experience, 10-14 weeks will count as 3 months of experience).","PositionRemuneration":[{"MinimumRange":"73076.0","MaximumRange":"172500.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-19T00:00:00.0000","PositionEndDate":"2021-11-15T23:59:59.9970","PublicationStartDate":"2021-10-19T00:00:00.0000","ApplicationCloseDate":"2021-11-15T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Network cyber mitigations engineers and system vulnerability analysts at NSA analyze vulnerabilities and develop mitigations to strengthen defenses. They produce formal and informal reports, briefings, and guidance to defend against attacks against network infrastructure devices or systems.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"15","PromotionPotential":"15","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"Are you a cyber professional with the drive and expertise to be on the forefront of the cyber fight; tackling NSA's complex mission to defend against cyber threats of today and tomorrow? NSA, the nation's leading cyber agency, has exciting and challenging positions in Cyber Security Engineering and Cyber and TEMPEST vulnerability analysis/mitigation. Are you ready to help secure our Nation's critical Infrastructure? If so, NSA is the place for you!","TravelCode":"-1","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15161","MajorDuties":["Our analysts' competencies run the gamut of data transport possibilities. They work with traditional wired networks, wireless transport, including Wi-Fi and cellular, collaborative platforms such as video teleconferencing, and the hardware and software that support it all. Start your career as a Network Cyber Mitigations Engineer/System Vulnerability Analyst at NSA, where you can become an expert in networking protocols and architectures, cloud security, and Internet of Things protocols, to impact and advance traditional network security.\n- Wired and wireless network security- Vulnerability discovery and analysis- Scalable mitigations development- Perimeter/boundary defense- Collaboration platforms, such as VVoIP and VTC systems- Mobile network security- Tailored security solutions- Reverse engineering- Researching emerging network industry technologies and solutions- Control system security- Malware analysis- Researching emerging network industry technologies and solutions- Ensuring adequacy of cybersecurity standards and configurations- Fusing vulnerability assessments from all sources into a unified picture of network risk"],"Education":"","Requirements":"We're looking for entry and experienced professionals who possess strong problem solving, analytical, communication and interpersonal skills; and have knowledge or experience in the following areas:\n- Defending against and/or mitigating system vulnerabilities related to network infrastructure devices and boundary defense- Network device operating systems, functionality and configuration- Network architecture and protocols- Port, protocol and services analysis- Network segmentation- Network traffic analysis- Vulnerability detection, analysis and mitigations development- Reverse engineering- Fuzzing and penetration testing- Scripting languages, such as Python- Software defined networking- Cellular technology, including 5G- Authentication mechanisms","Evaluations":"PLEASE NOTE: U.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://apply.intelligencecareers.gov/job-description/1171301.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.","RequiredDocuments":"If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"On-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.\nWork Schedule: Monday - Friday, with basic 8hr/day work requirements between 0600 to 1800 (flexible).","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"844-424-4737","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"602229200","MatchedObjectDescriptor":{"PositionID":"DE-11119305-21-SRM","PositionTitle":"INFORMATION TECHNOLOGY SPECIALIST (APPSW)(OS)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/602229200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/602229200?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"U.S. Marine Corps","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Information Technology Management","Code":"2210"}],"JobGrade":[{"Code":"EE"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"2 Years","Code":"15319"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the Mandatory Technical Qualifications will eliminate you from consideration. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 1 page.) 1. Four to six years of mobile technology domain experience at a senior corporate enterprise level. 2. Expertise in iOS, Android, HTML5, CSS3, and other mobile application frameworks and development environments, and their application to a wide range of business and mission needs. 3. Proven ability to design, optimize and integrate business processes across disparate systems and mobile technologies. 4. Experience with mobile analytics, and its application to continual service improvement. 5. Demonstrated leadership of deployments of enterprise mobile software systems using industry standard environments and multiple Mobile Device Management (MDM) and Mobile Application Management solutions in support of iOS, and Android environments. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"144128.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-05-21T00:00:00.0000","PositionEndDate":"2021-11-22T22:59:00.9970","PublicationStartDate":"2021-05-21T00:00:00.0000","ApplicationCloseDate":"2021-11-22T22:59:00.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the technical expert Mobility strategist to develop a comprehensive strategy, architecture, and roadmap to meet mobility requirements of the Marine Corps for Operations in the Information Environment (OIE).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV27","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will play a key strategic role in defining strategy, policy, and architecture to guide and constrain all mobility systems, and mobile applications development including the front-end platforms, servers, storage, and management systems/networks.","You will include the integration of warfighting and business mission mobility requirements including considerations of edge computing; integration of denied, degraded, intermittent, latent capabilities for Deployed Marine Corps Enterprise Network.","You will have a solid and comprehensive understanding of mobility solutions and technology systems development and operations, as well as experience designing and developing applications for the mobile environment.","You will create a well-informed mobility strategy and manage the adaption process and develop and organize mobility systems and regularly evaluate mobility applications, hardware, and software.","You will work closely across the organization to develop effective institutional mobility policies for the institution.","You will respond to technical issues in a professional and timely manner.","You will guide infrastructure movement techniques, including bulk application transfers onto mobile platforms and into the cloud.","You will identify top mobility architecture solutions to successfully meet the strategic needs of Marine Corps Operations in the Information Environment (OIE)."],"Education":"","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to the following email address: charles.e.andrews@usmc.mil. Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers.","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. A separate narrative statement is required. Your narrative statement must address the Mandatory Technical Qualifications (MTQs) listed above. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. This position is not covered by the Department of Defense Priority Placement Program. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. This Highly Qualified appointment may be extended up to 4 additional years at the discretion of management and in accordance with applicable regulations. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Temporary actions taken under this announcement may be made permanent without further competition. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"charles.e.andrews@usmc.mil","AgencyContactPhone":"571-465-6959","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"617663700","MatchedObjectDescriptor":{"PositionID":"DE-11264621-22-CA","PositionTitle":"DIRECTOR, WORKFORCE DIVISION","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/617663700","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/617663700?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"U.S. Marine Corps","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Intelligence Community Senior Officer Core Qualifications (ICSOCQs), and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Intelligence Community Senior Officer Core Qualifications (ICSOCQ), and Mandatory Technical Qualifications will eliminate you from consideration. INTELLIGENCE COMMUNITY SENIOR OFFICER CORE QUALIFICATION: You will be assessed against the IC Senior Officer Core Qualification Standard - Leading the Intelligence Enterprise to determine your interagency or multi-organizational (business, mission or professional) leadership competencies. (Each must be addressed separately in your Supplemental Narrative Statement. Each ICSOCQs must not exceed 2 pages.) 1) Collaboration and Integration. Senior officers have a responsibility to share information and knowledge to achieve results, and in that regard are expected to build effective networks and alliances with key peers and stakeholders across the IC and/or with other United States Government (USG), state, local, tribal and foreign officials, as appropriate; actively engage these peers and stakeholders; involve them in key decisions; and effectively leverage these networks and alliances to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or in other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes; and integrate joint/multi-agency activities, effectively exercising collaborative plans that realize mutual, joint, or multi-organizational goals. 2) Enterprise Focus. Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information, and other inputs to effectively integrate and align component, IC, and USG interests and activities to achieve IC-wide, national, or international priorities. In addition, senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce an enterprise focus among their subordinates. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi- organizational mission accomplishment.\n(b) Understand how organizations, resources, information, and processes within the IC or interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems. 3) Values-Centered Leadership. IC senior officers are expected to personally embody, advance, and reinforce IC core values: a Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. In addition, senior officers are also expected to demonstrate and promote departmental and/or component core values, which may be incorporated in writing, as applicable. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Promote, reinforce, and reward IC, departmental component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values.\n(b) Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Mastery of human capital management principles, concepts, and practices including knowledge of multiple facets of human capital laws, rules, and regulations. 2. Experience in leading, managing and successfully developing human capital management strategies for a major organization and ensuring these strategies are properly linked to the missions and priorities of the organization. 3. Experience in creating, managing, and implementing an organizational environment which encourage the implementation of innovation, and in developing change strategies and workforce planning goals tied to an organizational strategic plan. 4. Ability to effectively deal with executives within and outside the DoD to establish and maintain productive working relationships that are based on sound customer service principles, and to develop and communicate solutions to technical and complex management issues in a multi-faceted organization. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"174225.0","MaximumRange":"199300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-19T00:00:00.0000","PositionEndDate":"2021-11-17T23:59:59.9970","PublicationStartDate":"2021-10-19T00:00:00.0000","ApplicationCloseDate":"2021-11-17T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Information Workforce Division Director and Intelligence Chief Human Capital Officer for the Deputy Commandant for Information (DC I) at Headquarters Marine Corps (HQMC).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV27","Relocation":"True","HiringPath":["public","ses"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will lead in the development and execution of the human capital strategy; developing, recommending, implementing, and directing programs and policies pertaining to human capital management.","You will manage the Defense Civilian Intelligence Personnel System (DCIPS) and serve as the Intelligence Community of Interest leader within the functional management community.","You will establish accountability for achievement of human capital goals, monitor performance, and provide feedback.","You will manage the full range of workforce management practices within the Marine Corps Information Environment Enterprise (MCIEE) and advocate a culture of service.","You will advise on the human capital programs: diversity, competitive programs, work life, benefits, awards, recruitment, career development, education and training, mentoring, workforce strategies, succession management, climate analysis.","You will represent the Intelligence human capital including the National Intelligence Community, the Department of Defense (DoD), Department of Navy (DON), and within the Marine Corps.","You will maintain awareness of legislative and regulatory requirements and develop related policies."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad Hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire https://apply.usastaffing.gov/ViewQuestionnaire/11264621\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 11/17/2021. Applications received after 11/17/2021 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statements must address the Intelligence Community Senior Officer Core Qualifications (ICSOCQs) and the Mandatory Technical Qualifications (MTQs) listed above. A Joint Duty Claim Form is required. This position required Joint Duty credit. You must submit one of the following: an approved Joint Duty claim form, or a completed Joint Duty claim request form with required documentation; or provide a supplemental statement providing evidence of joint duty credit (including dates, location and statement identifying specific Joint Duty Assignment. Failure to provide this information will eliminate you from consideration. The form can be found at the JDA web page: http://www.icjointduty.gov/. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This position is in the Defense Intelligence Senior Level (DISL) criteria. DISL positions may include some supervisory and related managerial duties, provided that these duties occupy less than 25 percent of the incumbent's time. DISL members are independent advisors or technical experts and do not involve fundamental research and development responsibilities. DISL positions are in the excepted service. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How to Apply section of this vacancy announcement. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf All Defense Intelligence positions under the Defense Civilian Intelligence Personnel System (DCIPS) are in the excepted service by specific statute, 10 U.S.C. 1601. This position is in the excepted service. Non-DCIPS applicants selected for a DCIPS position must acknowledge in writing, prior to actual appointment to the DCIPS position, that the position for which he or she has been selected is in the excepted service and covered by DCIPS. Federal employees currently serving in the competitive service must also acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS position. This acknowledgement is necessary as movement between the excepted service and competitive service may be limited if the employee does not possess competitive status. Joint Duty Assignments - Joint IC Duty certification is a prerequisite for appointment to senior executive, senior professional, and DCIPS positions classified above GG grade 15.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"619583100","MatchedObjectDescriptor":{"PositionID":"SES-11272598-21-SD","PositionTitle":"Deputy Director for Studies and Analysis","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/619583100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/619583100?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Organization of the Joint Chiefs of Staff","DepartmentName":"Department of Defense","SubAgency":"Joint Staff","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"***THIS POSITION IS PART OF THE DEPARTMENT OF DEFENSE PILOT PROGRAM\n***Please read this announcement in its entirety before applying. Under the DoD Pilot Program, there is no requirement to prepare a narrative statement specifically addressing the Executive Core Qualifications (ECQs). However, to meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications within your resume -- not to exceed five pages. Your application must also include a narrative statement specifically addressing the mandatory technical qualifications not to exceed a total of two pages. http://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. MANDATORY TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You are required to respond to all of the technical qualifications. If you fail to do so, you will be rated as ineligible. Please limit your written statement to no more than 2 pages. Demonstrated knowledge of the statutes, policies, and organizational relationships associated with force structure, resources (to include acquisition), and assessments as they affect major DoD programs. Demonstrated ability to understand and analyze complex budgetary, resourcing, requirements generation, and acquisition issues informed by models, simulations and wargaming. Demonstrated ability to synthesize a myriad of often conflicting details and communicate effectively, both orally and in writing, on matters of broad scope and complexity concerning force structure management, development and design. DoD Joint Enterprise-Wide Experience Statement:\nIn addition, DoD requires an Enterprise Perspective. This individual must have the ability to apply a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities is required. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within the application package (Resume and technical qualifications).","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"199300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-29T07:17:39.8600","PositionEndDate":"2021-11-12T23:59:59.9970","PublicationStartDate":"2021-10-29T07:17:39.8600","ApplicationCloseDate":"2021-11-12T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Deputy Director for Studies and Analysis (DDSA) position is located in the Joint Staff (JS), Force Structure, Resources, and Assessment Directorate (J8). This position reports directly to the Director for Force Structure, Resources, and Assessment.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","SubAgencyName":"Joint Staff","OrganizationCodes":"DD/DD02","Relocation":"False","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Joint Chiefs of Staff consist of the Chairman, the Vice Chairman, the Chief of Staff of the Army, the Chief of Naval Operations, the Chief of Staff of the Air Force, the Commandant of the Marine Corps and the Chief of the National Guard Bureau. The collective body of the JCS is headed by the Chairman (or the Vice Chairman in the Chairman's absence), who sets the agenda and presides over JCS meetings. Responsibilities as members of the Joint Chiefs of Staff take precedence over duties as the Chiefs of Military Services. The Chairman of the Joint Chiefs of Staff is the principal military adviser to the President, Secretary of Defense, and the National Security Council (NSC), however, all JCS members are by law military advisers, and they may respond to a request or voluntarily submit, through the Chairman, advice or opinions to the President, the Secretary of Defense, or NSC. This position is in the Senior Executive Service (SES), a small, elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The DDSA provides oversight, continuity, and long-term vision regarding studies and analysis issues for the JS. Major duties and responsibilities will include, but are not limited to the following: Leads the planning and accomplishment of: war games; studies and analyses of current and future Joint Force capabilities; and, development of global force management (GFM) guidance, joint force assignment, allocation and readiness. These activities are conducted at all levels of classification, consistent with senior leader guidance (e.g., in conjunction with the interagency and allied nations). Analyzes the current-year and future-year joint force and executes the Deputy Secretary of Defense's Analysis Working Group agenda; provides oversight of J8's GFM products and processes; and participates in POTUS and Secretary of Defense directed activities (e.g., Global Posture Review) and Presidential and Congressional transitions. Leads J8's GFM products and processes including the development and management of the Department of Defense's (DoD) Global Force Management Implementation Guidance (GFMIG), Joint Force assignment, apportionment and readiness. Conducts critical analyses including: Joint Force GFM studies that result in the Secretary's annual Directed Readiness Tables; JROC directed Capabilities Portfolio Management Review \"deep dives\" on critical joint force capabilities; CCMD studies to support the development and update of their contingency plans; and, studies and analysis of current and future Joint Force structure and capabilities. Develops new and improved Joint and combined analysis methods, techniques, models and decision support tools. Applies qualitative and quantitative gaming and analysis methods involving participation by other Joint Staff directorates, DoD agencies, foreign nations, other government organizations, and the private sector."],"Education":"There is no education requirement for this position.","Requirements":"You must be a U.S. citizen to qualify for this position. Males born after 12-31-59 must be registered or exempt from Selective Service (see https://www.sss.gov/Home/Registration) All newly appointed Career SES leaders must sign the Reassignment Rights Obligations Agreement as a condition of appointment into the SES. You must submit to a drug test and receive a negative drug test before you can be appointed into this position. Designated and/or Random Drug Testing required. In order to qualify for this position, you must be able to obtain a Top Secret security clearance and access to Sensitive Compartmented Information (TS/SCI). Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 11/12/2021 The individual selected will be required to file an 'Executive Branch Personnel Financial Disclosure Report (OGE-278) in accordance with the Ethics in Government Act of 1978. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. COVID19: All Federal Employees must be fully vaccinated by November 22, 2021. Proof of vaccination will be required. To ensure compliance with this mandate, please review the Federal civilian vaccination requirements, to include timelines for receiving required doses at https://www.saferfederalworkforce.gov/faq/vaccinations/ Please read the vacancy announcement in its entirety before applying.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments, experience, and education. Your application will be evaluated by a rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the appointing authority.","HowToApply":"TO SUBMIT AN APPLICATION THROUGH USAJOBS: In order to expedite the review of your application, you must submit a complete online application package to include the Resume and narrative statement addressing the Mandatory Technical Qualifications. To apply online, please select the 'Apply Online' button at the bottom of this announcement. Please note: your online resume may not be a complete application. Be sure to carefully read this announcement to see if additional information is required and how it should be submitted. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: http://help.usastaffing.gov/Apply/index.php? title=Alternate_Application_Information","WhatToExpectNext":"After all application packages have been received, we will review your application to ensure you meet the basic qualification requirements. The Executive Evaluation Panel will evaluate each applicant who meets the basic qualifications based on the information provided and will generate a certificate of best qualified candidates for the selecting official. Those considered highly qualified will undergo a structured interview process. A final interview with the selecting official, reference checks and other inquiries may be made prior to appointment. In addition, you will be subject to screening to ensure there is no adverse information that could affect your ability to be placed in the position. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement.","RequiredDocuments":"1. Your resume must address your qualifications for the position and cannot exceed five pages. You do not need to submit a separate statement specifically addressing the Executive Core Qualifications (ECQs), but you must show how you possess the five ECQs within the resume narrative. In addition, applicants typically provide the following information: Vacancy Announcement number SES-11272598-21-SD Full name, email and mailing address, and day and evening telephone numbers Educational information including the name, city, and state of colleges or universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://http://www.edu.gov/admins/finaid/accred/index.html Information about your paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary Information about honors, awards, and special accomplishments 2. Mandatory Technical Qualifications (MTQs): A narrative statement specifically addressing the mandatory technical qualifications should not exceed a total of two pages. 3. Copy of the Notification of Personnel Action (SF-50): Current and former career SES members must provide an SF-50 showing their status or reinstatement eligibility. Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as award certificates will not be considered.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"Veterans preference is not applicable to the Senior Executive Service. Applications MUST be submitted through USAJobs. Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 11/12/2021","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"whs.pentagon.hrd.mbx.semo-job-application-assistant@mail.mil","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"621620100","MatchedObjectDescriptor":{"PositionID":"ST-11293707-22-JS","PositionTitle":"DIRECTOR, WARFIGHTER INTEGRATION","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/621620100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/621620100?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Immediate Office of the Chief of Naval Operations","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"SL"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the Mandatory Technical Qualifications will eliminate you from consideration. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Possess expert knowledge of the interworking of special/limited access security, intelligence and special operations programs and show the ability to incorporate those programs into the formulation of advanced strategies. 2. Demonstrate expertise to identify opportunities derived from extremely sensitive intelligence sources to form recommendations to senior leadership in determining outlays of Department of the Defense resources to achieve maximum result. 3. Possess detailed knowledge of the Planning, Programming and Budgeting (PPB) and how PPB requirements are informed by extremely sensitive intelligence sources. 4. Articulate current and future challenges posed by adversary nations to the U.S. in order to focus multiple planning efforts to counter emerging threats to Department of Defense (DoD) maritime superiority. 5. Exhibit the ability to independently identify, produce, champion and ensure completion of innovative programs to counter and defeat adversary initiatives. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"174225.0","MaximumRange":"199300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-11-10T00:00:00.0000","PositionEndDate":"2021-11-30T23:59:59.9970","PublicationStartDate":"2021-11-10T00:00:00.0000","ApplicationCloseDate":"2021-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Director, Warfighting Integration in the Deputy Chief of Naval Operations for Warfighting Development (OPNAV N7) Division; the principal advisor to the Chief of Naval Operations on improving warfighting by anticipating future operational demands; preparing and educating the naval force for the future; recommending, evaluating, testing and integrating operational concepts and future capabilities; and conducting critical analysis of all aspects of naval warfighting doctrine.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV11","Relocation":"True","HiringPath":["fed-competitive","land","ses","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will identify, develop and synchronizes the implementation of specialized actions and activities that enhance the Navy's competitive posture across the spectrum of conflict.","You will serve as the Director, Naval Strategy Panel (NSP). You will review, edit, and coordinate briefings and presentations for strategic alignment, analytic rigor, and functional consistency with NSP objectives and campaigns.","You will provide fully-informed Red/Blue assessments of the Navy's acquisition priorities with particular attention to identifying specific opportunities to enhance core strengths, exploit emerging opportunities, and mitigate threats and weaknesses.","You will identify, design, and implement plans, concepts, and campaigns that will enhance the competitive posture and warfighting advantage of the U.S. Navy and Marine Corps.","You will identify, establish, and supervise Operational Planning Teams (OPTs) tasked with developing the plans concepts and campaigns established to achieve NSP objectives. You will select OPT leads.","You will provide inputs to inform and shape Navy strategy documents including: The Navy Strategy, Navy Design, and the Chief of Naval Operations' annual Guidance (CNOG) to the Program Objective Memorandum (POM)."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad-hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11293707\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 11/30/2021. Applications received after 11/30/2021 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. A separate narrative statement is required. Your narrative statement must address the Mandatory Technical Qualifications (MTQs) listed above. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This position is a Senior Level position in the federal government. Senior Level employees are in non-executive positions whose duties are broad and complex enough to be classified above GS 15 level. Senior level positions involve highly specialized and complex work. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is eligible for part time, full time or ad-hoc telework at the discretion of management.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"615367500","MatchedObjectDescriptor":{"PositionID":"DE-11244102-21-SRM","PositionTitle":"DIVERSITY, EQUITY AND INCLUSION ADVISOR","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/615367500","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/615367500?PostingChannelID="],"PositionLocationDisplay":"Quantico, Virginia","PositionLocation":[{"LocationName":"Quantico, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Quantico, Virginia","Longitude":-77.2909,"Latitude":38.5221}],"OrganizationName":"U.S. Marine Corps","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"EE"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"5 Years","Code":"15319"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the Mandatory Technical Qualifications will eliminate you from consideration. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 1 page.) 1. Expert knowledge and credentialed experience of diversity and inclusion management trends, best practices, and programs in order to research, analyze and apply current findings and activities in inclusion and diversity management from an overall business standpoint. 2. Expert knowledge of a wide range of external and internal data such as national demographics, psychology of the workforce, morale trends, employee surveys, etc: and, a mastery of the application of a wide range of qualitative and quantitative methods in order to analyze, interpret, develop, and implement new diversity strategies/theories and initiatives. Such expert knowledge thereby ensures the USMC provides a diverse (e.g., combination of academic backgrounds, cultures, life circumstance, thinking styles, and interests), and inclusive environment as a business imperative. 3. Expert knowledge and ability to conceive, plan, and manage diversity and inclusion programs of broad, emerging, or critical large-scale agency programs of national scope with equivalent analytical, creative and demanding issues, such as uncertainties involving the authorities and scope of the program resulting from intense Congressional interest. 4. Expert knowledge and ability to conceive and appropriately address unprecedented factual issues (e.g., stemming from the newness or complexity of the diversity and inclusion program, departure from previous practices, or intergovernmental requirements) which require the generation of innovative new approaches; the need for top agency management officials to balance conflicting interests of extreme intensity (e.g., those resulting from the undetermined potential for future applications of the program's product or results, or from public and political controversy that results in the formation of special interest or lobbying groups, or from considerable attention by the national media). Desired Master's degree or Certification in Diversity, Equity, and Inclusion or related Human Resources, Adult Education, and or Organizational Leadership. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"144128.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-09-24T12:38:13.7970","PositionEndDate":"2021-12-23T23:59:59.9970","PublicationStartDate":"2021-09-24T12:38:13.7970","ApplicationCloseDate":"2021-12-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"In collaboration with the Chief Diversity Officer (CDO) and the Diversity Review Board (ORB), lead diversity, equity, and inclusion efforts within the United States Marine Corps (USMC), ensure internal and external communications reflect diversity, equity, and inclusion, develop tools and define processes that enable shifting the USMC cultural paradigm for diversity, equity, and inclusion.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV27","Relocation":"True","HiringPath":["ses","public"],"AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will support the development of and administer training and education guidance to the Chief Diversity Officer and supporting senior leadership within the USMC.","You will drive strategic management concepts and principles, including assisting with the development of Marine Corps policy, supporting the USMC's mission, vision, values, strategic goals and objectives.","You will collaborate with the DRB Secretariat, the incumbent reports to the CDO who has oversight and responsibility for development and implementation of USMC-wide diversity, equity, and inclusion management programs.","You will support the assessment of diversity and inclusion program effectiveness; design and lead implementation of process improvement initiatives; and provide executive level consultation."],"Education":"","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: charles.e.andrews@usmc.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers.","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. A separate narrative statement is required. Your narrative statement must address the Mandatory Technical Qualifications (MTQs) listed above. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. Highly Qualified appointments may be extended at the discretion of management and in accordance with applicable regulations. This position is not covered by the Department of Defense Priority Placement Program. Term appointments may be extended up at the discretion of management and in accordance with applicable regulations. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. Temporary actions taken under this announcement may be terminated at any time before the established not-to-exceed date. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Veteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"charles.e.andrews@usmc.mil","AgencyContactPhone":"571-465-6959","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"616713600","MatchedObjectDescriptor":{"PositionID":"DCSA-22-11244617-DISL","PositionTitle":"SENIOR ADVISOR, CONTRACTING AND ACQUISITIONS","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/616713600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/616713600?PostingChannelID="],"PositionLocationDisplay":"Quantico, Virginia","PositionLocation":[{"LocationName":"Quantico, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Quantico, Virginia","Longitude":-77.2909,"Latitude":38.5221}],"OrganizationName":"Defense Counterintelligence and Security Agency","DepartmentName":"Department of Defense","SubAgency":"Office of the Chief of Staff","JobCategory":[{"Name":"Contracting","Code":"1102"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"MANDATORY TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. Please limit your written statements to not exceed two pages per technical qualification. 1. Subject Matter Expertise of acquisition management, including laws, regulations, principles, and practices applicable to all phases of the contracting process within the Department of Defense. 2. Demonstrated ability to direct strategic planning, programming, budgeting, and execution of short and long-range acquisition management programs.","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-18T07:53:42.5770","PositionEndDate":"2021-11-18T23:59:59.9970","PublicationStartDate":"2021-10-18T07:53:42.5770","ApplicationCloseDate":"2021-11-18T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Defense Counterintelligence and Security Agency (DCSA) is a separate Agency of the Department of Defense (DoD) under the direction, authority, and control of the Under Secretary of Defense for Intelligence and Security (USD-(I&amp;S)). This position reports to the Senior Procurement Executive, a DISL position.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","SubAgencyName":"Office of the Chief of Staff","OrganizationCodes":"DD/DD12","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"DCSA Mission Statement:\nThrough vetting, industry engagement, counterintelligence support, and education, secure the trustworthiness of the United States Government's\nworkforce, the integrity of its cleared contractor support, and the uncompromised nature of its technologies, services, and supply chains. http://www.dcsa.mil","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As the Senior Advisor, Contracting & Acquisitions, you will: Work with the Senior Procurement Executive and senior officials in the Under Secretary of Defense for Acquisition and Sustainment (USD (A&S)) to maintain the procurement authority necessary for DCSA to fulfill its mission. Ensure that procurement authority is exercised in accordance with directives contained in statutes, Office of Federal Procurement Policy memoranda, and DoD policy. Develop and apply policies and procedures providing for systematic, continuous oversight of the DCSA acquisition function to ensure its compliance with law, regulation and policy. Provide leadership and direction for DCSA offices in planning, developing, evaluating, and carrying out all aspects of the DCSA acquisition and contracting program. Analyze proposed and enacted regulations to develop appropriate implementation procedures and policies. Respond to requests for information on DCSA acquisition from other offices, including the Director and Congressional inquiries. Conceive, conduct, and coordinate high-priority planning and in-depth analyses of strategic DCSA projects to ensure timely and effective acquisition support for the projects. In so doing, the incumbent sets specific goals, measures the performance of the acquisition function against the goals and takes the necessary steps to align the acquisition function with the DCSA Strategic Planning function."],"Education":"As a Senior Advisor, Contracting & Acquisitions, you must meet the following education and experience requirement: 1102 education requirements for a degree- Bachelors degree is required. 4 years of experience in contracting You MUST provide transcripts or other documentation to support your educational claims. We will accept unofficial transcripts as long as they contain the applicant's name, the name of the school, the date and degree that was AWARDED/CONFERRED, and the list of classes and credits earned. Failure to provide transcripts will result in you being rated ineligible for this position. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: Foreign Education","Requirements":"","Evaluations":"We will review your resume and supporting documents, for the quality and extent of your total accomplishments, experience and education as it relates to the fundamental competencies required for this position. Your application will be evaluated by a rating and ranking panel, and highly qualified candidates may undergo an interview and a reference check process Experience: Your experience refers to paid and unpaid experience, including volunteer work done through National Service program (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","HowToApply":"To apply for this position, you must provide a complete Application Package as described in Required Documents section. Click 'Apply Online' to create an account or log in to your existing USAJOBS account. 1. Follow the prompts to upload required documents.\n2. Applications must be received by the closing date of the announcement to receive consideration. To review the status of an application through USAJOBS: 1. Log into your USAJOBS account\n2. Click Application Status within your profile to expand your application\n3. Locate the job announcement and click the more information link under the Status column for this position. You will be routed to Application Manager. The Details tab displays by default. The Details tab displays comprehensive information about the selected Application Package including: supporting documents and their status, correspondence sent to you by the hiring agency, and your application processing status. Please review the General Application Information and Definitions at:\nhttp://www.dla.mil/Portals/104/Documents/Careers/downloads/DoDGenAppInfo.pdf","WhatToExpectNext":"Once you successfully complete the application process, you will receive a notification of receipt. Your application package will be reviewed to ensure you meet the basic eligibility and qualifications requirements, and you will receive a notification. A review will be made of the documentation you submitted to support your responses. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision. REGARDING INTERVIEWS: Interviews may be required for this position. Accommodations may be made to conduct telephonic interviews to preclude travel hardships for applicants. Note: Declining to be interviewed or failure to report for a scheduled interview will be considered as a declination for further consideration for employment against this vacancy. The Defense Counterintelligence Security Agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the point of contact for this job announcement. Your requests for reasonable accommodation will be addressed on a case-by-case basis.","RequiredDocuments":"Your complete application includes your COMPLETE resume and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. The following documents are REQUIRED\n1. Your resume: Your resume may be submitted in any format. It must include your name and contact information and support the specialized experience described in this announcement. For qualifications determinations your resume must contain the dates of employment (i.e.,Month/Year to present\"). For additional information see: What to include in your resume. 2. Mandatory Technical Qualifications (MTQs): A narrative statement specifically addressing each mandatory technical qualification. Statements should not exceed two pages per MTQ. 3. Standard Form (SF) 50, Notification of Personnel Action (if applicable) If you are a current or former Federal civilian employee you must submit your last or most recent SF-50 showing grade and tenure. 4. Veteran's Documents: If applying using veteran's preference you must submit the following documents: DD214 showing character of service (SERVICE-2 OR MEMBER-4) or Statement of Service that includes a character of service, and if claiming Disabled Veteran preference you must also submit an SF-15 Form and VA letter AB-4 showing final percentage. 5. JDA Information, if applicable. If selected, additional documentation may be required prior to appointment. 6. Transcripts: Applicants must submit a copy of their college or university transcripts(s) and certificates by the closing date of announcement to verify qualifications. If selected, an official transcript will be required prior to appointment. You may upload these documents with your application in USAJOBS or fax it to fax number provided in the announcement (please include announcement number on each page). Failure to do so will result in loss of consideration. Schools must be accredited by an accrediting institution recognized by the U.S. Department of Education. Accreditation may be verified at the following website: www.ed.gov/admins/finaid/accred/index.html. Foreign education must be evaluated by a private professional organization specializing in interpretation of foreign education credentials or an accredited U.S. educational institution in terms of equivalence to a degree acquired at an American college or university. A copy of the evaluation results must be included, otherwise your foreign education will not be considered.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID19 - All Federal Employees must be fully vaccinated by November 22, 2021. Proof of vaccination will be required. To ensure compliance with this mandate, please review the vaccination requirements, to include timelines for receiving required doses, at the following: https://www.saferfederalworkforce.gov/faq/vaccinations/ Please review the General Application Information and Definitions at:\nhttp://www.dla.mil/Portals/104/Documents/Careers/downloads/DoDGenAppinfo.pdf Other Notes:\nIf selected, Federal employees currently serving in the competitive service must acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS excepted service positions. If selected, non-DCIPS candidates must acknowledge in writing that the position they have been selected for is in the excepted service and covered by DCIPS. Selection under this appointment authority does not confer civil service competitive status. All current and former Federal employees must submit a copy of your latest SF-50 (Notification of Personnel Action) showing your tenure, grade and step, and type of position occupied (i.e., Excepted or Competitive); or similar Notification of Personnel Action documentation, i.e., Transcript of Service, Form 1150, etc. Joint Duty Credit: All DCSA executive level positions require Joint Duty Credit. Only those candidates who meet the Joint Duty Credit requirement will be eligible to compete/be considered for a senior executive position. Employees will receive joint duty credit for any rotational assignment to another IC component and may also be eligible to receive credit for service outside the IC (military, other government, or private sector) that was at the GS/GG-11 (or equivalent level) that occurred after September 11, 2001. An external candidate, if selected, will be required to immediately apply for Joint Duty credit. Note: Employees without Joint Duty Credit may apply for the position and can be considered. If selected, a waiver would be required prior to final appointment. DCSA seniors without Joint Duty at the same tier level may lateral into the position if selected without requesting a waiver.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"maria.i.mendoza7.civ@mail.mil","AgencyContactPhone":"(571) 305-6353","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"620550100","MatchedObjectDescriptor":{"PositionID":"MDA-22-11286666-SES","PositionTitle":"CHIEF ENGINEER","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/620550100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/620550100?PostingChannelID="],"PositionLocationDisplay":"Redstone Arsenal, Alabama","PositionLocation":[{"LocationName":"Redstone Arsenal, Alabama","CountryCode":"United States","CountrySubDivisionCode":"Alabama","CityName":"Redstone Arsenal, Alabama","Longitude":-86.6526,"Latitude":34.6299}],"OrganizationName":"Missile Defense Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"General Engineering","Code":"0801"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"EXECUTIVE CORE QUALIFICATIONS (ECQs):\nApplicants must submit written statements (narrative format ) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately. You are required to respond to all ECQs. If you fail to do so, you will be rated as 'ineligible.' Additional information on the ECQs is available at www.opm.gov/ses/recruitment/ecq.asp. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Please limit your written statements to one page per ECQ. ECQ 1 - LEADING CHANGE: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. Do not exceed a total of 10 pages for ECQ narratives. ECQ 2 - LEADING PEOPLE: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. Do not exceed a total of 10 pages for ECQ narratives. ECQ 3 - RESULTS DRIVEN: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. Do not exceed a total of 10 pages for ECQ narratives. ECQ 4 - BUSINESS ACUMEN: This core qualification involves the ability to manage human, financial, and information resources strategically. Do not exceed a total of 10 pages for ECQ narratives. ECQ 5 - BUILDING COALITIONS: This core qualification involves the ability to build coalitions internally and with other federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Do not exceed a total of 10 pages for ECQ narratives. TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. Please limit your written statements to two pages per TQ. TQ1- Comprehensive knowledge and proven research, development, testing, system engineering and technical expertise required to direct and provide strategic planning, system integration, interoperability testing and evaluation, and engineering conceptual program assessments and reviews for a complex weapons development and acquisition program. TQ2- Demonstrated experience identifying and resolving a broad spectrum of engineering technical issues and programmatic initiatives, while providing oversight, leadership, direction, and guidance to a multi&#173; disciplinary staff on all related functional, operational, and engineering activities. TQ3 - Demonstrated engineering and manufacturing experience working in or with industry or laboratory missile, command and control, sensor (radar and/or optical) technologies. Failure to meet any one of the technical qualifications requirements automatically disqualifies an applicant. The best-qualified candidates will be distinguished from other applicants by an evaluation panel of senior level subject matter experts and executives referencing the technical and executive core qualifications.","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"183300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-11-04T07:15:10.2300","PositionEndDate":"2021-11-15T23:59:59.9970","PublicationStartDate":"2021-11-04T07:15:10.2300","ApplicationCloseDate":"2021-11-15T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a Tier 1 position. Salaries for Tier 1 positions range from $158,541- $183,300. This position is in the Senior Executive Service, a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/DD27","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses"],"TotalOpenings":"1","AgencyMarketingStatement":"The Missile Defense Agency (MDA) is an agency of the Department of Defense (DoD) that operates under the direction, authority, and control of the Under Secretary of Defense (Research and Engineering). MDA develops and deploys a layered Missile Defense System (MDS) to defend the United States, its deployed forces, allies, and friends from missile attacks in all phases of flight. In execution of the mission, MDA manages the research, development, testing, production, fielding, foreign military sales, and with the Services, lifecycle maintenance of the Missile Defense System (MDS). This position, located in the MDA Engineering Directorate, is the Chief Engineer for the Ballistic Missile Defense System (BMDS) and is responsible to the Director for Engineering for: sound and integrated engineering and manufacturing processes and products; thorough element engineering controls and management and verification through audit; independent test, analysis, and assessment of failed and high risk events and engineering efforts; industrial and manufacturing readiness; integrated, reliable and sustainable ballistic missile defense elements' and competent next generation of project engineer leaders.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The MDA Chief Engineer performs the following major duties: The incumbent's objective is to bring the Ballistic Missile Defense System (BMDS) into being in an effective and efficient manner by providing authoritative and technically sound direction over a broad spectrum of technical and programmatic issues. To accomplish these responsibilities the incumbent: Working with the BMDS System Engineer, provides, establishes, directs, and confirms technical approaches, baselines, and discipline of missile, test, radar, battle management and systems to effectively identify and resolve a broad spectrum of engineering technical issues and programmatic initiatives, while providing oversight, leadership, direction, and guidance to a multi-disciplinary staff on all related functional, operational, and engineering activities. Selects, directs and enforces industry missile defense weapons systems development, quality assurance and assures sufficient workmanship to meet stringent missile flight requirements. Ensures the appropriate level of program engineering, technical, and schedule assessment and evaluation activities and processes are implemented and sustained. Develops and leads weekly joint government and contractor forums to expedite disciplined technical issues identification and resolution. Manages the assessment and development of specific capabilities and integrates plans and schedules to meet critical deadlines within the MDA and with Component Program Offices and the Prime Contractors. Reviews formally controlled capability baselines and functional decomposition of system requirements. Determines requirements relationships and ensures t race ability. Identifies and corrects ambiguous and incompatible software, missile and radar engineering system requirements. Resolves requirements development, risk tracking, engineering, and testing issues. Provides engineering assessments, advice, and recommendation to the Director for Engineering and other organizational elements, including element contractors and subcontractors. Maintains program oversight and monitors contractor performance to ensure compliance with cost and schedule via the Earned Value Management System. (EVMS), critical path management and Integrated Baseline Reviews (IPRs). Provides on-going oversight of the Prime Contractor's program execution. Assesses program development progress and Technical Performance Measure. Directs technology and hardware/software planning, design, development, test and evaluation, architecture development , technology insertion , systems baseline and configuration control, and overall system risks, development, integration, and interoperability. Assists the Director for Engineering to summarize, measure, and focus upon key BMDS capabilities, vulnerabilities, risks, and development options. Conducts joint government and contractor independent reviews to assess the progress of all relevant programs, and to identify potential roadblocks, and works across the technical disciplines within the MDA to address issues. Defines, designs, integrates, validates and verifies the Elements contributions to the BMDS. Defines system /element/component capability specifications, internal and external interfaces, test objectives and requirement. Develops and assesses the concept of operations. Coordinates with other DoD organizations, other government agencies, the private industrial sector, academic research institutions, and allied defense establishments to leverage expertise, and provide guidance and oversight regarding product development activities. Represents the Director for Engineering, as required and serves as a senior spokesperson on matters related to technology development and application and engineering activities in a variety of high level forums. Routinely interacts with senior executives and general officer and flag officers within the Department of Defense, as well as with senior executives from national and international private sector industries, media representatives, academia, foreign officials, and staff members of Congress."],"Education":"Education: Positive Education requirement IAW OPM Standards, Basic Requirements: A. Degree: Engineering. To be acceptable, the program must: (1) lead to a degree in a school of engineering with at least one program accredited by ABET; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such asoptics, heat transfer, soil mechanics, or electronics.\nOR B. Combination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:\n1. Professional registration or licensure -- Current registration as an Engineer Intern (EI), Engineer in Training (EIT)1 , or licensure as a Professional Engineer (PE) by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.\n2. Written Test -- Evidence of having successfully passed the Fundamentals of Engineering (FE)2 examination or any other written test required for professional registration by an engineering licensure board in the various States, the District of Columbia, Guam, and Puerto Rico.\n3. Specified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in the basic requirements under paragraph A. The courses must be fully acceptable toward meeting the requirements of an engineering program as described in paragraph A.\n4. Related curriculum -- Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a bachelor's degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions. (The above examples of related curricula are not all inclusive). https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/general-engineering-series-0801/","Requirements":"","Evaluations":"We will review your resume and supporting documents, for the quality and extent of your total accomplishments, experience and education as it relates to the fundamental competencies, identified below. Your application will be evaluated by an Executive Evaluation Panel rating and ranking panel, and highly qualified candidates may be contacted for an interview and to provide reference checks.","HowToApply":"The complete application package must be submitted by 11:59 PM (EST) on the closing date to receive consideration. To begin, click Apply Online to access an online application. Follow the prompts to select your USAJOBS resume and/or other supporting documents. You will need to be logged into your USAJOBS account or you may need to create a new account. You will be taken to an online application. Complete the online application, verify the required documentation, and submit the application. Your application must include your written statements addressing all five of the Executive Core Qualifications and each of the Technical Qualification statements. You will receive an email notification when your application has been received for the announcement. To verify the status of your application, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the More Information link for this position. The Application Status page will display the status of your application, the documentation received and processed, and your responses submitted to the online application. Your uploaded documents may take several hours to clear the virus scan process. Applications mailed using government postage or through an internal federal government mail system will not be considered. Once your application is received we will conduct a review of your application package to ensure all required documents have been received. All applications that have all required documents will be forwarded to management for panel review and possible interview. We expect to make a selection within 90 days of the closing date of the announcement. You will be notified of the outcome.","WhatToExpectNext":"Once you successfully complete the application process, you will receive a notification of receipt. Your application package will be reviewed to ensure you meet the basic eligibility and qualifications requirements, and you will receive a notification. A review will be made of your online questionnaire and the documentation you submitted to support your responses. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision.","RequiredDocuments":"To apply for this position, you must provide a complete application package which includes: 1. Resume- Your Resume listing your name, contact information, work schedule, hours worked per week, dates of employment and duties performed. If multiple resumes are submitted by an applicant, only the last resume submitted will be referred for consideration. 2. Executive Core Qualifications (ECQs): Completed supplemental narrative in a separate document that gives specific examples of work experiences addressing each ECQ. Your narrative should be no more than 1 page per ECQ. 3. Technical Qualifications (TQ) - Completed supplemental narrative in a separate document that gives specific examples of work experiences addressing each technical qualification. Your narrative should be no more than 2 pages for each technical qualification. 4. Standard Form (SF) 50- Notification of Personnel Action (if applicable)- If you are a current or former Federal civilian employee you must submit your last or most recent SF-50 showing grade and tenure. DO NOT submit additional information (i.e. cover letters, awards, appraisals, pages in excess of the page limit for technical qualifications.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"If you have been referred on MDA-21-11236924-SES or MDA-22-11259102-SES you do not need to reapply. COVID19 - All Federal Employees must be fully vaccinated by November 22, 2021. Proof of vaccination will be required. To ensure compliance with this mandate, please review the vaccination requirements, to include timelines for receiving required doses, at the following: https://www.saferfederalworkforce.gov/faq/vaccinations/ Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within 60 days. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy. Acquisition Certification: Completion of Level III Certification in SPDRE is mandatory within the first twenty-four (24) months of service, unless waived by the appropriate defense official, i.e. Under Secretary of Defense for Research and Engineering; or the Director of Acquisition Career Management (DACM). REEMPLOYED ANNUITANTS: http://www.dtic.mil/whs/directives/corres/pdf/1400.25- V300.pdf SELECTIVE SERVICE REQUIREMENT: If you are a male born after December 31, 1959, and are at least 18 years of age, civil service employment (5 U.S.C. 3328) requires that you must be registered with the Selective Service System, unless you meet certain exemptions under Selective Service law. If you are required to register but knowingly and willfully fail to do so, you are ineligible for appointment by executive agencies of the Federal Government. Background Investigation: This position is designated special sensitive as defined in DoD 5200.2-R and therefore requires that a personnel security investigation be adjudicated for security eligibility on a pre-appointment basis. This requirement may take 120 days or longer to process. The incumbent must complete a Single Scope Background Investigation (SSBI) and favorable adjudication by a determining authority and be eligible for a Top Secret clearance and access to sensitive compartmented information (SCI). If selected for Federal employment, you will be required to complete a \"Declaration of Federal Employment,\" (OF-306), prior to being appointed to determine your suitability for Federal employment and to authorize a background check. Financial Disclosure: Senior Executives are required to comply with the provisions of the Ethics in Government Act, PL 95-521, which requires the submission of a financial disclosure statement (OGE-278), upon assuming an SES position. This must be submitted annually and upon termination of employment You can review our benefits at: https://help.usajobs.gov/index.php/PayandBenefits. The Federal government offers a number of exceptional benefits to its employees. This job is being filled by an alternative hiring process and is not in the competitive civil service. The materials you send with your application will not be returned.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"victor.diluzio@mda.mil","AgencyContactPhone":"703-402-7091","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}