{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":5,"SearchResultCountAll":5,"SearchResultItems":[{"MatchedObjectId":"639005100","MatchedObjectDescriptor":{"PositionID":"DE-11402506-22-IS","PositionTitle":"INTERPRETER (AMERICAN SIGN LANGUAGE)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639005100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639005100?PostingChannelID="],"PositionLocationDisplay":"Bremerton, Washington","PositionLocation":[{"LocationName":"Bremerton, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Bremerton, Washington","Longitude":-122.6257,"Latitude":47.565002}],"OrganizationName":"U.S. Pacific Fleet","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: performing simultaneous interpretation from spoken English into American Sign Language and from American Sign Language into spoken English. Additional qualification information can be found from the following Office of Personnel Management website:http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"73098.0","MaximumRange":"95022.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-24T00:00:00.0000","PositionEndDate":"2023-02-23T23:59:59.9970","PublicationStartDate":"2022-02-24T00:00:00.0000","ApplicationCloseDate":"2023-02-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. *Direct Hire Authority. See Additional Information section.*","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"11","PromotionPotential":"None","OrganizationCodes":"DD/NV70","Relocation":"True","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will facilitate communication for deaf/hard of hearing team members enabling them to fully participate in organizational activities.","You will provide interpreting services for daily work related activities, including worksite communication, appointments, meetings, training, and command events.","You will promote an understanding of deaf culture and provides training on relevant topics to employees, supervisors, and managers.","You will provide contracting and scheduling support for necessary supplemental services."],"Education":"** Education may be substituted for specialized experience as follows: A Ph.D. or equivalent doctoral degree; OR Three full years of progressively higher level graduate education leading to a Ph.D. or equivalent degree; OR An LL.M. degree in a field directly related to the position being filled; OR A combination of experience and graduate education as described above that equates to one year of experience.","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: brem_900a_admins.fct@navy.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers. NOTE: Due to COVID19, if you have any questions or need assistance, please email the DON Employment Information Center at DONEIC@navy.mil","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This announcement uses the Defense Industrial Base, Major Range and Test Facilities direct hire authority to recruit and appoint qualified candidates to certain positions in the competitive service. Must possess and maintain certification in one of the following: Registry of Interpreters for the Deaf (RID)/ National Interpreter Certification National Association of Deaf (NAD) Master Comprehensive Skills Certificate (CSC) Master Comprehensive Skills Certificate (MSCS) Certified Deaf Interpreter (CDI) Certificate of Interpretation (CI) Certificate of Transliteration (CT) COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is covered by the Department of Defense Priority Placement Program. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Veteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"robin.l.jones3@navy.mil","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"658340000","MatchedObjectDescriptor":{"PositionID":"MDA-22-11518652-DH","PositionTitle":"Foreign Affairs Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/658340000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/658340000?PostingChannelID="],"PositionLocationDisplay":"Fort Belvoir, Virginia","PositionLocation":[{"LocationName":"Fort Belvoir, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Belvoir, Virginia","Longitude":-77.136185,"Latitude":38.68809}],"OrganizationName":"Missile Defense Agency","DepartmentName":"Department of Defense","SubAgency":"International and Policy","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"You may qualify at the NH-03 level, if you fulfill the following qualifications: One year of specialized experience equivalent to the NH-02/GS-11 grade level in the Federal service: Experience with the DoD Acquisition (or similar) process with an emphasis on international programs. Experience with one of the following portfolios: armaments cooperation or security assistance (foreign military sales) Experience interfacing with agencies and foreign partners. To qualify your application package must also reflect that you meet the Individual Occupational Requirement (IOR) for the 0130 series listed below: A. Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR B. Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. OR C. Experience: four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience\nQualifying work experience may have been gained through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. For positions at grades GS-12 and above, this experience must have included either (a) responsibility for the direction and coordination of research, analysis, or other professional work in one or more of the fields listed in A above, or (b) specialized professional work of a high level of difficulty and responsibility in one or more of these fields. This high level experience must have been in such specialized activities as (1) formulation of instructions and policy guidance for United States representatives in international organizations; (2) transport and communication involving knowledge of economic, political, and technical aspects of international aviation, shipping, inland transport, or radio, telephone, and telegraph, etc.; (3) cultural affairs involving formulation and operation of policy on large-scale international cultural exchange programs; (4) occupied area affairs involving problems of occupation of conquered or liberated countries, regions, or zones; or (5) other specialized international affairs such as analyzing public opinion and attitudes, evaluating specific conditions, trends, or forces in a foreign country, formulating policy on problems of petroleum resources or fisheries, etc., representing foreign interests, protecting American property or interests, arranging for conferences, or similar activities. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Please limit your r&eacute;sum&eacute; to five pages. If more than five pages are submitted, only the\nfirst five pages will be reviewed to determine your eligibility/qualifications. NOTE: The limit does not apply to cover letters, eligibility documents such as Standard\nForm (SF) 50, Military Spouse, DD Form 214, transcripts, etc.","PositionRemuneration":[{"MinimumRange":"89834.0","MaximumRange":"138868.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-06-06T11:26:08.4300","PositionEndDate":"2022-06-13T23:59:59.9970","PublicationStartDate":"2022-06-06T11:26:08.4300","ApplicationCloseDate":"2022-06-13T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The position(s) covered by this vacancy announcement is in the Department of Defense (DoD) Acquisition Workforce Personnel Demonstration Project (AcqDemo). For more information please see: AcqDemo This position is being filled under AcqDemo Direct Hiring Authority (DHA) for non-acquisition positions involving 51% or more of time in direct support of acquisition positions within the Business and Technical Management Professional Career path.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"3","HighGrade":"3","PromotionPotential":"None","SubAgencyName":"International and Policy","OrganizationCodes":"DD/DD27","Relocation":"False","HiringPath":["fed-transition","mspouse","public"],"AgencyMarketingStatement":"Do you enjoy challenges and seek opportunities?\nAre identifying problems, analyzing facts, and making recommendations some of your strong suits?\nWould you like to obtain the rare opportunity to participate in some of the greatest technological achievements developed?\nWould you like to serve your country and defend freedom in one of the most critical efforts in history? If you answered yes, then this job is for you! The Missile Defense Agency's (MDA) mission is to develop, test, and field an integrated, layered, ballistic missile defense system (BMDS) to defend the United States, its deployed forces, allies, and friends against all ranges of enemy ballistic missiles in all phases of flight. We are seeking prepared, talented, and motivated Foreign Affairs Specialists who seek challenges and opportunities. You will earn a competitive salary and enjoy outstanding benefits while working alongside some of the brightest, most motivated thinkers of our time.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As a Foreign Affairs Specialist at the NH-0130-3 level, some of your typical work assignments may include: Serves as coordinator/analyst for political-military, security cooperation, and interagency issues related to strategic policy, treaties, international armaments cooperation agreements, security assistance activities, and their compliance with U.S. programs and requirements. Formulates recommendations and suggested language for international agreements, contributes to negotiation strategies, and develops policy statements to protect and ensure BMDS interests. Researches and analyzes political-military, security cooperation, and technical data, information, and issues required to support effective departmental and MDA political-military, security cooperation, and arms control activities, including special studies to address the implications of law, treaties, and advances in new and emerging technologies. Develops programmatic and technical material required for position papers, reports, briefings, testimony, and Congressional inquiries, including the development of correspondence and the presentation of overview briefings on political-military, security cooperation, and arms control issues and related activities. Establishes and maintains liaison and coordination with counterparts at both internal and external organizations on political-military, security cooperation, and arms control issues. Prepares material on critical and sensitive issues for meetings with Office of the Secretary of Defense (OSD) Policy and Acquisition, Technology, and Logistics (A&amp;S) staff."],"Education":"Substitution of education may not be used in lieu of specialized experience for this grade level. ARE YOU USING YOUR EDUCATION TO QUALIFY? You MUST provide transcripts or other documentation to support your educational claims. Unless otherwise stated: (1) unofficial transcripts are acceptable at time of application, or (2) If you are serviced by the office filling this position and your transcripts are on file in your official personnel folder, you are not required to submit. However, it is your responsibility to ensure transcripts are on file. All materials must be submitted by the closing date of the announcement. GRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours that your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: Foreign Education","Requirements":"","Evaluations":"We will review your resume and supporting documents, to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and evaluate your relevant work experiences as it relates to fundamental competencies, identified below, required for this position. Traditional rating and ranking of applications does not apply to this vacancy. Your application (resume and supporting documentation) will be evaluated to determine if you meet the minimum qualifications required as listed on the announcement under qualification requirements. Veterans Preference: If you are entitled to veterans preference, you should indicate the type of veterans' preference you are claiming on your resume. Your veterans' preference entitlement will be verified by the employing agency. For information on entitlement see http://www.fedshirevets.gov/job/vetpref/index.aspx Military Spouse Preference: If you are entitled to military spouse preference, in order to receive this preference you must choose the spousal eligibility in your application package referencing MSP Military Spouse Preference. Your preference entitlement will be verified by the employing agency. If you are claiming military spouse preference and qualified for the position, your name will be placed below preference eligible veteran candidates and above non-preference candidates on a list sent to the hiring manager for employment consideration. To claim Military Spouse Preference (MSP) please complete the Military Spouse PPP Self-Certification Checklist, save the document and attach it to your application package.","HowToApply":"To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below. The complete application package must be submitted by 11:59 PM (EST) on the closing date to receive consideration. To begin, click Apply Online to access an online application. Follow the prompts to select your USAJOBS resume and/or other supporting documents. You will need to be logged into your USAJOBS account or you may need to create a new account. You will be taken to an online application. Complete the online application, verify the required documentation, and submit the application. You will receive an email notification when your application has been received for the announcement. To verify the status of your application, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the More Information link for this position. The Application Status page will display the status of your application, the documentation received and processed, and your responses submitted to the online application. Your uploaded documents may take several hours to clear the virus scan process.\nTo preview the questionnaire, please go to https://apply.usastaffing.gov/ViewQuestionnaire/11518652. The Federal hiring process is setup to be fair and transparent. Please read the following guidance.\nEqual Employment Opportunity Policy The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy And gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. - OPM Equal Employment - Office of Equal Opportunity Reasonable Accommodation Policy\nFederal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a Case-by-Case basis. A reasonable accommodation is any change in the workplace or the way things are customarily done that provides an equal employment opportunity to an individual with a disability. Under the Rehabilitation Act of 1973 the Equal Employment Opportunity Commission (EEOC) must provide reasonable accommodations: - When an applicant with a disability needs an accommodation to have an equal opportunity to compete for a job.\n- When an employee with a disability needs an accommodation to perform the essential functions of the job or to gain access to the workplace, And\n- When an employee with a disability needs an accommodation to enjoy equal access to benefits and privileges of employment (e.g., details, trainings, office-sponsored events). - Disability Employment - Reasonable Accommodations - How to contact an agency Legal and regulatory guidance Financial Suitability Social Security number request Privacy Act Selective Service New employee probationary period Signature & False statements","WhatToExpectNext":"A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision. REGARDING INTERVIEWS: Interviews may be required for this position. Accommodations may be made to conduct telephonic interviews to preclude travel hardships for applicants. NOTE: Declining to be interviewed or failure to report for a scheduled interview will be considered as a declination for further consideration for employment against this vacancy. This announcement may be used to fill additional vacancies.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Your complete application includes your COMPLETE resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. The following documents are REQUIRED\n1. Your resume: Your resume may be submitted in any format. It must include your name and contact information and support the specialized experience described in this announcement. For qualifications determinations your resume must contain the number of hours worked per week and the dates of employment (i.e.,\" HRS per week and month/year\" or \"HRS per week and month/year to present\"). For additional information see: What to include in your resume. Please limit your r&eacute;sum&eacute; to five pages. If more than five pages are submitted, only thefirst five pages will be reviewed to determine your eligibility/qualifications. NOTE: The limit does not apply to cover letters, eligibility documents such as StandardForm (SF) 50, Military Spouse, DD Form 214, transcripts, etc.\n2. Transcripts College transcript(s), required if qualifying based on education. We accept unofficial transcripts, as long as they contain your name, the name of the school, the date and degree that was awarded, and the lists of classes and credits earned. 3. Veteran's Documents If applying using veteran's preference or under a Veteran's hiring authority you must submit the following documents: DD214 showing character of service, SF-15 Form and VA letter showing final percentage, or certification of expected discharge or release from active duty. PLEASE REVIEW THE BELOW LINK FOR OTHER SUPPORTING DOCUMENTS needed for proof of eligibility: https://www.dla.mil/Portals/104/Documents/Careers/downloads/FourthEstateRequiredSupportingDocumentation%2011-16-2020.pdf?ver=Lgkkn1HW9a8is7V2lyCS2Q%3d%3d Military Spouse PPP Self-certification Checklist","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"Other Notes: This position DOES NOT meet criteria for a Re-employed Annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at:http://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf. All applicants must meet qualifications and eligibility criteria by the closing date of the announcement. Interagency Career Transition Assistance Programs: This program applies to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet ICTAP eligibility criteria; 2) be rated well-qualified for the position; Well qualified is defined as possessing the type and quality of experience that exceeds the positions minimum qualifications. and 3) submit the appropriate documentation to support your ICTAP eligibility. For more information:https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/ Males born after 12-31-59 must be registered or exempt from Selective Service (see https://www.sss.gov/RegVer/wfRegistration.aspx","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DHRC-DMDAHR@DLA.MIL","AgencyContactPhone":"6146920299","SecurityClearance":"Secret","DrugTestRequired":"True","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["National security"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"658569300","MatchedObjectDescriptor":{"PositionID":"8X-DCIPS-11528106-608994-ML","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/658569300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/658569300?PostingChannelID="],"PositionLocationDisplay":"Lackland AFB, Texas","PositionLocation":[{"LocationName":"Lackland AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Lackland AFB, Texas","Longitude":-98.6181,"Latitude":29.3861}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","SubAgency":"16 AF/J54/A54","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions. This is a GG-14 position in the Defense Civilian Intelligence Personnel System (DCIPS). The GG-14 duties for the \"Professional\" work category are at the \"Senior\" work level and are equivalent to those at the GS-14 level. The selectee's salary will be set within the grade equivalent to a GS/GG grade based on the selectee's qualifications in relation to the job. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. or Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. or Experience: four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. For positions at grades GS-12 and above, this experience must have included either (a) responsibility for the direction and coordination of research, analysis, or other professional work in one or more of the fields listed in A above, or (b) specialized professional work of a high level of difficulty and responsibility in one or more of these fields. This high level experience must have been in such specialized activities as (1) formulation of instructions and policy guidance for United States representatives in international organizations; (2) transport and communication involving knowledge of economic, political, and technical aspects of international aviation, shipping, inland transport, or radio, telephone, and telegraph, etc.; (3) cultural affairs involving formulation and operation of policy on large-scale international cultural exchange programs; (4) occupied area affairs involving problems of occupation of conquered or liberated countries, regions, or zones; or (5) other specialized international affairs such as analyzing public opinion and attitudes, evaluating specific conditions, trends, or forces in a foreign country, formulating policy on problems of petroleum resources or fisheries, etc., representing foreign interests, protecting American property or interests, arranging for conferences, or similar activities. In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Your resume must reflect the quality level of experience which demonstrates the possession of the knowledge, skills, abilities, and competencies necessary for successful job performance required for this position. Examples of creditable experience include: mastery of experimental theories and new developments to problems not susceptible to treatment by accepted methods; Demonstrates broad, expert knowledge of DoD and Federal Government cyberspace issues, objectives and operations, as well as regulations and policy directives governing planning of cyber operations; Ability to plan, organize, and develop studies, projects or recommendations, and to negotiate effectively with management to accept and implement recommendations; ability to direct and oversee command-wide Foreign Disclosure enterprise and activities. Note: You must submit a copy of your transcripts. OR\nClick on the following link to view occupational requirements for this position: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0100/foreign-affairs-series-0130/ KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1 Expert and comprehensive professional knowledge of the policies, principles, concepts, guidance, procedures, techniques, and methodologies pertaining to International Affairs, Interagency and cyber Security Cooperation. 2. Broad knowledge of DoD and Federal Government cyberspace issues, objectives and operations, as well as regulations and policy directives governing planning of cyber operations. 3. Knowledge of the mission, roles, functions, organizational structures, and operation of DoD, US Embassy and Air Force organizations to provide command level staff guidance and/or execution of activities associated with conceptualization, development, execution, and assessment of the range of cyberspace initiatives with partner nations. 4. Ability to communicate effectively, both orally and in writing, often in the form of verbal and visual operational updates, situation reports and briefings to senior US and foreign government officials, as well as skill in working harmoniously with personnel of various ranks and cultures. 5. Knowledge of the DoD command structure and experience with joint military operations. Skill in applying Joint Chiefs of Staff (JCS) deliberate and crisis planning procedures, the Joint Operations Planning Process (JOPP) and Integrated tasking Order development and staffing process. 6. Broad spectrum knowledge of both international affairs functions (Security Cooperation, International Engagement, Politico-Military Affairs, etc.) and information warfare tools (ISR, Cyber, EW, and IO) to contextualize task performance within a greater Foreign Policy environment and add efficiency/effectiveness to action officer duties while satisfying strategic objectives. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"112663.0","MaximumRange":"146460.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-06-07T10:25:26.5630","PositionEndDate":"2022-06-20T23:59:59.9970","PublicationStartDate":"2022-06-07T10:25:26.5630","ApplicationCloseDate":"2022-06-20T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The primary purpose of this position: To serve as the senior manager, Partnership &amp; Engagements Division, sharing with the Division Chief the full scope of responsibilities for directing the activities of the Division and, in the chief's absence, possesses the same authority. *** Salary ranges include local market supplements *** The organizational location of this position is: 16th AF, Joint Forces Headquarters-Cyber, Plans, Strategy and Engagements Directorate, JBSA-Lackland AFB, TX","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"14","SubAgencyName":"16 AF/J54/A54","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public"],"AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win ... Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. This position is a Defense Civilian Intelligence Personnel Systems (DCIPS) position implemented under Section 504, Title V of Public Law 99-569, Intelligence Authorization Act for Fiscal Year 1987, as codified in Sec 1601, Chap 83 of Title 10 United States Code which sets forth Air Force policies and procedures for DCIPS. This position is in the Excepted Service. DoD Components with DCIPS positions apply Veterans' Preference to preference eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by section 2108 of Title 5 U.S.C., you must submit documents verifying your eligibility with your application package. For additional information on DCIPS, click here","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Provides expertise and guidance related to program management for 16AF Information Warfare functions and responsibilities for international partner program management, training, exercise and operation support. Serves as the command focal point for Security Cooperation/Partnership and Engagements programs in support of USCYBERCOM, USEUCOM, USTRANSCOM, USSTRATCOM, AND USSPACECOM. Serves as a functional authority on partnership Intelligence, Surveillance and Reconnaissance (ISR) issues to Leadership. Leads interagency/international cyber/intelligence partnerships contributions to plans development."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. Your responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. Applicants who disqualify themselves will not be evaluated further. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualifications requirement. Additional points are not added for Veteran's Preference; however, Veteran Preference is still applied. Category 3, Best Qualified: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements.\nCategory 2, Fully Qualified: Candidates in this category possess good skills and experience above the minimum requirements.\nCategory 1, Basically Qualified: Candidates in this category meet the minimum education and/or experience requirements. Once the application process is complete, a review of your application will be made to ensure you meet the job requirements. To determine if you are qualified for this job, a review of your resume and supporting documentation will be made and compared against your responses to the assessment questionnaire. The numeric rating you received is based on your responses to the questionnaire. The score is a measure of the degree to which your background matches the knowledge, skills and abilities required of this position. If, after reviewing your resume and or supporting documentation, a determination is made that you have inflated your qualifications and or experience, your score can and will be adjusted to more accurately reflect your abilities. Please follow all instructions carefully.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (EST) on 06/20/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11528106 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. 4. Return Rights: Per AFI 36-1101 - DCIPS employees have no statutory right of return to the previous position, unit, or geographic location. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application.Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy/copies of your last or most recent SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). OCONUS - Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" and block 34 must be a\"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". NOTE: For OCONUS employees who claim eligibility MSP or Family Member Preference, your SF-50 may contain a \"3\" in block 24 and a \"2\" in block 34. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11528106. Selectees who physically reside permanently in the U.S., the Commonwealth of Puerto Rico or Northern Mariana Islands, and the Possessions of the U.S., during the entire recruitment process (application, selection, and acceptance of a formal job offer) and selected for employment in the foreign area are eligible to receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, Post Allowance, Home Leave, etc. (subject to approval) Selectees who physically reside outside the U.S., the Commonwealth of Puerto Rico or Northern Mariana Islands, and the Possessions of the U.S., during any step of the recruitment process (application, selection, and acceptance of a formal job offer) will have foreign area benefits eligibility be determined on a case by case basis. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585167300","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-10XX-SPLASH","PositionTitle":"Information and Arts Family","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585167300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585167300?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Arts And Information","Code":"1001"},{"Name":"Museum Curator","Code":"1015"},{"Name":"Public Affairs","Code":"1035"},{"Name":"Language Specialist","Code":"1040"},{"Name":"Visual Information","Code":"1084"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"658349200","MatchedObjectDescriptor":{"PositionID":"1183694","PositionTitle":"Linguist/Language Analyst - Entry to Experienced Level (MD, HI, GA, TX, UT)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/658349200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/658349200?PostingChannelID="],"PositionLocationDisplay":"Multiple Locations","PositionLocation":[{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Honolulu, Hawaii","CountryCode":"United States","CountrySubDivisionCode":"Hawaii","CityName":"Honolulu, Hawaii","Longitude":-157.858,"Latitude":21.3047},{"LocationName":"Fort Meade, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Fort Meade, Maryland","Longitude":-76.7419,"Latitude":39.1014},{"LocationName":"San Antonio, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"San Antonio, Texas","Longitude":-98.49462,"Latitude":29.42449},{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952}],"OrganizationName":"National Security Agency/Central Security Service","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GG"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Salary Range: Entry/Developmental\nNSA Washington: $50,643 - $80,532NSA Hawaii: $46,358 - $73,717NSA Texas: $45,199 - $71,874NSA Georgia: $44,740- $71,146NSA Utah: $44,740- $71,146\n*The qualifications listed are the minimum acceptable to be considered for the position. Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\nEntry is with a Bachelor's degree and no experience. A high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience may be considered. A degree in any field is acceptable.\nRelevant experience can be either: performing professional work in the language, such as military, teaching, and analysis, OR non-language work in a field such as intelligence analysis, international relations, security studies, intelligence studies, journalism, law, STEM fields (e.g., computer science, chemistry, space or weapons systems, or cyber), and other topics relevant to NSA mission.\nApplicant must have a minimum language proficiency of Interagency Language Roundtable (ILR) level 2/2 in reading and listening in the target language for which the applicant is being considered, OR be selected for placement in and commit to the Agency's intensive language training (acquisition or enhancement) programs. Selection for these programs is done in collaboration with the Language Analysis Skill Community and Development Programs, and is intended for use with hard-to-fill or critical languages.\nMinimum ILR proficiency levels for the intensive language training programs are as follows (education and experience requirements above also apply):\nApplicants for the enhancement program in unique or critical languages must have either(a) a minimum language proficiency equal to a combined score of ILR Level 1/1 (for example: 0+/1+, 2/0, where 0+=.5, 1 = 1, 1+ = 1.5, 2 = 2) in the target language for which the applicant is being considered AND a minimum language proficiency of ILR Level 2/2 in a non-target language;OR(b) a minimum language proficiency of ILR Level 1/1 in the target language for which the applicant is being considered AND a minimum score of 110 on the DLAB.\nApplicants being considered for the acquisition program must have either(c) a minimum language proficiency of ILR Level 2/2 in any world language other than English;OR(d) a minimum score of 110 on the DLAB.\nSalary Range: Full Performance\nNSA Washington: $74,950 - $116,788NSA Hawaii: $68,608 - $106,906NSA Texas: $66,892 - $104,233NSA Georgia: $66,214 - $103,176NSA Utah: $66,214 - $103,176\n*The qualifications listed are the minimum acceptable to be considered for the position. Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience may be considered. A degree in any field is acceptable.\nRelevant experience can be either: performing professional work in the language, such as military, teaching, and analysis, OR non-language work in a field such as intelligence analysis, international relations, security studies, intelligence studies, journalism, law, STEM fields (e.g., computer science, chemistry, space or weapons systems, or cyber), and other topics relevant to NSA mission.\nApplicant must have a minimum language proficiency of Interagency Language Roundtable (ILR) level 2/2 in reading and listening in the target language for which the applicant is being considered, OR be selected for placement in and commit to the Agency's intensive language training (acquisition or enhancement) programs. Selection for these programs is done in collaboration with the Language Analysis Skill Community and Development Programs, and is intended for use with hard-to-fill or critical languages.\nMinimum ILR proficiency levels for the intensive language training programs are as follows (education and experience requirements above also apply):\nApplicants for the enhancement program in unique or critical languages must have either(a) a minimum language proficiency equal to a combined score of ILR Level 1/1 (for example: 0+/1+, 2/0, where 0+=.5, 1 = 1, 1+ = 1.5, 2 = 2) in the target language for which the applicant is being considered AND a minimum language proficiency of ILR Level 2/2 in a non-target language;OR(b) a minimum language proficiency of ILR Level 1/1 in the target language for which the applicant is being considered AND a minimum score of 110 on the DLAB.\nApplicants being considered for the acquisition program must have either(c) a minimum language proficiency of ILR Level 2/2 in any world language other than English;OR(d) a minimum score of 110 on the DLAB.\nSalary Range: Senior\nNSA Washington: $106,823 - $164,102NSA Hawaii: $97,784 - $150,216NSA Texas: $95,339- $146,460NSA Georgia: $94,373 - $144,976NSA Utah: $94,373 - $144,976\n*The qualifications listed are the minimum acceptable to be considered for the position. Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience may be considered. A degree in any field is acceptable.\nRelevant experience can be either: performing professional work in the language, such as military, teaching, and analysis, OR non-language work in a field such as intelligence analysis, international relations, security studies, intelligence studies, journalism, law, STEM fields (e.g., computer science, chemistry, space or weapons systems, or cyber), and other topics relevant to NSA mission.\nApplicant must have a minimum language proficiency of Interagency Language Roundtable (ILR) level 2/2 in reading and listening in the target language for which the applicant is being considered, OR be selected for placement in and commit to the Agency's intensive language training (acquisition or enhancement) programs. Selection for these programs is done in collaboration with the Language Analysis Skill Community and Development Programs, and is intended for use with hard-to-fill or critical languages.\nMinimum ILR proficiency levels for the intensive language training programs are as follows (education and experience requirements above also apply):\nApplicants for the enhancement program in unique or critical languages must have either(a) a minimum language proficiency equal to a combined score of ILR Level 1/1 (for example: 0+/1+, 2/0, where 0+=.5, 1 = 1, 1+ = 1.5, 2 = 2) in the target language for which the applicant is being considered AND a minimum language proficiency of ILR Level 2/2 in a non-target language;OR(b) a minimum language proficiency of ILR Level 1/1 in the target language for which the applicant is being considered AND a minimum score of 110 on the DLAB.\nApplicants being considered for the acquisition program must have either(c) a minimum language proficiency of ILR Level 2/2 in any world language other than English;OR(d) a minimum score of 110 on the DLAB.","PositionRemuneration":[{"MinimumRange":"50643.0","MaximumRange":"164102.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-06-06T12:26:52.7970","PositionEndDate":"2022-07-05T23:59:59.9970","PublicationStartDate":"2022-06-06T12:26:52.7970","ApplicationCloseDate":"2022-07-05T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"NSA's Linguists, known as Multidisciplined Language Analysts (MDLAs), are expected to take an inclusive approach to problem solving and mission accomplishment by frequently engaging with partners, enablers, and customers across the Intelligence Community. As a language analyst, you will use your passion for foreign language and strong oral communication, written communication, and critical thinking skills to research, translate, transcribe, report, and analyze foreign intelligence.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"07","HighGrade":"14","PromotionPotential":"14","OrganizationCodes":"DD/DD28","Relocation":"False","HiringPath":["disability","fed-competitive","fed-excepted","fed-transition","graduates","land","mspouse","native","nguard","overseas","peace","public","ses","special-authorities","student","vet"],"AppointmentExplanationText":"Permanent","AgencyMarketingStatement":"The National Security Agency's (NSA) mission is to help protect national security by providing policy makers and military commanders with the intelligence information they need to do their jobs. The professionals at NSA have one common goal: to protect our nation. The mission requires a strong offense and a steadfast defense. The offense collects, processes, and disseminates intelligence information derived from foreign signals for intelligence and counterintelligence purposes. The defense prevents adversaries from gaining access to sensitive classified national security information.","TravelCode":"0","ApplyOnlineUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15174","DetailStatusUrl":"https://jobs.monstergovt.com/mgsjobs/vacancy/viewVacancyDetail!execute.hms?orgId=289&jnum=15174","MajorDuties":["Multidisciplined Language Analysts are at the forefront of carrying out NSA's SIGINT mission, and they do so in a variety of ways. MDLAs:\n- Offer U.S. policymakers and military leaders a window into the foreign language world of intelligence targets by analyzing, transcribing, and translating key information- Research and understand foreign intelligence targets, how they operate, and how they fit in the larger geo-political context- Apply new techniques and develop creative solutions to address analytic problems such as synthesizing large volumes of data and disparate sources of information- Demonstrate a firm understanding of the communications environment and technology trends of foreign intelligence targets- Craft written and oral assessments of foreign intelligence that provide unique insights into target intentions unavailable from other intelligence disciplines- Work independently and collaborate effectively (both within NSA and with other analysts in the Intelligence Community) in research, analysis, and reporting"],"Education":"","Requirements":"The ideal candidate is intellectually curious, has a desire for continual learning, and is:\n- Proficient (reading and listening) in one or more critical foreign languages, including Russian, Ukrainian, Chinese, Persian Farsi, Sudanese Arabic, and other languages as missions and needs evolve, and/or the lower-density languages Somali (with Maay Maay), Amharic (with Tigrinya or Oromo), Swahili (with Luo or Kinyarwanda), French (with Lingala or Bambara), Hausa (with Fulani, Kanuri, or Tamashek), Urdu, Punjabi, and Pashto- Well organized and able to handle multiple assignments- A strong written and oral communicator- Able to synthesize information to solve complex problems- Able to provide timely and accurate customer service\nCoursework, knowledge, and experience in one or more of the following is desired:\n- Target development- Social network analysis- Metadata analysis- Research methodology- Topical or Regional studies relevant to national security- Quantitative/Statistical analysis- Data modeling, mining, or science- Cyber security- Computer science or networking- Telecommunications\nRelevant Internships, extracurricular activities, and/or foreign study are also considered.\nPrior military without a degree but with language analysis cryptologic experience will be considered.\nIn most cases, Experienced Level Language Analysts at NSA will have substantial experience in one or more of the following areas:\n- Performing language quality control;- Serving as an established Subject Matter Expert (SME);- Authoring and releasing reports;- Mentoring, coaching, and leading other Language Analysts;- Ensuring the technical health of the mission;- Mastering and coaching others on the use of a variety of internal tools;- Testing at Interagency Language Roundtable (ILR) 3/3 levels for one or more mission languages; and- Displaying a broad knowledge of the Intelligence Community and how various elements work together to prosecute mission.","Evaluations":"If you are selected to process further, you will be required to complete an online interview and take the Defense Language Proficiency Test which measures language proficiency and/or the Defense Language Aptitude Battery which measures potential for learning a foreign language. Invitations and instructions for the online interview and scheduling for the language test will be emailed to you. Please check your Spam folder just in case these emails landed there instead of your Inbox. You will be required to test within two months of receiving the language test email as this information will be used as part of the selection decision.\nU.S. Citizenship is required for all applicants. Reasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.","HowToApply":"To submit an application, please visit https://cicad.us/3x38xaT.\nPlease Note: Job Posting could close earlier than the closing date due to sufficient number of applicants or position no longer available. We encourage you to apply as soon as possible.","WhatToExpectNext":"After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\nIf you are selected to process further, you will be required to complete an online interview and take the Defense Language Proficiency Test which measures language proficiency and/or the Defense Language Aptitude Battery which measures potential for learning a foreign language. Invitations and instructions for the online interview and scheduling for the language test will be emailed to you. Please check your Spam folder just in case these emails landed there instead of your Inbox. You will be required to test within two months of receiving the language test email as this information will be used as part of the selection decision.","RequiredDocuments":"If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.","Benefits":"NSA&rsquo;s outstanding benefits provide employees with a better quality of life, both on the job and off, including flexible schedules; generous leave programs; health and life insurance; federal retirement plans; on-site fitness facilities; and personal and family wellness resources. For more information, please visit https://www.intelligencecareers.gov/nsa/nsabenefits.html","OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"IntelCareers@IntelligenceCareers.gov","AgencyContactPhone":"N/A","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}