{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":5,"SearchResultCountAll":5,"SearchResultItems":[{"MatchedObjectId":"639005100","MatchedObjectDescriptor":{"PositionID":"DE-11402506-22-IS","PositionTitle":"INTERPRETER (AMERICAN SIGN LANGUAGE)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639005100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639005100?PostingChannelID="],"PositionLocationDisplay":"Bremerton, Washington","PositionLocation":[{"LocationName":"Bremerton, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Bremerton, Washington","Longitude":-122.6257,"Latitude":47.565002}],"OrganizationName":"U.S. Pacific Fleet","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: performing simultaneous interpretation from spoken English into American Sign Language and from American Sign Language into spoken English. Additional qualification information can be found from the following Office of Personnel Management website:http://www.opm.gov/qualifications/Standards/group-stds/gs-admin.asp Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"73098.0","MaximumRange":"95022.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-24T00:00:00.0000","PositionEndDate":"2023-02-23T23:59:59.9970","PublicationStartDate":"2022-02-24T00:00:00.0000","ApplicationCloseDate":"2023-02-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This is a public notice flyer to notify interested applicants of anticipated vacancies. Applications will not be accepted through this flyer. Interested applicants must follow the directions in the \"How to Apply\" section of this flyer to be considered. There may or may not be actual vacancies filled from this flyer. Notice of Result letters will not be sent to applicants who respond to this flyer. *Direct Hire Authority. See Additional Information section.*","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"11","PromotionPotential":"None","OrganizationCodes":"DD/NV70","Relocation":"True","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","MajorDuties":["You will facilitate communication for deaf/hard of hearing team members enabling them to fully participate in organizational activities.","You will provide interpreting services for daily work related activities, including worksite communication, appointments, meetings, training, and command events.","You will promote an understanding of deaf culture and provides training on relevant topics to employees, supervisors, and managers.","You will provide contracting and scheduling support for necessary supplemental services."],"Education":"** Education may be substituted for specialized experience as follows: A Ph.D. or equivalent doctoral degree; OR Three full years of progressively higher level graduate education leading to a Ph.D. or equivalent degree; OR An LL.M. degree in a field directly related to the position being filled; OR A combination of experience and graduate education as described above that equates to one year of experience.","Requirements":"","Evaluations":"In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience. As vacancies occur, the Human Resources Office will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this flyer. You will be rated based on the information provided in your resume, along with your supporting documentation. If selected, you may be required to provide additional supporting documentation. If after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, you may be found ineligible/not qualified. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. All qualification requirements must be met before being considered for any vacancies.","HowToApply":"Interested Applicants must submit resumes/application packages to: brem_900a_admins.fct@navy.mil Facsimile applications will not be considered. All resumes/applications must be received no later than the close date of this flyer. It is the applicant's responsibility to verify that all information in their resume and documents, are received, legible, and accurate. HR will not modify answers/documents submitted by an applicant. Failure to submit a complete application package will result in an ineligible rating and loss of consideration.","WhatToExpectNext":"Qualified applicants will be referred to the hiring manager. The selecting official may choose to conduct interviews. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability, and security information and take that information into account in making employment offers. NOTE: Due to COVID19, if you have any questions or need assistance, please email the DON Employment Information Center at DONEIC@navy.mil","RequiredDocuments":"A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.TIP: A good way to ensure you include all essential information is to use the Resume Builder in USAJOBS to create your resume. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Are you using education as a substitute for some or all of the experience requirement? Is there a basic education requirement for this position? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"This announcement uses the Defense Industrial Base, Major Range and Test Facilities direct hire authority to recruit and appoint qualified candidates to certain positions in the competitive service. Must possess and maintain certification in one of the following: Registry of Interpreters for the Deaf (RID)/ National Interpreter Certification National Association of Deaf (NAD) Master Comprehensive Skills Certificate (CSC) Master Comprehensive Skills Certificate (MSCS) Certified Deaf Interpreter (CDI) Certificate of Interpretation (CI) Certificate of Transliteration (CT) COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is covered by the Department of Defense Priority Placement Program. Several vacancies may be filled. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. Veteran's preference does not apply when selecting individuals under this specific hiring authority. However, if you claim veteran's preference, you will be required to submit supporting documentation with your application as described in the Required Documents section below.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"robin.l.jones3@navy.mil","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585167300","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-10XX-SPLASH","PositionTitle":"Information and Arts Family","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585167300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585167300?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Arts And Information","Code":"1001"},{"Name":"Museum Curator","Code":"1015"},{"Name":"Public Affairs","Code":"1035"},{"Name":"Language Specialist","Code":"1040"},{"Name":"Visual Information","Code":"1084"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public","fed-competitive","fed-excepted","disability","land","mspouse","peace","graduates","student","vet"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"650058700","MatchedObjectDescriptor":{"PositionID":"9L-11466958-582783-MN","PositionTitle":"INTERNATIONAL RELATIONS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/650058700","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/650058700?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"HQ USAF and Support Elements","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"International Relations","Code":"0131"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions for International Relations Series, 0131 BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: A Bachelor's degree (or higher degree) or a degree with a major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-12, or equivalent in other pay systems. Examples of specialized experience includes expert knowledge of the concepts, principles, practices, laws, regulations, and policies of security assistance for case and program management execution. Detailed knowledge of the program objective for DOD and security cooperation as they relate to assigned programs. Comprehensive knowledge of command, agency and DOD missions, functions, programs and history necessary to formulate, justify, and execute security cooperation to support short and long range program goals and objectives. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, in one or more of the social sciences, or in the humanities, as shown above, plus appropriate experience or additional education. OR\nEXPERIENCE: four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries.\nTo qualify for positions at grades GS-12 and above on the basis of experience, this experience must have included either (a) responsibility for the direction and coordination of research, analysis, or other professional work in one or more of the fields listed in A above, or (b) specialized professional work involving a high level of difficulty and responsibility in one or more of these fields. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-12 level is required to meet the time-in-grade requirements for the GS-13 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Requires in-depth knowledge of the Arms Control Export Act, the Foreign Assistance Act, DOD 5105.38-M Security Assistance Management Manual, Air Force Manual 16-101, and other related DOD and Air Force directives/regulations. 2. Ability to conduct studies, analyzes data, develop alternatives, and make recommendations to resolve complex problems. 3. Knowledge of program evaluation factors and techniques to assess program accomplishments and to identify resource requirements. 4. The incumbent must have an expert understanding of the FMS standard level of service policy. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"106823.0","MaximumRange":"138868.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-20T17:02:57.0830","PositionEndDate":"2022-04-27T23:59:59.9970","PublicationStartDate":"2022-04-20T17:02:57.0830","ApplicationCloseDate":"2022-04-27T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to to advise senior Air Force leadership on development, implementation end analysis of USAF wide policies and procedures required for the management and conduct of USAF security assistance programs. Assist in development of security assistance policy guidance and interpretation to MAJCOMs.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"13","OrganizationCodes":"DD/AF13","Relocation":"False","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["At the agency level, is responsible for analyzing and examining all segments of security cooperation case / line authority.","At the agency level, provides program advisory services to Air Force and Secretariat staff by properly researching legislative language that governs security cooperation programs.","At the agency level, manages all segments of security cooperation cases for SAF/IA."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 04/27/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11466958 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11466958. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"650190200","MatchedObjectDescriptor":{"PositionID":"SES-11471527-22-VH","PositionTitle":"Foreign Relations and Defense Policy Manager","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/650190200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/650190200?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Office of the Secretary of Defense","DepartmentName":"Department of Defense","SubAgency":"Office of the Under Secretary of Defense for Policy","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), the Mandatory Technical Qualifications, and other qualifications, if applicable, listed below. EXECUTIVE CORE QUALIFICATIONS: All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately, not to exceed 10 pages. You are required to respond to all ECQs. If you fail to do so will result in a rating of 'ineligible.' When responding to the Executive Core Qualifications (ECQs), you must clearly show that you possess the experience, knowledge, skills and ability to perform the duties of this position by submitting narrative responses in which you detail your experience in each of the ECQs. Your examples should be clear and emphasize your level of responsibilities, scope and complexity of programs managed, program accomplishments with results of your actions, policy initiatives and level of contacts. You should limit your narrative to two pages per ECQ, and address each ECQ separately. OPM's Guide to Senior Executive Service Qualifications can assist you in writing an effective SES application. In particular, please note the Challenge-Context-Action-Result Model that is recommended and very helpful when drafting ECQ narrative responses. The Guide is available on OPM's Website at:\nhttp://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Applicants must utilize the Challenge-Context-Action-Result (CCAR) Model when writing Executive Core Qualifications (ECQ). Use two examples of relevant experience for each ECQ being sure your experience matches the ECQ criteria. Challenge - Describe a specific problem or goal.\nContext - Describe the individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, co-workers, members of Congress, shrinking budget, low morale).\nAction - Discuss the specific actions you took to address a challenge.\nResult - Give specific examples of measures/outcomes that had some impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. MANDATORY TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. You are required to respond to all of the technical qualifications. If you fail to do so, you will be rated as ineligible. Please limit your written statements to no more than two pages per technical qualification. Demonstrated ability to provide guidance and support to senior officials (such as internal decision-making, interagency deliberations, dealings with international counterparts, and/or testifying before Congress) in the areas of current defense policy development, planning, force posture, resourcing, foreign affairs, and/or national security. Demonstrated ability to lead/manage teams. Provide two examples of leading a team through all stages of an issue from policy creation through implementation, including an evaluation of the impact. Demonstrated ability to represent the U.S. Government in public settings, and to lead/manage negotiations with counterparts within the same agency, the interagency, Congress, and/or the international arena.","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-21T10:39:48.5700","PositionEndDate":"2022-05-05T23:59:59.9970","PublicationStartDate":"2022-04-21T10:39:48.5700","ApplicationCloseDate":"2022-05-05T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The mission of the Office of the Under Secretary of Defense for Policy is to consistently provide responsive, forward-thinking, and insightful policy advice and support to the Secretary of Defense, and the Department of Defense, in alignment with national security objectives.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","SubAgencyName":"Office of the Under Secretary of Defense for Policy","OrganizationCodes":"DD/DD01","Relocation":"False","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Office of the Secretary of Defense (OSD) is the principal staff element of the Secretary of Defense in the exercise of policy development, planning, resource management, and program evaluation responsibilities. OSD includes the Offices of the Secretary and Deputy Secretary of Defense, Under Secretaries of Defense, Assistant Secretaries of Defense, General Counsel, and the Director of Administration. This position is in the Senior Executive Service (SES), a small, elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The incumbent serves as a Foreign Relations and Defense Policy Manager. The Under Secretary of Defense for Policy (USD(P)) is the principal advisor to the Secretary and Deputy Secretary of Defense on a full range of responsibilities, particularly those regarding strategy formulation, contingency planning, and the integration of Department of Defense (DoD) plans and policy with overall U.S. foreign affairs and national security goals and objectives. The incumbent must represent the USD(P) and/or DUSD(P) in sensitive presentations and negotiations, where tact, good judgment and professional expertise are required. The incumbent has responsibility to provide recommendations to senior defense officials drawing on overall U.S. foreign affairs policy and national security goals and objectives. Major duties and responsibilities include, but are not limited to: Within broad guidance set by the USD(P), the incumbent makes recommendations on highly complex and abstract issues of DoD strategy and policy, taking into account their impact on the foreign affairs and political environment, and on related matters, including particularly those of immediate concern to the USD(P), and the Secretary of Defense. Incumbent uses independent judgment and experience to prepare seniors officials for testimony before the Congress, and drafts testimony or other presentations to the Congress for use by the USD(P). Incumbent monitors and oversees work using independent judgment, providing directions to components of the OUSD(P) staff, and doing so under tight deadlines and with little guidance. The incumbent monitors congressional action on the DoD budget and formulates official responses to periodic Congressional inquiries and/or legislated reporting requirements. The incumbent coordinates and oversees the public and press contacts of the USD(P) and component staff, developing strategies and materials for public and press presentations, and participates in or conducts long-range studies of special interest to the USD(P). The incumbent drafts issue and background papers on highly complex and important defense issues and makes oral and written presentations to the USD(P), other senior defense officials, and counterparts from other USG agencies recommending a particular resolution of these matters. The incumbent maintains professional expertise by remaining knowledgeable of current developments in the broad area of foreign affairs and foreign policy, using judgment to identify items which require action by the USD(P), advising the USD(P) of the emergence of matters requiring attention by him/her or the Secretary of Defense, and defining and initiating follow-up actions where necessary."],"Education":"Basic Requirements Degree: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. OR Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. OR Experience: four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs.","Requirements":"","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments, experience, and education. Your application will be evaluated by a rating and ranking panel. Highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resources Board will review results and make recommendations on final selections to the appointing authority. Unless you have already been certified by the Office of Personnel Management (OPM) Qualifications Review Board (QRB), your ECQs must be certified by the OPM QRB before your appointment can occur.","HowToApply":"TO SUBMIT AN APPLICATION THROUGH USAJOBS: In order to expedite the review of your application, you must submit a complete online application package to include the Resume, the Mandatory Technical Qualifications, and the Executive Core Qualifications. To apply online, please select the 'Apply Online' button at the bottom of this announcement. Please note: your online resume may not be a complete application. Be sure to carefully read this announcement to see if additional information is required and how it should be submitted. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: https://help.usastaffing.gov/Apply/index.php? title=Alternate_Application_Information","WhatToExpectNext":"After all application packages have been received, we will review your application to ensure you meet the basic qualification requirements. The Executive Evaluation Panel will evaluate each applicant who meets the basic qualifications based on the information provided and will generate a certificate of best qualified candidates for the selecting official. The selecting official may interview the best qualified candidates before making a selection. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement.","RequiredDocuments":"1. Resume - In addition to your written statements addressing the Executive Core Qualifications, the Mandatory Technical Qualification(s), and other qualifications as applicable, submit a resume or any other written format you choose to describe your qualifications, not to exceed five pages. Applicants typically provide the following information: Vacancy Announcement number SES-11471527-22-VH Full name, email and mailing address, and day and evening telephone numbers Educational information including the name, city, and state of colleges or universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://http://www.edu.gov/admins/finaid/accred/index.html Information about your paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary Information about honors, awards, and special accomplishments Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on 05/05/2022. 2. College Transcripts - Must provide a copy of transcripts or degrees in your application package. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html. All education claimed by applicants will be verified by the appointing agency. If selected, an official/sealed transcript will be required prior to appointment. 3. Mandatory Technical Qualifications (MTQs): A narrative statement specifically addressing each mandatory technical qualification. Statement should not exceed two pages per MTQ. 4. Mandatory ECQ Statement: A narrative statement specifically addressing each individual ECQ. In lieu of the narrative statement, current career SES members, reinstatement eligibles, and SES Candidate Development Program graduates must provide the documentation in item #5. 5. Copy of the Notification of Personnel Action (SF-50): Current and former career SES members must provide an SF-50 showing their status or reinstatement eligibility. Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as award certificates will not be considered.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"Veterans preference is not applicable to the Senior Executive Service. Applications MUST be submitted through USAJobs.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"whs.pentagon.hrd.mbx.semo-job-application-assistant@mail.mil","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"650422200","MatchedObjectDescriptor":{"PositionID":"9P-AFPC-11472966-583123-LEM","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/650422200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/650422200?PostingChannelID="],"PositionLocationDisplay":"Randolph AFB, Texas","PositionLocation":[{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"13 Months","Code":"15319"}],"QualificationSummary":"This is a Term position NTE 13 months; the individual selected for this position may be extended without further competition. Current Federal civilian employees may apply for this position using \"Reinstatement\" eligibility and if selected, a break in service of at least 4 calendar days may be required prior to appointment to this position. Employee should possess skills and demonstrated ability to communicate and interact with colleagues, counterparts in various USG agencies, high-ranking foreign representatives, and representatives of diverse cultures, and be able to utilize tact and diplomacy on all occasions. Employee must meet the education/experience requirements IAW OPM guidelines for the Foreign Affairs Series 0130 Occupational requirements.\n(Ref:https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedulequalification- standards/0100/foreign-affairs-series-0130/). In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT: major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-11, or equivalent in other pay systems. Examples of specialized experience includes either: (a) responsibility for the direction and coordination of research, analysis, or other professional work in one or more of the fields listed in A above, or (b) specialized professional work of a high level of difficulty and responsibility in one or more of these fields. This high level experience must have been in such specialized activities as (1) formulation of instructions and policy guidance for United States representatives in international organizations; (2) transport and communication involving knowledge of economic, political, and technical aspects of international aviation, shipping, inland transport, or radio, telephone, and telegraph, etc.; (3) cultural affairs involving formulation and operation of policy on large-scale international cultural exchange programs; (4) occupied area affairs involving problems of occupation of conquered or liberated countries, regions, or zones; or (5) other specialized international affairs such as analyzing public opinion and attitudes, evaluating specific conditions, trends, or forces in a foreign country, formulating policy on problems of petroleum resources or fisheries, etc., representing foreign interests, protecting American property or interests, arranging for conferences, or similar activities; knowledge of the International/ Foreign Affairs Security Assistance Management Manual and associate responsibilities of a Case/Country Manager (CM) as a USAF's subject matter expert and primary point of contact for planning and executing of assigned Foreign Military Sales (FMS) case(s) including acquisition, contracting milestones, programming, logistics, finance, monitors student requirements, tracking program(s), and training development. NOTE: You must submit a copy of your transcripts. OR EDUCATION: Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. OR COMBINATION OF EXPERIENCE AND EDUCATION: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-11 level is required to meet the time-in-grade requirements for the GS-12 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Knowledge of USG International/Foreign Affairs objectives, Arms Export Control Act (AECA), and Foreign Military Sales (FMS) processes, and/or understanding of international relations policy objectives within Security Assistance/Cooperation Programs. 2. Knowledge and technical skill to develop, analyze, and evaluate training options within the legal scope of an FMS program and diplomatically communicate complex plans to USG and international stakeholders. 3. Ability to analyze and coordinate a FMS cases for specific requirements, within USG and DoD regulatory policy, for money, manpower, materiel, facilities, and services needed to support the program and when necessary apply the federal acquisition process for development, implementation, line\nmanagement, execution, and closure of FMS training cases. 4. Knowledge of the procedures for the development, coordination, and planning for the formulation of Letter of Offer and Acceptance (LOAs) to include cost, schedule, and availability of DoD or contractor provided training options. 5. Ability to work complex project management issues with foreign governments, their military, and U.S. industry with an understanding of cultural, socio-political, and economic dynamics. 6. In-depth ability to use office computer software applications in the preparation of word documents, spreadsheets, and presentations; ability to communicate effectively and diplomatically in written and oral mediums. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"80176.0","MaximumRange":"104233.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-04-22T08:46:53.3200","PositionEndDate":"2022-04-28T23:59:59.9970","PublicationStartDate":"2022-04-22T08:46:53.3200","ApplicationCloseDate":"2022-04-28T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to serve as a professional Term Foreign Affairs Specialist Country Manager in support of Department of Defense (DoD) agencies. Serves as the USAF's subject matter expert and primary point of contact for planning and executing of assigned Foreign Military Sales (FMS) case(s) training requirements including acquisition.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"12","HighGrade":"12","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["fed-transition","overseas","fed-competitive","disability","mspouse","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanMilitary Spouse PreferenceNon-DoD TransferPeople with Disabilities, Schedule A","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Case/County Manager (CM) is the focal point for case/country and IMS student activities and manages all aspects of the FMS case(s).","The CM serves as USAF focal point for all international student issues in support of the assigned countries? training programs.","The CM will be the liaison between managed countries? representatives, SCOs, MAJCOMs, and other USG agencies to ensure implementation of training for and by these agencies.","Develops and initiates proper documentation, including estimated training costs, training sequences, and identification of potential problem areas based on factors unique to the requesting countries.","Develops official correspondence, messages, and items of interest, staff summaries, sheets, and talking papers relative to assigned programs."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 04/28/2022 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11472966 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Current Federal Civilian employees may apply for temporary and term positions and if selected, a break in service may be required prior to appointment to the position. Temporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11472966. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}