{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":8,"SearchResultCountAll":8,"SearchResultItems":[{"MatchedObjectId":"628581200","MatchedObjectDescriptor":{"PositionID":"DLA-21DECWHSDDAADC981773-TM","PositionTitle":"FOREIGN AFFAIRS SPECIALIST (PATHWAYS)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/628581200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/628581200?PostingChannelID="],"PositionLocationDisplay":"Alexandria, Virginia","PositionLocation":[{"LocationName":"Alexandria, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Alexandria, Virginia","Longitude":-77.04308,"Latitude":38.804565}],"OrganizationName":"Washington Headquarters Services","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Part-time","Code":"2"}],"PositionOfferingType":[{"Name":"Internships","Code":"15328"}],"QualificationSummary":"Internship Eligibility Requirements: Individuals accepted for enrollment (must provide an acceptance letter from the academic institution on letterhead) or students enrolled (must provide academic transcripts) in an accredited high school, college (including 4-year colleges/universities, community colleges, and junior colleges); professional, technical, vocational, and trade school; advanced degree programs; or other qualifying educational institution pursuing a qualifying degree or certificate. Individuals must be enrolled at least a half-time basis (as defined by the academic institution).Short-term training programs (e.g., several two-week programs completed) are not considered an academic course of study. Note: You must provide sufficient proof of enrollment or acceptance by submitting either an unofficial academic transcript that reflects your current enrollment and a verification of Fall 2021 enrollment, OR an acceptance letter from the academic institution on the institution's letterhead for Spring or Summer 2022 enrollment. Applicants will be selected at the either GS-7 level. The target grade of this position is GS-11. You may qualify at the GS-07 level, if you fulfill the following qualification requirement:\nCompletion of one (1) full academic year of graduate level education; or eligibility under the Superior Academic Achievement Provision and completion of a bachelor's degree. Conversion\nThis position may offer non-competitive conversion to term or permanent positions in the competitive service, provided that the interns have met all academic and Program requirements, and that they are within 120 days of academic program completion. The interns would be required to meet the OPM Qualification Standards for the GS-0130 Series in order to be noncompetitively converted at GS-0130-07 with promotion potential to GS-11. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Only education obtained by the closing date of this announcement will be considered. Generally, current Federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade. All qualifications must be met by the closing date of this announcement and clearly documented in your resume.","PositionRemuneration":[{"MinimumRange":"49157.0","MaximumRange":"63906.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-29T00:00:00.0000","PositionEndDate":"2022-01-03T23:59:59.9970","PublicationStartDate":"2021-12-29T00:00:00.0000","ApplicationCloseDate":"2022-01-03T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The WHS Pathways Programs are planned, progressive, education programs that provide for integration of a student's academic studies and federal work experience with the potential of noncompetitive conversion into the federal career service. Work assignments are designed to permit the knowledge acquired through education/training to be applied to particular work situations with on-the-job training and/or self development. May be assigned to any area within WHS and serviced organizations.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"7","HighGrade":"7","PromotionPotential":"11","OrganizationCodes":"DD/DD21","Relocation":"False","HiringPath":["student"],"TotalOpenings":"2","AgencyMarketingStatement":"The Washington Headquarters Services (WHS) is a world-class service organization, with a dynamic workforce and unwavering commitment to service excellence. WHS is the essential services provider for the Office of the Secretary of Defense (OSD), Department of Defense (DoD) agencies, and offices in the National Capital Region.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["This is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. This Public Notice is to gather applications which may or may not result in a referral or selection. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK). Please read this Public Notice in its entirety prior to submitting your application for consideration. This announcement will be used to fill full-time or part-time internship positions during the Summer 2022 semester, Fall/Winter 2022 semester, Spring 2023 semester, and/or the entire 2022/2022 academic year. As a Student Trainee (Foreign Affairs), GS-0130-07. If you successfully complete the program and is converted into a permanent position, you could be promoted to GS-0130-09 FPL GS-11. Your typical work assignments may include the following under supervision: Conduct research and provide support to higher specialist on foreign affairs issued associated with specific functional area(s) to include but not limited to geographic areas, national security, international security, security affairs, special operations, strategic affairs; Congressional, Policy, DoD and USG interagency processes; and defense resource and planning activities Assist with research coordination, analysis and evaluation of assigned projects Prepare reports documenting issues and develop and communicate options and recommendations to peers, colleagues, supervisors, and leadership Provide analysis of policy, strategy, concept, and program issues, force posture alternatives, and implications of changes to the international environment and defense programs"],"Education":"ARE YOU USING YOUR EDUCATION TO QUALIFY? You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. Unless otherwise stated: (1) official or unofficial transcripts are acceptable, or (2) you may submit a list with all of your courses, grades, semester, year, and credit for the course. All materials must be submitted by the closing date of the announcement. PASS/FAIL COURSES: If more than 10 percent of your undergraduate course work (credit hours) were taken on a pass/fail basis, your claim of superior academic achievement must be based upon class standing or membership in an honor society. GRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: https://www2.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Requirements":"","Evaluations":"Once the announcement has closed, a review of your r&#233;sum&#233; and supporting documentation will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. All qualified candidates will be assigned to a quality category. The category assignment is a measure of the degree in which your background matches the competencies required for this position. Your qualifications will be evaluated based on your responses to the assessment questionnaire and the competencies listed below. The assessment questionnaire link can be found under the 'How To Apply' section. For Category Rating: Once the application process is complete, a review of your resume and supporting documentation will be made and compared against your responses to the assessment questionnaire to determine if you are qualified for this job. If, after reviewing your resume and or supporting documentation, a determination is made that you have inflated your qualifications and or experience, you may lose consideration for this position. Please follow all instructions carefully. Errors or omissions may affect your eligibility. Qualified candidates will be assigned to one of the three quality categories: Qualified, Well Qualified, or Best Qualified. Qualified Category = Does not exceed the basic qualifications requirements described in the \"Qualifications\" section of this announcement. Highly Qualified Category = Meets the basic qualifications requirements described in the \"Qualifications\" section of this announcement and demonstrates proficiency in the Critical Competencies defined below. (This category must be met to be considered under ICTAP procedures) Best Qualified Category = Meets the basic qualifications requirements described in the \"Qualifications\" section of this announcement and excels in the Critical Competencies defined below. The category assignment is a measure of the degree in which your background matches the competencies required for this position. The Category Rating Process does not add veterans' preference points or apply the \"rule of three\" but protects the rights of Veterans by placing them ahead of non-preference eligibles within each quality category. Veterans' preference eligibles who meet the minimum qualification requirements and who have a compensable service-connected disability of at least 10 percent will be listed in the highest quality category (except in the case of scientific or professional positions at the GS-09 level or higher).","HowToApply":"To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below.A complete application package must be submitted by 11:59 PM (EST) on the closing date of the announcement (December 29, 2021) to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. To view the assessment questionnaire, click here: https://apply.usastaffing.gov/ViewQuestionnaire/11335496 To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login) all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.You are encouraged to apply online. Applying online will allow you to review and track the status of your application.Failure to submit a complete application package will result in an ineligible rating and loss of consideration.Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement.It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.Washington Headquarters Services provides reasonable accommodations to applicants with disabilities. Your requests for reasonable accommodation will be addressed on a case-by-case basis. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: http://www.esd.whs.mil/Directives/issuances/admin_inst/","WhatToExpectNext":"Once your online application is submitted you will receive a confirmation notification by email. Your application will be evaluated by the Human Resources Office to determine your eligibility for the position. After the evaluation is complete, you will receive another notification regarding the status of your application. Stay informed of changes to your application status by signing up for automatic email alerts at: https://www.usajobs.gov/Applicant/Application/ListApplications? Washington Headquarters Services is an Equal Employment Opportunity employer.","RequiredDocuments":"YOU ARE REQUIRED TO DOCUMENT IN YOUR APPLICATION PACKAGE EVIDENCE THAT SUPPORTS YOUR ELIGIBILITY AND QUALIFICATION CLAIMS. You MUST upload the applicable documents with your application package. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume may be submitted in any format that includes your name and contact information (telephone number and/or email).\nIf you submit more than one copy of your resume, only the most recent version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you will not be considered for this vacancy. For qualifications determinations your resume must contain the dates of employment for each position listed on your resume (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application will be marked as incomplete and you will not receive consideration for this position. It is recommended that applicants also include their hours worked per week for each employment listed on their resume. Read more about \"What should I include in my federal resume?\" at https://www.usajobs.gov/Help/faq/application/documents/resume/what-to-include/ 2. Other supporting documents: Cover Letter, optional Most recent SF-50, \"Notification of Personnel Action\" showing you are/were in the competitive service and the highest grade held (WHS serviced employees SF-50s will be verified via eOPF). College Transcript(s), if qualifying based on education (WHS serviced employees will be verified via eOPF or you may include them in your application package) DD-214, SF-15 Form and VA letter, or certification of expected discharge or release from active duty from Veterans for consideration under Veteran hiring authorities Noncompetitive appointment authority documentation, if applicable Career Transition Assistance Program/Interagency Career Transition Assistance Program documentation, if applicable (e.g., Certification of Expected Separation, Reduction-In-Force Separation Notice, or Notice of Proposed Removal; SF-50 that documents the RIF separation action; and most recent performance appraisal.) PPP Registrants/Eligibles: Must submit the following applicable documents: 1) PPP registration 2) PCS orders (if applicable) ARE YOU QUALIFYING BASED ON EDUCATION or A COMBINATION OF EDUCATION AND EXPERIENCE?\nYou must provide sufficient documentation of your education in your resume. You are strongly encouraged to provide a copy of transcripts or degrees in your application package. It is also acceptable to document your applicable course listing in your resume (course number, credits earned, etc.). Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html All education claimed by applicants will be verified by the appointing agency accordingly. If selected, an official/sealed transcript will be required prior to appointment. ARE YOU A VETERAN CLAIMING SOLE SURVIVORSHIP PREFERENCE OR 5-POINT VETERANS' PREFERENCE?\n1. You must provide legible copy/copies of the following: DD-214 (member 4 copy), \"Certificate of Release or Discharge from Active Duty,\" showing all dates of service, as well as character of service (Honorable, General, etc.) or Statement of Service/Proof of Service (in lieu of a DD-214) from your command or local Personnel Support Detachment (PSD). The Statement of Service/Proof of Service must provide all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Veterans should upload their DD-214 once they receive it upon separation.\n2. You should also document your complete military service information in the Veterans Preference and Military Service Section of the assessment questionnaire (type of preference, dates of service, date of VA letter, character of service, disability claim and rank and date of retirement if retired). ARE YOU A DISABLED VETERAN or CLAIMING 10-POINT VETERANS' PREFERENCE?\n1. Disabled veterans, veterans, widows, spouses or the mother of a veteran, who are eligible for 10-point veterans' preference, you must provide legible copies of the following: Applicable supporting documents as noted on Standard Form-15 (SF-15). To obtain a copy of SF-15, go to: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/veterans/","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"PPP PILOT: The Washington Headquarters Service is currently operating under an approved reengineered Priority Placement Program (PPP) pilot for all positions in its serviced workforce. This pilot is application based and current PPP registrants who are registered for activity codes 293A and 295A (regardless of the location) are required to apply to the job announcement via USAJobs in order to exercise their priority placement status. This pilot permits priority candidates to be assessed with other competitive applicants. Anyone claiming priority status must provide a copy of their PPP registration and supporting documentation (e.g. RIF notice, Sponsor's PCS orders, Certification of Expected Separation) at the time of application to verify priority placement and eligibility. Other priority consideration programs will continue under their current operating procedures. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Washington Headquarters Services uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, visit: http://www.dhs.gov/E-Verify If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: https://help.usastaffing.gov/Apply/index.php? title=Alternate_Application_Information Appointment Authorities: For more information on appointment authority eligibility requirements: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/individuals-with-disabilities/ https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/veterans/ https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/military-spouses/ Other Special Appointment Authorities https://www.usajobs.gov/ Interagency Agreements https://www.opm.gov/policy-data-oversight/hiring-information/competitive-hiring/#url=Types-of-Appointments Career Transition Assistance Programs: These programs apply to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: (1) meet CTAP or ICTAP eligibility criteria; (2) be rated well-qualified for the position with a score of 90 or above; and, (3) submit the appropriate documentation to support your CTAP or ICTAP eligibility. For more information visit: https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/ Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. /www.esd.whs.mil/DD/DoD-Issuances/140025/ Nepotism: Under the provisions of 5 USC 3110, an individual may not be appointed into a position if the position is under the supervisory chain of command of a relative. Additional vacancies may be filled by this announcement.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"whs.job.application.assistance@mail.mil","AgencyContactPhone":"000-000-0000","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"626891700","MatchedObjectDescriptor":{"PositionID":"9L-AFPC-11326801-462646-ARN","PositionTitle":"FOREIGN AFFAIRS SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/626891700","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/626891700?PostingChannelID="],"PositionLocationDisplay":"Arlington, Virginia","PositionLocation":[{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051}],"OrganizationName":"HQ USAF and Support Elements","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Professional and Scientific Positions, Foreign Affairs Series, 0130. BASIC REQUIREMENTS FOR FOREIGN AFFAIRS SPECIALIST 0130 SERIES: A Bachelor's degree (or higher degree) or a degree with a major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts. OR\nCOMBINATION OF EXPERIENCE AND EDUCATION: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown above. NOTE: You must submit a copy of your transcripts. OR\nEXPERIENCE: Four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. Evaluation of Experience: Qualifying experience may have been through residence, study, teaching, business or commercial activities, military service, newspaper work, military or civil government activities, missionary or international relief work, or other experience in foreign countries. AND\nIn addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below: SPECIALIZED EXPERIENCE FOR GS-13: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-12, or equivalent in other pay systems. Examples of specialized experience includes assisting with developing and disseminating appropriate policy guidance and directives to agency and field organizations; forming and leading International Cooperative Agreement Teams (ICATs) for complex, multi-national initiatives in accordance with relevant policy and law; knowledge and understanding of specific US statutes regarding international cooperation in research, development, and acquisition (ICRD&amp;A) activities such as the Arms Export Control Act (AECA); and knowledge of US national disclosure policy as it relates to allied nations and technology transfer. SPECIALIZED EXPERIENCE FOR GS-14: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-13, or equivalent in other pay systems. Examples of specialized experience includes developing and disseminating appropriate policy guidance and directives to agency and field organizations; forming and leading International Cooperative Agreement Teams (ICATs) for complex, multi-national initiatives in accordance with relevant policy and law; knowledge and understanding of specific US statutes regarding international cooperation in research, development, and acquisition (ICRD&amp;A) activities such as the Arms Export Control Act (AECA); and knowledge of US national disclosure policy as it relates to allied nations and technology transfer. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-12 level is required to meet the time-in-grade requirements for the GS-13 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. FEDERAL TIME-IN-GRADE (TIG) REQUIREMENT FOR GENERAL SCHEDULE (GS) POSITIONS: Merit promotion applicants must meet applicable time-in-&shy;grade requirements to be considered eligible. One year at the GS-13 level is required to meet the time-in-grade requirements for the GS-14 level. TIG applies if you are in a current GS position or held a GS position within the previous 52 weeks. NOTE: Applicants applying as VEOA candidates who are current GS civil service employees or are prior GS civil service employees within the past 52 weeks must also meet time-in-grade requirements. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\nFOR GS-13:\n1. Comprehensive knowledge of US foreign policy objectives, the US alliance structure, USAF and DoD acquisition policies and their impact on international programs, and the DoD international agreements process.\n2. Ability to apply knowledge and experience to a wide range of other programs and issues with particular emphasis on international activity.\n3. Comprehensive ability to communicate effectively, both orally and in writing, by preparing and presenting briefings and reports to senior US and foreign government officials.\n4. Ability to develop improvements in or design new work methods and procedures; analyze, plan, and adjust work operations of subordinate organizational segments to meet program requirements and objectives within available resources.\n5. Skill in planning and adjusting work operations to meet changing or emergency program or production requirements within available resources and with minimum sacrifice of quantity or quality of work.\n6. Skill in analyzing organizational and operational problems and developing timely and economical solutions. FOR GS-14:\n1. Mastery knowledge of US foreign policy objectives, the US alliance structure, USAF and DoD acquisition policies and their impact on international programs, and the DoD international agreements process.\n2. Expert skill in managing and coordinating complex activities in a multi-functional environment involving interaction with senior executive and management levels of the Air Force, DoD, and international customers.\n3. Expert ability to apply knowledge and experience to a wide range of other programs and issues with particular emphasis on international activity.\n4. Expert ability to communicate effectively, both orally and in writing, by preparing and presenting briefings and reports to senior US and foreign government officials.\n5. Ability to represent SAF/IA both within and outside SAF/IA to gain support for SAF/IAPC's program goals. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"103690.0","MaximumRange":"159286.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-14T00:00:00.0000","PositionEndDate":"2021-12-30T23:59:59.9970","PublicationStartDate":"2021-12-14T00:00:00.0000","ApplicationCloseDate":"2021-12-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below to view Eligibilities being considered and other IMPORTANT information. The primary purpose of this position is to perform professional level work in support of policy development and implementation at a senior level, analyzing DoD acquisition, security assistance, international armaments cooperation, national disclosure and other policy directives to determine impact on Air Force international security cooperation policies and programs.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"14","PromotionPotential":"14","OrganizationCodes":"DD/AF13","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","fed-excepted","disability","land","mspouse","peace","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win...Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Click here to view the AF Civilian Employment Eligibility Guide: 30 Percent or More Disabled VeteransAF DCIPS InterchangeAF Internal EmployeeDoD Transfer (Excluding Air Force)EO 12721 Certain Former Overseas EmployeesEO 13473 Appointment of Certain Military SpousesFormer Federal Employees (Reinstatement)Interagency Career Transition Assistance PlanLand Management EmployeeMilitary Spouse PreferenceNational Service (Peace Corps and VISTA)Non-AF DCIPS InterchangeNon-Appropriated FundNon-DoD TransferOther (Interchange Agreements)People with Disabilities, Schedule AVeterans Employment Opportunities Act","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["For GS-13:\n- Performs professional level work in support of policy development and implementation. - Develops strategies for the international agreements (IA) negotiation process, as appropriate, with representatives of allied governments. - Advises Team personnel on the final steps necessary for obtaining Office of the Secretary of Defense (OSD) authority to conclude the International Agreement. - Advises the Armaments Cooperation Division (SAF/IAPC), individual SAF/IA Country Directors, Director of Policy (SAF/IAP), the Deputy Under Secretary of the Air Force, International Affairs (SAF/IA) and other organizations regarding the technical and acquisition management aspects of current and potential international armaments cooperation programs. - Determines appropriate collaboration vehicle (i.e., Agreement, or Foreign Military Sales case) and carries out staffing actions appropriate at the Headquarters Air Force level to establish and successfully execute security cooperation program as a result of leading ICATs for proposed international projects and programs. For GS-14:\n- Performs professional level work in support of policy development and implementation at a senior level. - Develops strategies for the international agreements (IA) negotiation process, as appropriate, with representatives of allied governments. - Advises team personnel on the steps necessary for obtaining Office of the Secretary of Defense (OSD) authority to conclude the International Agreement. - Advises the Armaments Cooperation Division (SAF/IAPC), individual SAF/IA Country Directors, Director of Policy (SAF/IAP), the Deputy Under Secretary of the Air Force, International Affairs (SAF/IA) and other organizations regarding the technical and acquisition management aspects of current and potential international armaments cooperation programs. - Determines appropriate collaboration vehicle (i.e., Agreement, or Foreign Military Sales case) and carries out staffing actions as appropriate at the Headquarters Air Force level to establish and successfully execute security cooperation program as a result of leading ICATs for proposed international projects and programs."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. BASIS OF RATING:\nYour application will be rated under the Cut Point procedures based on the extent to which the quality, depth, and complexity of your experience and education relate to the qualification requirements. Additional points are not added for Veteran's Preference; however, Veteran's Preference is considered where applicable. Best Qualified Group: Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements\nFully Qualified Group: Candidates in this category possess good skills and experience above the minimum requirements.\nBasically Qualified Group: Candidates in this category meet the minimum education and/or experience requirements. The resume/documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. For additional information on what to include in your resume, click here. Applicants who meet the requirements for and apply as a non-competitive eligible that meet minimal qualifications and other requirements of this position, will be given consideration as a non-competitive candidate and will be referred unless blocked by an individual with priority/preference. APPRAISALS/AWARDS: Hiring Managers use objective methods and consider previous performance appraisals and awards in the selection process. Current Federal Civilian employees should list any relevant performance related rating and/or awards in your resume. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 12/30/2021 To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11326801 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes photographs (or links to social media), inappropriate material, inappropriate content, or personal information such as age, gender, religion, social security number, etc., you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application: Questionnaire Resume: For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. Current or Former Federal Civilian Employees (includes current Air Force employees): You must submit a legible copy of a SF-50, Notification of Personnel Action. The SF-50, block 24 must contain \"1\" or \"2\" AND block 34 must be a \"1\". Employees eligible under an OPM approved interchange agreement, block 34 may contain a \"1\" or \"2\". Promotion Consideration: If you wish to be considered as a promotion candidate and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one-year time-in-grade requirements. You will need to provide additional SF-50s which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-Grade, Grade/Range Increases, and SF-50s with an effective date more than one year old). ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service (honorable or general) and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt. OPTIONAL DOCUMENTS:\nPerformance Appraisals for Current Federal Civilian Employees - Most recent performance appraisals (dated within last 3 years) showing the official rating of record, signed by a supervisor, or statement why the performance appraisal is unavailable.\nAwards for Current Federal Civilian employees - List any awards received within the last 3 years on the resume.\nNote: Applicant must not submit award SF50s-Notification of Personnel Actions (SF50s).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. 120-Day Register: This announcement may result in a 120-day register that may be used to fill like vacancies for 120 days after the closing date. Applicants may be referred for consideration as vacancies occur. Military Spouse Preference (MSP) Eligible: MSP applicants, if determined best qualified, must be selected at the full performance level and placed at the full performance level. You must include a completed copy of the Military Spouse PPP Self-Certification Checklist dated within 30 days along with the documents identified on the checklist to verify your eligibility for MSP. Click here to obtain a copy of the Military Spouse PPP Self-Certification Checklist. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11326801. Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. Additionally, please do not disclose your vaccination status on your resume. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Top Secret","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"627408600","MatchedObjectDescriptor":{"PositionID":"NCAS214789957188","PositionTitle":"INTERPRETER (SIGN LANGUAGE)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/627408600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/627408600?PostingChannelID="],"PositionLocationDisplay":"Fort Belvoir, Virginia","PositionLocation":[{"LocationName":"Fort Belvoir, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Belvoir, Virginia","Longitude":-77.136185,"Latitude":38.68809}],"OrganizationName":"US Army Civilian Human Resources Agency","DepartmentName":"Department of the Army","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"2 YEARS","Code":"15319"}],"QualificationSummary":"Who May Apply: US Citizens In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Specialized Experience: One year specialized experience which includes: Serving as an American Sign Language interpreter as evidenced by certification by the National Registry of Interpreters for the Deaf or comparable state agency. Experience interpreting simultaneously and consecutively in English and interpreting and translating between deaf and non-deaf individuals in conversations, meetings, training sessions, interviews, or other requested events, both in-person and virtual on a variety of platforms.\nThis definition of specialized experience is typical of work performed at the second lower grade/level position in the federal service (GS-09).\nOR\nEducation: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree in a field which demonstrates the knowledge, skills, and abilities necessary to perform the work of the position. (Note: You must attach a copy of your transcripts.) .\nOR\nCombination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. You will be evaluated on the basis of your level of competency in the following areas: Attention to DetailOral CommunicationWritten Communication","PositionRemuneration":[{"MinimumRange":"72750.0","MaximumRange":"94581.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-17T00:00:00.0000","PositionEndDate":"2021-12-30T23:59:59.9970","PublicationStartDate":"2021-12-17T00:00:00.0000","ApplicationCloseDate":"2021-12-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: You will serve as an Interpreter(Sign Language) for the Talent Acquisition Division , Army Civilian Career Management Agency (ACCMA). This position is located in Fort Belvoir, Virginia. This is a TERM position. See Additional Information section of this announcement.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"11","HighGrade":"11","PromotionPotential":"11","OrganizationCodes":"DD/ARCH","Relocation":"False","HiringPath":["public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Army values diversity of perspectives, backgrounds, cultures and skills, which connects employees to organizations that are committed to building an inclusive work environment where they can contribute to their fullest potential.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Interprets and transliterates in a variety of communication modes for deaf and hard of hearing employees.","Provide simultaneous interpreting, consecutive interpreting, oral interpreting as well as gestured communication.","Develops and initiates training for hearing managers, supervisors, and employees including: sign language classes, how to use interpreters, how to use a telecommunication devise (TDD).","Performs a variety of management analyst and action officer functions to include conducting research, synthesis, and a variety of analysis; producing printed reports and products based on research and analysis.","Use different types of software (e.g. databases, graphics, word processing, spreadsheets, etc.) to process and produce a wide range of office automated products in support of the work."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Basis for Rating: Qualified candidates will be assigned to one of three quality categories: Best Qualified, Highly Qualified and Qualified. Veteran preference eligibles are listed ahead of non-preference eligibles within each quality category. Best Qualified. Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements for the announced position. Highly Qualified. Candidates in this category possess good skills and experience above the minimum requirements for the announced position. Qualified. Candidates in this category meet the minimum experience requirements for the announced position.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 12/30/2021 to receive consideration To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11327188). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on whether or not you are eligible for preference in federal employment. A complete description of preference categories and the associated required documents is in the Applicant Checklist (External). As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable This position requires a job-related license or certification. You MUST submit a copy of your license or certification with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct Deposit of Pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. This is a Career Program (CP) 60 - Foreign Affairs and Strategic Planning position. You may claim military spouse preference. If a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration. Salary includes applicable locality pay or Local Market Supplement. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest. This is a TERM position NTE 2 Years. May be extended to 6 years or converted to permanent without further competition. This position may be converted to permanent career or career -conditional appointment without further competition as long as all requirements are met. To be eligible for conversion, employee must complete at least 2 years of current continuous service under a term appointment in the competitive service AND employee must have a current performance rating under such term appointment of at least fully successful. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated time frame identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Not Required","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585167300","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-10XX-SPLASH","PositionTitle":"Information and Arts Family","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585167300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585167300?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"General Arts And Information","Code":"1001"},{"Name":"Museum Curator","Code":"1015"},{"Name":"Public Affairs","Code":"1035"},{"Name":"Language Specialist","Code":"1040"},{"Name":"Visual Information","Code":"1084"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public","fed-competitive","fed-excepted","disability","land","mspouse","peace","graduates","student","vet"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"628837300","MatchedObjectDescriptor":{"PositionID":"JCS-22-11314793","PositionTitle":"LANGUAGE SPEC","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/628837300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/628837300?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Organization of the Joint Chiefs of Staff","DepartmentName":"Department of Defense","SubAgency":"Operations (J3)","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"This position has INDIVIDUAL OCCUPATIONAL Requirements for the (1040) series: Undergraduate and Graduate Education: Major study -- the appropriate foreign language from an English-speaking college or university, English from a college or university in the other country, or translating or interpreting where English and the foreign language were prerequisites. -OR- General Experience: Knowledge of both English and the appropriate foreign language are required. This knowledge may be demonstrated through education, experience, or a combination of the two for entry level positions as listed below: English Three years of work experience requiring considerable use of English. A full 4-year course in a college or university in any subject where the instruction was primarily in English. Experience in speaking English where English was the second language in the high school system of a non-English speaking country. Foreign Language Experience in speaking or writing in the language because it was the language (a) in which the applicant was educated (through the high school level), (b) of the household, or (c) in which the applicant worked for a long period of time, including service in the Armed Forces. A full 4-year course in an accredited college or university in a country where the foreign language required for the position to be filled is the native language. Experience in translating, interpreting, or other work requiring the use of English and the other language; or a combination of work (that required English and the other language) and training at the Defense Language Institute, Foreign Service Institute, or comparable training. The following are examples of work in the required language that may have provided the required abilities: translator; interpreter; librarian or information specialist required to make abstracts, screen, index, and scan material; intelligence; writer or editor; international organizational work, such as the Peace Corps, World Bank, United Nations, business, or other organizations; or professor, teacher, or instructor work at the high school or college level that required use of the foreign language. Agencies may test applicants for foreign language proficiency on a pass/fail basis prior to appointment. Agencies must document the connection between the level of proficiency required and the duties of the position to be filled. Test material for applicants for the same position or grade level should be equally difficult, and should be selected from typical work-related documents. You may qualify at the GS-13, if you fulfill the following qualifications:\nOne year of specialized experience equivalent to the 12 grade level in the Federal service: Utilizes syntax, grammar, and spelling of both Russian and English to independently produce finished translations and documents of the Russian language; Knowledge of US intelligence, political, military, legal, and treaty related issues: scientific and technical, ecological, nuclear matters, and common societal issues; Reviews translation projects of other highly experienced Russian translators and military foreign area specialists/linguists to ensure continuity of translation style and terminology; Oversees operation of all Data Control Language circuits, Data Control Language (DCL) and MOLINK (Moscow/Washington Emergency Communications Link) related issues with flag/general officers and representatives of the Executive Branch. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"106823.0","MaximumRange":"138868.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-28T14:31:01.6530","PositionEndDate":"2022-01-04T23:59:59.9970","PublicationStartDate":"2021-12-28T14:31:01.6530","ApplicationCloseDate":"2022-01-04T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position is part of the Organization of the Joint Chiefs of Staff. The incumbent will be responsible for the operation of the Washington terminal of the President's \" Moscow Hotline\"\n.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"13","SubAgencyName":"Operations (J3)","OrganizationCodes":"DD/DD02","Relocation":"False","HiringPath":["fed-transition","fed-competitive","disability","mspouse","special-authorities","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"Mission Statement: The J-3 (Operations), supports the Chairman in carrying out responsibilities as the principal military advisor to the President and Secretary of Defense, developing and providing guidance to the combatant commanders and relaying communications between the President and the Secretary of Defense and the combatant commanders regarding current operations and plans","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As a LANGUAGE SPEC at the GS-1040-13 some of your typical work assignments may include: Provide written and oral sight translations of head-of-state communiques. Prepare, formats, dispatches, receives and processes head of state communiques via multiple communications links. Oversee the operation and maintenance of multiple communication links to the Kremlin, to include operator terminals, communications control and switching equipment. Develops and presents briefings to foreign dignitaries, military officials. and numerous high-level delegations at the CJCS/VCJCS/SECDEF level. Develops and coordinates an authoritative US Government policy/position for bilateral technical-expert's meetings with representatives from the Presidential Communications Directorate of the Russian Federation and the Ministry of Defense. Serves as one of five translators to man the HOTLINE around the clock in rotating shifts in order to provide rapid or time sensitive oral, sight, and written translations of political communiques, military and other technical, scientific or general translations to the President and designated select Executive Branch (NSA/Director White House Situation Room, etc.) or Senior DoD officials (SecDef, CJCS)."],"Education":"This position has INDIVIDUAL OCCUPATIONAL Educational Requirements for the (1040) series: Undergraduate and Graduate Education: Major study -- the appropriate foreign language from an English-speaking college or university, English from a college or university in the other country, or translating or interpreting where English and the foreign language were prerequisites. English A full 4-year course in a college or university in any subject where the instruction was primarily in English. Foreign Language A full 4-year course in an accredited college or university in a country where the foreign language required for the position to be filled is the native language. *NOTE: Failure to provide transcripts will result in you being rated ineligible for this position.","Requirements":"","Evaluations":"Once the application process is complete, your resume and supporting documentation will be used to determine whether you meet the job qualifications listed on this announcement. If you are minimally qualified for this job, your resume and supporting documentation will be compared to your responses on the Occupational Questionnaire. If you rate yourself higher than is supported by your application materials, your responses may be adjusted and/or you may be excluded from consideration for this job. If you are found to be among the top candidates, you will be referred to the selecting official for employment consideration. Your qualifications will be evaluated on the following competencies (knowledge, skills, abilities and other characteristics): Competencies:\nAdministration and ManagementBusiness AnalysisCommunicationLanguage ServicesOrganizational Awareness Military Spouse Preference: If you are entitled to military spouse preference, in order to receive this preference you must choose the spousal eligibility in your application package referencing MSP Military Spouse Preference. Your preference entitlement will be verified by the employing agency. To claim Military Spouse Preference (MSP) please complete the Military Spouse PPP Self-Certification Checklist, save the document and attach it to your application package.","HowToApply":"To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below. The complete application package must be submitted by 11:59 PM (EST) on the closing date to receive consideration. To begin, click Apply Online to access an online application. Follow the prompts to select your USAJOBS resume and/or other supporting documents. You will need to be logged into your USAJOBS account or you may need to create a new account. You will be taken to an online application. Complete the online application, verify the required documentation, and submit the application. You will receive an email notification when your application has been received for the announcement. To verify the status of your application, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the More Information link for this position. The Application Status page will display the status of your application, the documentation received and processed, and your responses submitted to the online application. Your uploaded documents may take several hours to clear the virus scan process. To preview the questionnaire, please go to https://apply.usastaffing.gov/ViewQuestionnaire/11314793.","WhatToExpectNext":"Once your online application is submitted you will receive a confirmation notification by email. Your application will be evaluated. You will receive another notification about the status of your application. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. All applicants must meet qualifications and eligibility criteria by the closing date of the announcement. This announcement may be used to fill additional vacancies.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Your complete application includes your COMPLETE resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. The following documents are REQUIRED\n1. Your resume: Your resume may be submitted in any format. It must include your name and contact information and support the specialized experience described in this announcement. For qualifications determinations your resume must contain the number of hours worked per week and the dates of employment (i.e.,\" HRS per week and month/year\" or \"HRS per week and month/year to present\"). For additional information see: What to include in your resume. 2. Transcripts Required This position has a degree or education requirement so you are required to submit a copy of your transcript. 3. SF50 (If applicable) All current and former civilian Federal employees must submit a copy of your Most recent or last SF50 (Notification of Personnel Action) showing your tenure, grade and step, salary, and type of position occupied (i.e., Excepted or Competitive); or similar Notification of Personnel Action documentation, i.e., Transcript of Service, Form 1150, etc. 3. Veteran's Documents If applying using veteran's preference or under a Veteran's hiring authority you must submit the following documents: DD214 showing character of service, SF-15 Form and VA letter showing final percentage, or certification of expected discharge or release from active duty. PLEASE REVIEW THE BELOW LINK FOR OTHER SUPPORTING DOCUMENTS needed for proof of eligibility: https://www.dla.mil/Portals/104/Documents/Careers/downloads/FourthEstateRequiredSupportingDocumentation%205-4-2020.pdf?ver=2020-05-07-140551-783 If you are claiming Military Spouse Preference, you must submit supporting documents with your application package. These documents must provide acceptable information to verify: you reside within the commuting area of your sponsor's permanent duty station (PDS); proof of marriage to the active duty sponsor, proof of military member's active duty status, and other documentation required by the vacancy announcement to which you are applying; and must meet all pre-employment criteria and be eligible for immediate noncompetitive appointment to a position in the competitive service. Documentation required: Marriage Certificate or License, Signed Self-Certification Checklist, Veterans' Preference documentation (e.g., DD-214, VA Letter, Statement of Service, if applicable), Transcripts (if applicable). Additional documentation required if previously held a federal position: SF-50s (e.g., LWOP, highest grade held, overseas appointments, etc.), SF-75 Information, and documentation of performance rating of record (dated within the last 12 months)","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Veterans Employment Opportunity Act (VEOA): To be eligible for a VEOA appointment under Merit Promotion procedures, the veteran must be a preference eligible or a veteran separated after 3 years or more of continuous active service performed under honorable conditions. Interagency Career Transition Assistance Programs: This program applies to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet ICTAP eligibility criteria; 2) be rated well-qualified for the position; Well qualified is defined as possessing the type and quality of experience that exceeds the positions minimum qualifications. and 3) submit the appropriate documentation to support your ICTAP eligibility. For more information: https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/. Noncompetitive Appointment Authorities: For more information on noncompetitive appointment authority eligibility requirements:\nPersons with Disabilities - Schedule A\nSpecial Hiring Authority for Veterans Special Hiring Authority for Certain Military Spouses\nOther Special Appointment Authorities\nMales born after 12-31-59 must be registered or exempt from Selective Service (see https://www.sss.gov/RegVer/wfRegistration.aspx The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision.\nNOTE: Declining to be interviewed or failure to report for a scheduled interview will be considered as a declination for further consideration for employment against this vacancy. Selective Service Requirement: Please visit http://www.sss.gov for more information. For more information, please visit https://www.dla.mil/Portals/104/Documents/Careers/downloads/DoDGenAppInfo.pdf Other Notes:\nRe-employed Annuitant: This position DOES NOT meet criteria for re-employed annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at:\nhttp://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf Status candidates must meet time-in-grade requirements (52 weeks at the next lower grade level). COVID19 -Pursuant to EO 14043, all Federal employees, regardless of duty location or work arrangement, must be fully vaccinated for COVID-19 by November 22, 2021, or before entrance on duty if after November 22, subject to exceptions as required by law. Proof of vaccination will be required. To ensure compliance with this mandate, review the vaccination requirements, to include timelines for receiving required doses, at the following: https://www.saferfederalworkforce.gov/faq/vaccinations/","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DHRS-D-JCS@dla.mil","AgencyContactPhone":"614-692-2646","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"628839000","MatchedObjectDescriptor":{"PositionID":"JCS-22-11314795-DE","PositionTitle":"LANGUAGE SPECIALIST","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/628839000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/628839000?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Organization of the Joint Chiefs of Staff","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Language Specialist","Code":"1040"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"This position has INDIVIDUAL OCCUPATIONAL Requirements for the (1040) series: Undergraduate and Graduate Education: Major study -- the appropriate foreign language from an English-speaking college or university, English from a college or university in the other country, or translating or interpreting where English and the foreign language were prerequisites. -OR- General Experience: Knowledge of both English and the appropriate foreign language are required. This knowledge may be demonstrated through education, experience, or a combination of the two for entry level positions as listed below: English Three years of work experience requiring considerable use of English. A full 4-year course in a college or university in any subject where the instruction was primarily in English. Experience in speaking English where English was the second language in the high school system of a non-English speaking country. Foreign Language Experience in speaking or writing in the language because it was the language (a) in which the applicant was educated (through the high school level), (b) of the household, or (c) in which the applicant worked for a long period of time, including service in the Armed Forces. A full 4-year course in an accredited college or university in a country where the foreign language required for the position to be filled is the native language. Experience in translating, interpreting, or other work requiring the use of English and the other language; or a combination of work (that required English and the other language) and training at the Defense Language Institute, Foreign Service Institute, or comparable training. The following are examples of work in the required language that may have provided the required abilities: translator; interpreter; librarian or information specialist required to make abstracts, screen, index, and scan material; intelligence; writer or editor; international organizational work, such as the Peace Corps, World Bank, United Nations, business, or other organizations; or professor, teacher, or instructor work at the high school or college level that required use of the foreign language. Agencies may test applicants for foreign language proficiency on a pass/fail basis prior to appointment. Agencies must document the connection between the level of proficiency required and the duties of the position to be filled. Test material for applicants for the same position or grade level should be equally difficult, and should be selected from typical work-related documents. You may qualify at the GS-13, if you fulfill the following qualifications: A. One year of specialized experience equivalent to the GS- 12 grade level in the Federal service: Utilizes syntax, grammar, and spelling of both Russian and English to independently produce finished translations and documents of the Russian language; Knowledge of US intelligence, political, military, legal, and treaty related issues: scientific and technical, ecological, nuclear matters, and common societal issues; Reviews translation projects of other highly experienced Russian translators and military foreign area specialists/linguists to ensure continuity of translation style and terminology; Oversees operation of all Data Control Language circuits, Data Control Language (DCL) and MOLINK (Moscow/Washington Emergency Communications Link) related issues with flag/general officers and representatives of the Executive Branch. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"106823.0","MaximumRange":"138868.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-28T13:43:11.0070","PositionEndDate":"2022-01-04T23:59:59.9970","PublicationStartDate":"2021-12-28T13:43:11.0070","ApplicationCloseDate":"2022-01-04T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position is part of the Organization of the Joint Chiefs of Staff. The incumbent will be responsible for the operation of the Washington terminal of the President's \" Moscow Hotline\".","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"13","OrganizationCodes":"DD/DD02","Relocation":"False","HiringPath":["fed-transition","mspouse","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Mission Statement: The J-3 (Operations), supports the Chairman in carrying out responsibilities as the principal military advisor to the President and Secretary of Defense, developing and providing guidance to the combatant commanders and relaying communications between the President and the Secretary of Defense and the combatant commanders regarding current operations and plans.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As a LANGUAGE SPECIALIST at the GS-1040-13 some of your typical work assignments may include: Provide written and oral sight translations of head-of-state communiques. Prepare, formats, dispatches, receives and processes head of state communiques via multiple communications links. Oversee the operation and maintenance of multiple communication links to the Kremlin, to include operator terminals, communications control and switching equipment. Develops and presents briefings to foreign dignitaries, military officials. and numerous high-level delegations at the CJCS/VCJCS/SECDEF level. Develops and coordinates an authoritative US Government policy/position for bilateral technical-expert's meetings with representatives from the Presidential Communications Directorate of the Russian Federation and the Ministry of Defense. Serves as one of five translators to man the HOTLINE around the clock in rotating shifts in order to provide rapid or time sensitive oral, sight, and written translations of political communiques, military and other technical, scientific or general translations to the President and designated select Executive Branch (NSA/Director White House Situation Room, etc.) or Senior DoD officials (SecDef, CJCS)."],"Education":"NOTE: Failure to provide transcripts will result in you being rated ineligible for this position. Substitution of education may not be used in lieu of specialized experience for this grade level. Unofficial transcripts are acceptable at time of application. All materials must be submitted by the closing date of the announcement. GRADUATE EDUCATION: One academic year of graduate education is considered to be the number of credits hours that your graduate school has determined to represent one academic year of full-time study. Such study may have been performed on a full-time or part-time basis. If you cannot obtain your graduate school's definition of one year of graduate study, 18 semester hours (or 27 quarter hours) should be considered as satisfying the requirement for one year of full-time graduate study. FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: Foreign Education","Requirements":"","Evaluations":"We will review your resume and supporting documents, to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and evaluate your relevant work experiences as it relates to fundamental competencies, identified below, required for this position. Competencies:\nAdministration and ManagementBusiness AnalysisCommunicationLanguage ServicesOrganizational Awareness Based on the results of this evaluation, you will be placed in one of the following quality categories: Best Qualified: This highest category will be used for those candidates who possess the type and quality of experience that substantially exceeds the minimum qualifications of the position, including any selective placement factors and/or appropriate quality ranking factor(s), as determined by the job analysis.\nHighly Qualified: This higher category will be used for those candidates who possess the type and quality of experience that exceed the minimum qualifications of the position, including any selective placement factors and/or appropriate quality ranking factor(s) as determined by the job analysis.\nQualified: This lowest category will be used for those candidates that meet the minimum qualifications of the position, including all selective placement factors and appropriate quality ranking factor(s) and are proficient in some, but not all, of the requirements of the position. Candidates may require extensive training and/or orientation in order to satisfactorily perform the duties of the position. https://www.opm.gov/policy-data-oversight/hiring-information/competitive-hiring/#url=Category-Rating Names of the candidates in the Best Qualified category will be sent first to the hiring manager for employment consideration. Applicants in other categories will be referred in accordance with category rating procedures. Veterans Preference: If you are entitled to veterans preference, you should indicate the type of veterans' preference you are claiming on your resume. Your veterans' preference entitlement will be verified by the employing agency. If you are entitled to veterans' preference and qualified for the position, your name will be placed above non-preference candidates on a list sent to the hiring manager for employment consideration. Qualified veterans' preference eligible with a service-connected disability of 10% or more will be listed at the top of the highest quality category depending on the position and grade level of the job.\nFor information on entitlement see http://www.fedshirevets.gov/job/vetpref/index.aspx. Military Spouse Preference: If you are entitled to military spouse preference, in order to receive this preference you must choose the spousal eligibility in your application package referencing MSP Military Spouse Preference. Your preference entitlement will be verified by the employing agency. If you are claiming military spouse preference and qualified for the position, your name will be placed below preference eligible veteran candidates and above non-preference candidates on a list sent to the hiring manager for employment consideration. To claim Military Spouse Preference (MSP) please complete the Military Spouse PPP Self-Certification Checklist, save the document and attach it to your application package.","HowToApply":"To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below. The complete application package must be submitted by 11:59 PM (EST) on the closing date to receive consideration. To begin, click Apply Online to access an online application. Follow the prompts to select your USAJOBS resume and/or other supporting documents. You will need to be logged into your USAJOBS account or you may need to create a new account. You will be taken to an online application. Complete the online application, verify the required documentation, and submit the application. You will receive an email notification when your application has been received for the announcement. To verify the status of your application, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the More Information link for this position. The Application Status page will display the status of your application, the documentation received and processed, and your responses submitted to the online application. Your uploaded documents may take several hours to clear the virus scan process. To preview the questionnaire, please go to https://apply.usastaffing.gov/ViewQuestionnaire/11314795.","WhatToExpectNext":"Once you successfully complete the application process, you will receive a notification of receipt. Your application package will be reviewed to ensure you meet the basic eligibility and qualifications requirements, and you will receive a notification. A review will be made of your online questionnaire and the documentation you submitted to support your responses. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc).\nYour complete application includes your COMPLETE resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. The following documents are REQUIRED:\n1. Your resume: Your resume may be submitted on any format. It must include your name and contact information and support the specialized experience described in this announcement. For qualifications determinations your resume must contain the number of hours worked per week and the dates of employment (i.e., \"HRS per week and month/year to month/year\" or \"HRS per week and month/year to present\"). For additional information see: What to include in your resume 2. Transcripts: This position has a degree or education requirement so you are required to submit a copy of your transcript We accept unofficial transcripts, as long as they contain your name, the name of the school, the date and degree that was awarded, and the list of classes and credits earned. 3. Veteran's Documents: If applying using veteran's preference or under a Veteran's hiring authority you must submit the following documents DD214 showing character of service, SF-15 Form and VA letter showing final percentage, or certification of expected discharge or release from active duty. PLEASE REVIEW THE BELOW LINK FOR OTHER SUPPORTING DOCUMENTS needed for proof of eligibility: https://www.dla.mil/Portals/104/Documents/Careers/downloads/FourthEstateRequiredSupportingDocumentation%2011-16-2020.pdf?ver=Lgkkn1HW9a8is7V2lyCS2Q%3d%3d If you are claiming Military Spouse Preference, you must submit supporting documents with your application package. These documents must provide acceptable information to verify: you reside within the commuting area of your sponsor's permanent duty station (PDS); proof of marriage to the active duty sponsor, proof of military member's active duty status, and other documentation required by the vacancy announcement to which you are applying; and must meet all pre-employment criteria and be eligible for immediate noncompetitive appointment to a position in the competitive service. Documentation required: Marriage Certificate or License, Signed Self-Certification Checklist, Veterans' Preference documentation (e.g., DD-214, VA Letter, Statement of Service, if applicable), Transcripts (if applicable). Additional documentation required if previously held a federal position: SF-50s (e.g., LWOP, highest grade held, overseas appointments, etc.), SF-75 Information, and documentation of performance rating of record (dated within the last 12 months) For More Information: https://www.dla.mil/Portals/104/Documents/Careers/downloads/DoDGenAppInfo.pdf","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID-19: Pursuant to EO 14043, all Federal employees, regardless of duty location or work arrangement, must be fully vaccinated for COVID-19 by November 22, 2021, or before entrance on duty if after November 22, subject to exceptions as required by law. Proof of vaccination will be required. To ensure compliance with this mandate, review the vaccination requirements, to include timelines for receiving required doses, at the following: https://www.saferfederalworkforce.gov/faq/vaccinations/ Re-employed Annuitant: This position does not meet criteria for re-employed annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at: http://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/1400.25-V300.pdf All applicants must meet qualifications and eligibility criteria by the closing date of the announcement. Interagency Career Transition Assistance Programs: This program applies to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet ICTAP eligibility criteria; 2) be rated well-qualified for the position; Well qualified is defined as possessing the type and quality of experience that exceeds the positions minimum qualifications. and 3) submit the appropriate documentation to support your ICTAP eligibility. For more information:\nhttps://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DEApplicantInquiries@dla.mil","AgencyContactPhone":"614-692-0420","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"628004300","MatchedObjectDescriptor":{"PositionID":"EUHR214853663734","PositionTitle":"Foreign Affairs Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/628004300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/628004300?PostingChannelID="],"PositionLocationDisplay":"Stuttgart, Germany","PositionLocation":[{"LocationName":"Stuttgart, Germany","CountryCode":"Germany","CityName":"Stuttgart, Germany","Longitude":9.17192,"Latitude":48.7677}],"OrganizationName":"Joint Activities","DepartmentName":"Department of the Army","SubAgency":"HQ US Africa Command - J5","JobCategory":[{"Name":"Foreign Affairs","Code":"0130"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Excepted Service Overseas Family Member AppointmentFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Basic Requirement for Foreign Affairs Specialist: A. Degree: Bachelor's degree (or higher degree) with a major or equivalent, or a combination of courses totaling at least 24 semester hours, in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; OR 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods.OR B. Combination of Education and Experience: Courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, as shown in A above, plus appropriate experience or additional education. OR C. Experience: Four years of appropriate experience in one or more of the fields, as shown in A above, in work associated with international organizations, problems, or other aspects of foreign affairs. In addition to meeting the basic requirement above, to qualify for this position you must also meet the qualification requirements listed below:\nSpecialized Experience: One year of specialized experience which includes 1) providing professional recommendations to senior decision makers on national security processes; AND 2) developing security cooperation prioritization and planning for assigned countries; AND 3) preparing professional briefings and/or executive correspondence. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-12). You will be evaluated on the basis of your level of competency in the following areas:\nIntegration, Outreach & CollaborationInternational Engagement Action PlanningInternational Engagement Assessment & AnalysisInternational Engagement Policy DevelopmentResource and Program Management Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-12).","PositionRemuneration":[{"MinimumRange":"79468.0","MaximumRange":"103309.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-21T08:01:52.3970","PositionEndDate":"2022-01-03T23:59:59.9970","PublicationStartDate":"2021-12-21T08:01:52.3970","ApplicationCloseDate":"2022-01-03T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: This position is for a Political Military Desk Officer within the Multinational Cooperation Center of the Strategy, Engagement, and Programs Directorate, J5 at U.S. Africa Command in Stuttgart, Germany.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"13","HighGrade":"13","PromotionPotential":"None","SubAgencyName":"HQ US Africa Command - J5","OrganizationCodes":"DD/ARJA","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","land","mspouse","vet"],"TotalOpenings":"1","AgencyMarketingStatement":"*COVID-19 has severely limited available child care services in the Stuttgart Military Community. At this time, and for the foreseeable future, only the children of military service members can be accommodated in on-base child care facilities. In addition, in some Stuttgart-area communities, host-nation child care providers are not able to accommodate the children of U.S. Citizens in their programs. Applicants with child care requirements are encouraged to research options prior to accepting job offers. Child care needs will not be a factor in the selection process.*\nUnited States Africa Command USAFRICOM, is one of six geographic combatant commands and is responsible to the Secretary of Defense for military relations with African nations, the African Union, and African regional security organizations. Responsible for all operations, exercises, and security cooperation on the African continent. The mission of USAFRICOM, in concert with interagency and international partners, is to build defense capabilities, respond to crisis, and deter and defeat transnational threats in order to advance U.S. national interests and promote regional security, stability, and prosperity. USAFRICOM recognizes a diverse workforce as our differences in life experiences and cultural backgrounds brings us together by promoting innovative solutions towards common goals. We encourage talented individuals from all communities and segments of our society to apply.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Ensure that U. S. Africa Command (USAFRICOM) programs and policies in the Area of Responsibility (AOR) are aligned with USAFRICOM and U.S. Government (USG) strategic objectives.","Synchronize proposed security cooperation activities in assigned allied/partner nation states and provide branch/division chief with concise and thorough recommendations to approve or deny each activity.","Apply the national security strategy, campaign plan, security objectives, integrated country strategy (ICS) to develop effective engagement plans.","Review requests for funding of programs to ensure that the activity plans align with the mission.","Host conferences on assigned region and assist other directorates with planning and conducting various studies."],"Education":"","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. The selecting official has requested a competitive and noncompetitive candidate list for this vacancy. If you are eligible for the noncompetitive list, you will be evaluated on basic and/or minimum qualifications, as applicable. While required to answer the assessment questions, non-competitive candidates will not be evaluated against the competitive rating and ranking criteria. The selecting official may select from any of the candidate lists. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 01/03/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11313734). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. If an employee brings a child to an overseas location and that child is entitled to attend a DoD school on a space-required basis in accordance with DoDEA Regulation 1342.13, the DoDEA and the Military Department responsible for providing related services will ensure that the child, if eligible for special education, receives a free appropriate public education, including related services pursuant to DoDI 1342.12 and DoDM 1342.12. If an employee brings an infant or toddler (up to 3 years of age) to an overseas location, and that infant or toddler, but for the child's age, is entitled to attend the DoDEA on a space-required basis in accordance with DoDEA Regulation 1342.13, then the Military Department responsible for EIS will provide the infant or toddler with the required EIS in accordance with the eligibility criteria consistent with DoDI 1342.12 and DoDM 1342.12. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs/Strategic Planning position. The initial length of this overseas tour is 36 months. Defense National Relocation Program will not be authorized. Multiple positions may be filled from this announcement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"628746600","MatchedObjectDescriptor":{"PositionID":"EUHR214878267406","PositionTitle":"Supervisory International Political-Military Affairs Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/628746600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/628746600?PostingChannelID="],"PositionLocationDisplay":"Stuttgart, Germany","PositionLocation":[{"LocationName":"Stuttgart, Germany","CountryCode":"Germany","CityName":"Stuttgart, Germany","Longitude":9.17192,"Latitude":48.7677}],"OrganizationName":"Joint Activities","DepartmentName":"Department of the Army","SubAgency":"United States Africa Command (US AFRICOM), J5","JobCategory":[{"Name":"International Relations","Code":"0131"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Defense Civilian Intelligence Personnel System (DCIPS) Interchange AgreementExcepted Service Overseas Family Member AppointmentFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentNon-Department of Defense (DoD) TransferReinstatementVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. BASIC REQUIREMENT OR INDIVIDUAL OCCUPATIONAL REQUIREMENT:\nDegree: major or equivalent, or a combination of courses totaling at least 24 semester hours in international law and international relations, political science, economics, history, sociology, geography, social or cultural anthropology, law, statistics, or in the humanities; or 12 semester hours in one of the above disciplines and 12 semester hours in statistics/quantitative methods. NOTE: You must submit a copy of your transcripts with your application. OR Combination of education and experience: courses equivalent to a major, or a combination of related courses totaling at least 24 semester hours, in one or more of the social sciences, or in the humanities, as shown in A above, plus appropriate experience or additional education. OR Experience: four years of appropriate experience in one or more of the fields listed above in work associated with international organizations, problems, or other aspects of foreign affairs. SPECIALIZED EXPERIENCE: One year of specialized experience which includes: 1) Advising on political-military affairs policy matters pertaining to Area of Responsibility; 2) leading efforts to synchronize strategies that support the military international activities mission; AND 3) delivering informational briefings and presentations on engagement activities and political-military topics. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-13). Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted. You will be evaluated on the basis of your level of competency in the following areas:\nLeadershipOral CommunicationStrategic ThinkingTechnical Competence Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-13).","PositionRemuneration":[{"MinimumRange":"95973.0","MaximumRange":"124764.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-28T00:00:00.0000","PositionEndDate":"2022-01-10T23:59:59.9970","PublicationStartDate":"2021-12-28T00:00:00.0000","ApplicationCloseDate":"2022-01-10T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: As a Supervisory International Political-Military Affairs Specialist, you will serve as the Deputy Division Chief for a Regional Engagement Division (RED). You will be responsible for overseeing a staff of military Foreign Area Officers (FAO) and civilian International Political-Military Affairs Specialists. The RED is the primary conduit of information flow between the USAFRICOM staff and military personnel assigned to various U.S. Embassies in Africa.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"14","HighGrade":"14","PromotionPotential":"None","SubAgencyName":"United States Africa Command (US AFRICOM), J5","OrganizationCodes":"DD/ARJA","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","land","mspouse","vet","fed-excepted"],"TotalOpenings":"1","AgencyMarketingStatement":"*COVID-19 has severely limited available child care services in the Stuttgart Military Community. At this time, and for the foreseeable future, only the children of military service members can be accommodated in on-base child care facilities. In addition, in some Stuttgart-area communities, host-nation child care providers are not able to accommodate the children of U.S. Citizens in their programs. Applicants with child care requirements are encouraged to research options prior to accepting job offers. Child care needs will not be a factor in the selection process.* United States Africa Command USAFRICOM, is one of six geographic combatant commands and is responsible to the Secretary of Defense for military relations with African nations, the African Union, and African regional security organizations. Responsible for all operations, exercises, and security cooperation on the African continent. The mission of USAFRICOM, in concert with interagency and international partners, is to build defense capabilities, respond to crisis, and deter and defeat transnational threats in order to advance U.S. national interests and promote regional security, stability, and prosperity. USAFRICOM recognizes a diverse workforce as our differences in life experiences and cultural backgrounds brings us together by promoting innovative solutions towards common goals. We encourage talented individuals from all communities and segments of our society to apply.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Maintain political-military oversight on assigned African countries and regions, and provides outlook and recommendations to USAFRICOM staff, DoD Joint Staff and Office of the SECDEF, and Department of State and other interagency colleagues.","Provide regional guidance on security cooperation issues to the RED Division Chief, J5 Director and Commander, USAFRICOM and other senior leadership.","Plan division work tasks to be accomplished, sets priorities, prepares schedules, and tracks assigned work to completion.","Perform full range of supervisory responsibilities including assigning and reviewing work, approving leave and work schedules, evaluating subordinates, and giving advice, counsel, and instruction to employees on both work and administrative matters.","Use expertise and contacts to implement the pol-mil aspects of the Commander, USAFRICOM's Theater Strategy, Theater Campaign Plan, and other overarching strategic documents.","Supports and coordinates engagement activities in accordance with the USAFRICOM Theater Engagement Plan, including conferences, exercises, peace talks, treaty negotiations and other special political-military functions."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&eacute;sum&eacute; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&eacute;sum&eacute; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. The selecting official has requested a competitive and noncompetitive candidate list for this vacancy. If you are eligible for the noncompetitive list, you will be evaluated on basic and/or minimum qualifications, as applicable. While required to answer the assessment questions, non-competitive candidates will not be evaluated against the competitive rating and ranking criteria. The selecting official may select from any of the candidate lists. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 01/10/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11307406). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist (Outside the Continental United States) and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Direct deposit of pay is required. U.S. citizens overseas under ordinarily resident status are not eligible for appointment under the Status of Forces Agreement. Locality pay does not apply in the overseas area. If an employee brings a child to an overseas location and that child is entitled to attend a DoD school on a space-required basis in accordance with DoDEA Regulation 1342.13, the DoDEA and the Military Department responsible for providing related services will ensure that the child, if eligible for special education, receives a free appropriate public education, including related services pursuant to DoDI 1342.12 and DoDM 1342.12. If an employee brings an infant or toddler (up to 3 years of age) to an overseas location, and that infant or toddler, but for the child's age, is entitled to attend the DoDEA on a space-required basis in accordance with DoDEA Regulation 1342.13, then the Military Department responsible for EIS will provide the infant or toddler with the required EIS in accordance with the eligibility criteria consistent with DoDI 1342.12 and DoDM 1342.12. Employees (and family members) who require medical or dental care in the overseas location will be responsible for obtaining and paying for such care. Access for civilian employees and their families to military medical and dental treatment facilities is on a space-available and reimbursable basis only. Pay retention may be offered to selected applicants for positions at overseas locations. Pay retention will not be offered as an incentive for employees moving between overseas positions. Selectees may receive certain foreign area benefits such as: Living Quarters Allowance (LQA) or government quarters, home leave, etc. Selectees will have their eligibility for foreign area benefits determined at the time of hire in accordance with Department of State Standardized Regulation (DSSR) and DoDI 1400.25 volume 1250. For positions in a foreign country, that country's laws or international agreements may have a direct impact on the ability of an employee's same sex domestic partner or spouse to accompany the employee and receive certain benefits. If you believe you may be affected by these laws and agreements, you should familiarize yourself with relevant information and direct questions concerning a specific country (Foreign Duty Location) to the appropriate Army Human Resources point of contact prior to the acceptance of employment and your entrance on duty. This is a Career Program (CP) 60 - Foreign Affairs and Strategic Planning position. The initial length of this overseas tour is 36 months. Multiple positions may be filled from this announcement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is authorized, subject to the provisions of the Joint Travel Regulations.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}