{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":12,"SearchResultCountAll":12,"SearchResultItems":[{"MatchedObjectId":"639312800","MatchedObjectDescriptor":{"PositionID":"NRO-22-11405645-DISL","PositionTitle":"PRINCIPAL DEPUTY, DIRECTOR SYSTEMS ENGINEERING DIRECTORATE","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639312800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639312800?PostingChannelID="],"PositionLocationDisplay":"Chantilly, Virginia","PositionLocation":[{"LocationName":"Chantilly, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Chantilly, Virginia","Longitude":-77.43992,"Latitude":38.883312}],"OrganizationName":"National Reconnaissance Office","DepartmentName":"Department of Defense","JobCategory":[{"Name":"General Engineering","Code":"0801"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Intelligence Community (IC) Senior Officer Core Qualification (SOCQ) - Leading the Intelligence Enterprise: Required for all senior executive positions effective 1 October 2010. This SOCQ involves the ability to integrate resources, information, interests, and activities effectively in support of the IC's mission and to lead and leverage cross organizational collaborative networks to achieve significant mission results. Inherent to this Standard is a deep understanding of the Intelligence enterprise (or other comparable interagency or multi-organizational environment) and a shared commitment to the IC's core values. Please limit your written statements to no more than one page per ICSOCQ. IC Senior Officers have a responsibility to share information and knowledge to achieve results, in that regard are expected to build effective networks and alliances; actively engage these peers and stakeholders; involve them in key decision; and effectively leverage these networks to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must: 1. Collaboration and Integration: Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes. Integrate joint/multi-agency activities effectively exercising collaborative plans that realize mutual IC, joint, or multi-organizational goals. 2. Enterprise Focus: IC Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information and other inputs to effectively integrate and align component, IC, and the United States Government interests and activities to achieve IC-wide, national, and international priorities. Senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce enterprise focus among their subordinates. Candidates assessed against the component must: Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi-organizational mission accomplishment. Understand how organizations, resources, information, and processes within the IC interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems. 3. Values-Centered Leadership: IC Senior officers are expected to personally embody, advance and reinforce IC core values. Senior officers are expected to demonstrate and promote departmental and/or component values. Candidates assessed against this competency must demonstrate: A Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties. The Integrity and Courage(moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk. Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. Promote, reinforce, and reward IC, departmental/component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values. Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. AND TECHNICAL QUALIFICATIONS (TQ): All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. Please limit your written statements to not to exceed a total of 2 pages per statement per technical qualification. These statements need to be separate from your resume. 1. Demonstrated. knowledge and understanding of the NRO Enterprise (ground, communications and space), NRO mission architectures and operations, and the unique mission attributes of the NRO. 2. Exemplary strategic partnership building skills to forge enduring organizational relationships across the NRO and with executives and technical experts from the DoD, IC, industry, and academia. 3. Expert knowledge in leading and advocating for systems engineering excellence and innovation to advance the state-of-the-art and enable the development, design, operation, and improvement of products and services supporting critical user mission requirements. 4. A strong working knowledge of the DoD and ICs ISR missions/structures, policies, and strategic visions. Acquisition information: This is a Critical Acquisition Position (CAP) and has been designated as a Key Leadership Position which carries significant responsibility, primarily involving supervisory or managerial duties in acquisition. A 3 year tenure agreement is required for the position. The incumbent must meet the Defense Acquisition Workforce Improvement Act (DAWJA) requirements cited below, unless a waiver is granted by the AF Senior Acquisition Executive (SAE).\n- Level III certification in Program Management or Systems Planning, Research, Development and Engineering (SPRDE) or can be obtained within 24 months. ?????- 10 years of acquisition experience or equivalent, 4 of which were in a CAP or equivalent position.","PositionRemuneration":[{"MinimumRange":"157393.0","MaximumRange":"186878.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-24T17:08:08.6570","PositionEndDate":"2022-03-09T23:59:59.9970","PublicationStartDate":"2022-02-24T17:08:08.6570","ApplicationCloseDate":"2022-03-09T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Mission Statement The National Reconnaissance Office (NRO) is the U.S. Government agency in charge of designing, building, launching, and maintaining America's intelligence satellites. Whether creating the latest innovations in satellite technology, contracting with the most cost-efficient industrial supplier, conducting rigorous launch schedules, or providing the highest-quality products to our customers, we never lose focus on who we are working to protect our Nation and its citizens.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/DD82","Relocation":"False","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"This position is in the Excepted Service under Title 10, Defense Civilian Intelligence Personnel System. Excepted Service includes all positions in the Executive Branch of the Federal Government which are specifically excepted from the competitive service by or pursuant to statute, by the President, or by the Office of Personnel Management.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["As the PRINCIPAL DEPUTY, DIRECTOR SYSTEMS ENGINEERING DIRECTORATE you will be responsible for: establishment of the strategic direction of SED, ensuring joint agency personnel are appropriately managed and mentored, and overseeing acquisition and upgrades to the integrated worldwide network of NRO satellites represents NRO Systems Engineering program priorities, developments and other initiatives to senior members of the DNI and its mission partners; establishes and maintains working relationships with top- level personnel of these organizations in order to influence community systems engineering policy, architecture, and standards to enable the NRO to meet IC and DoD mission requirements active member of the NRO Board of Directors and other NRO wide senior leadership forums, providing strategic direction for SED, supporting all internal SED decision forums, providing for end-to-end systems engineering across the NRO guide the organization in assessing concept of operations and requirements trades, leading requirements analysis and allocation decision forums, and planning and conducting system readiness review events to assess system closure prior to major milestones associated with delivery of promised capability to NRO customers. Support closure assessments and resulting recommendations to proceed to the NRO Senior Acquisition Executive and Corporate Decision Authority Support NRO enterprise/ level test and transition planning and execution in accordance with the NRO Integration, Verification, Validation and Transition Instruction to include test and transition activities involving external organizations"],"Education":"Bachelor's degree from an accredited university in Engineering, Physical Sciences, Mathematics or other technical/systems discipline is required. A master's or advanced degree in a technical field is highly desired. TRANSCRIPTS ARE REQUIRED Demonstrated knowledge and mastery of a broad range of advanced methods and techniques used in systems engineering and/or quantitative and qualitative analyses and assessments and/or enterprise architecting. Demonstrated ability to develop, assess and deliver against strategic organizational goals to include optimizing resources and balancing change in complex environments. Demonstrated ability to establish and maintain effective relationships with customers, information sources; project team members and professionals in other organizations. Possess a proven track record as a successful manager and leader in fast-paced, challenging, complex technical environment.\nDemonstrated excellence in oral and written communication skills, including the ability to effectively translate and transform complex technical documents and briefings into clear, concise, and meaningful products for senior executives. Have a demonstrated knowledge of the planning, programming, budgeting and execution process, congressional budgetary processes, and DoD/IC specific budget practices. Substitution of education may not be used in lieu of specialized experience for this grade level.","Requirements":"","Evaluations":"You will be evaluated for this job based on how well you meet the qualifications above. Once the application process is complete, a review of your application will be made to ensure you meet the job requirements. To determine if you are qualified for this job, a review of your resume and supporting documentation will be made and compared against your responses to the occupational questionnaire. The numeric rating you receive is based on your responses to the questionnaire. The score is a measure of the degree to which your background matches the knowledge, skills and abilities required of this position. If, after reviewing your resume and or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, your score can and will be adjusted to more accurately reflect your abilities. Please follow all instructions carefully. Errors or omissions may affect your rating.","HowToApply":"To apply for this position, you must provide a complete Application Package as described in REQUIRED DOCUMENTS. Click 'Apply Online' to create an account or log in to your existing USAJOBS account. 1. Follow the prompts to complete the assessment questionnaire and upload required documents. 2. Please ensure you click the Submit My Answers button to submit your application. 3. Applications must be received by the closing date of the announcement to receive consideration. To review the status of an application through USAJOBS: 1. Log into your USAJOBS account 2. Click Application Status within your profile to expand your application 3. Locate the job announcement and click the more information link under the Status column for this position. You will be routed to Application Manager. The Details tab displays by default. The Details tab displays comprehensive information about the selected Application Package including: assessment(s) and the status, supporting documents and their status, correspondence sent to you by the hiring agency, and your application processing status.","WhatToExpectNext":"Once you successfully complete the application process, you will receive a notification of receipt. Your application package will be reviewed to ensure you meet the basic eligibility and qualifications requirements, and you will receive a notification. A review will be made of your documentation you submitted to support your responses. A list of qualified applicants will be created and sent to the selecting official. All applicants reviewed and/or referred will receive a notification letter. The selecting official may choose to conduct interviews, and once the selection is made, you will receive a notification of the decision. *NOTE: If you submit a resume but no TQ's or transcripts, you cannot be considered for the position. Your application will be appropriately documented and you will be removed from further competition against this announcement. REGARDING INTERVIEWS: Interviews may be required for this position. Accommodations may be made to conduct telephonic interviews to preclude travel hardships for applicants. Note: Declining to be interviewed or failure to report for a scheduled interview will be considered as a declination for further consideration for employment against this vacancy. The National Reconnaissance Office provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please notify the point of contact for this job announcement. Your requests for reasonable accommodation will be addressed on a case-by-case basis.","RequiredDocuments":"To apply for this position, you must provide a complete Application Package which includes: 1. RESUME - Your Resume listing your name, contact information, work schedule, hours worked per week, dates of employment and duties performed. If multiple resumes are submitted by an applicant, only the last resume submitted will be referred for consideration. 2. ICSOCQs - Completed supplemental narrative in a separate document that gives specific examples of work experiences addressing each Intelligence Community (IC) Senior Officer Core Qualification (SOCQ). Your narrative should be no more than 1 page for each (SOCQ). 3. Technical Qualifications - Completed supplemental narrative in a separate document that gives specific examples of work experiences addressing each Technical Qualification. Your narrative should be no more than 2 pages for each Technical Qualification 4. Joint Duty Credit Information, if applicable. 5. Transcripts: Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applications received without the required documents WILL NOT receive consideration. DO NOT submit additional information (i.e. cover letters, awards, appraisals, pages in excess of the page limits for ICSOCQs and TQs).","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID19 - To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine. All new employees are required to report to the duty station listed on this job announcement upon their agreed upon entry-on-duty date. At that time, you may be eligible to request telework hours in accordance with NRO's telework policy. Due to the nature of NRO's mission, telework opportunities are extremely limited. If selected, Federal employees currently serving in the competitive service must acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS excepted service positions. If selected, NON-DCIPS candidates must acknowledge in writing that the position they have been selected for is in the excepted service and covered by DCIPS. Selection under this appointment authority does not confer civil service competitive status. Joint Duty Credit: All Intelligence senior level positions require Joint Duty credit. Only those candidates who meet the Joint Duty Credit requirement will be eligible to compete/be considered for a senior executive position. Employees will receive joint duty credit for almost any rotational assignment to another Intelligence Community (IC) component and may also be eligible to receive credit for service outside the lC (military, other government, or private sector) as long as the assignment was at the Band 3 (GS 11 to GS 13) level or above and it occurred on or after September 11, 2001. An external candidate, if selected, will be required to immediately apply for Joint Duty Credit. Note: Employees without Joint Duty credit may apply for the position and can be considered. lf selected a waiver would be required prior to final appointment. IC seniors without Joint Duty at the same tier level may lateral into the position if selected without requesting a waiver. Note: Employees without Joint Duty credit may apply for the position and can be considered. If selected a waiver would be required prior to final appointment. IC seniors without Joint Duty at the same tier level may lateral into the position if selected without requesting a waiver. In accordance with the provisions of ICD 601, joint duty assignments will be a prerequisite for promotion to senior civilian rank. To qualify, please provide a copy of your completed Joint Duty assignment SF-50 or an adjudicated IC JD Claims form. More information regarding the Intelligence Community Civilian Joint Duty Program, can be found at: http://www.icjointduty.gov.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"SeniorExecutiveManag@nro.mil","AgencyContactPhone":"703-808-1355","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"635788800","MatchedObjectDescriptor":{"PositionID":"DLAJ8-22-11383854-SES","PositionTitle":"Deputy Director J8 and Director of Financial Improvement/Audit Remediation","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/635788800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/635788800?PostingChannelID="],"PositionLocationDisplay":"Fort Belvoir, Virginia","PositionLocation":[{"LocationName":"Fort Belvoir, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Belvoir, Virginia","Longitude":-77.136185,"Latitude":38.68809}],"OrganizationName":"Defense Logistics Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"Financial Management","Code":"0505"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Eligibility for this position will be based on clear and comprehensive showing that the applicant has had experience of the scope and quality sufficient to carry out the duties and assignments of the position. Additionally, applicants must possess the essential skills, knowledge, and abilities listed in the Executive Core Qualifications and Technical Qualifications paragraphs below. EXECUTIVE CORE QUALIFICATIONS (ECQs) Leading Change: The ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. Leading People: The ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. Results Driven: The ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high quality results by applying technical knowledge, analyzing problems, and calculating risks. Business Acumen: The ability to manage human, financial, and information resources strategically. Building Coalitions: The ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. In addition, DoD requires the Enterprise Perspective: The ability to apply a broad point of view and an understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities is required. Executives must demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required. This information should be embedded within the application package (Resume, Technical Qualifications and Executive Core Qualifications). TECHNICAL QUALIFICATIONS (TQs): Extensive knowledge of financial management, risk management, and audit principles, theories, standards, and management systems. Ability to manage unusual instability and the need for constant revision to agency plans, programs, and operations, including emergent and changing priorities of the Military Services. Includes ability for persuasion, negotiation, diplomacy, and risk assessment to address rapidly changing requirements. Demonstrated leadership in implementing major finance and/or audit related process improvement programs that impact processes, systems, and services across a geographically dispersed and diverse workforce.","PositionRemuneration":[{"MinimumRange":"158541.0","MaximumRange":"196000.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-07T15:27:59.0600","PositionEndDate":"2022-03-07T23:59:59.9970","PublicationStartDate":"2022-02-07T15:27:59.0600","ApplicationCloseDate":"2022-03-07T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Please see Additional Information section under Requirements for a summary of this position.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/DD07","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Defense Logistics Agency (DLA), a multi-mission, Joint Chiefs of Staff designated Combat Support Agency, employees over 26,000 civilian and military personnel geographically dispersed in the Continental United States and abroad. The mission of DLA is to furnish effective and efficient worldwide wartime and peacetime logistics support to the Military Departments, other Department of Defense (DoD) components, as well as to other Federal agencies, foreign agencies, foreign governments and international organizations. DLA manages nine supply chains and nearly 6.1 million items and supports more than 2,400 weapon systems with an inventory value of $20 billion through its integrated procurement, supply depot distribution, and reutilization systems that are supported by automated business systems and technological infrastructure investments of over $1.8 billion annually. This position is in the Senior Executive Service, a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As an executive you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Is delegated full authority and responsibility for planning, formulating, justifying, and executing Program Objectives Memorandum and budget programs/processes for the effective control and utilization of over $40 billion annually supporting DLA.","The Executive has full authority to make a broad range of executive decisions in the role of Budget Officer that impact virtually every major agency program.","Advises the Director, DLA Finance on all matters related to strategic resource planning for the entire spectrum of the DLA operational mission and financial requirements.","Leads the DLA Audit remediation efforts, supporting the DoD Consolidated Financial Improvement and Audit Remediation efforts.","Serves as the Agency?s Chief Executive for Financial Improvement and Audit Remediation (FIAR)","Leads and oversees the integration of DLA/OUSD(C) audit activities, financial management improvement initiatives, Project Plan Oversight, and DLA audit aligned remediation efforts.","Serves as SES in charge of DLA financial statement audit support to the DoD enterprise by providing leadership regarding the auditing and creation of the three Agency Financial Reports, as well as input to the DoD-wide consolidated audit.","Serves as primary liaison with the Department?s Deputy Chief Financial Officer and Deputy Assistant Secretaries for Financial Management in the Military Departments and leads the DLA Audit Senior Steering Committee.","Collaboratively leads audit support and remediation efforts across DLA, with our customers, with our Independent Public Accounting firms, DoD Inspector General, and other stakeholders ensuring DLA achieves the Department?s audit goals","Represents the Agency in the Departmental Budget Officers' forums where DLA budget policies, programs, and philosophies are developed.","Decisions are made regarding resource usage within the Department considering national defense issues and appropriate trade-offs within the Department's top line budget authority.","Guides the Agency's resource requirements through the Department, Office of Management and Budget and the Congress through attendance at high-level budget hearings and testimony before Congressional committees.","Serves as DLA's principal liaison with Appropriation Committees and collaborates closely with DLA Congressional Affairs to work Authorization and DoD-wide issues.","Aligns and ensures there are available resources. Provides DLA Director, Vice Director, and the Director, DLA Finance recommendations regarding acquisition challenges that could negatively affect the Agency?s capability to meet mission requirements.","Delegated full authority and responsibility to develop, coordinate, integrating, and execute financial management policies, programs, and processes for the effective utilization of over $40 billion annually in support of DLA mission requirements.","Serves as the Agency?s key spokesperson regarding financial management matters with the Department, the Services, the Office of Management and Budget, General Accounting Office, other Executive Agencies and Congress.","The Executive ensures DLA is compliant with all legislation pertaining to financial reporting.","The Executive is responsible for the development and implementation of strategic financial goals and all actions required for the Agency to achieve and sustain DLA financial statement auditability.","Assists the Director, DLA Finance in guiding and overseeing Agency business systems modernization efforts to ensure compliance with Federal and Departmental financial architecture and system requirements and standards.","In collaboration with the Director, DLA Finance, the Executive serves as the financial authority regarding DLA?s acquisition investments. The Executive?s decisions are critical to ensure state-of-the-art business systems to support the Warfighter."],"Education":"","Requirements":"","Evaluations":"To determine if you are best qualified for this job, a review of your resume and supporting documentation will be made and compared against the Executive Core Qualifications and Technical Qualifications listed in the qualifications section. The Executive Core Qualifications and Technical Qualifications are designed to capture the desired competencies/knowledge, skills, and abilities for this position","HowToApply":"The complete Application Package must be submitted by 11:59 PM (EST) on the closing date identified. To begin the process, click the Apply Online button to create an account or log into your existing USAJOBS account. Follow the prompts to complete the occupational questionnaire. Please ensure you click the Submit My Answers button at the end of the process. To review the status of an application through USAJOBS: Log into your USAJOBS account. Click Application Status within our profile to expand your application. Click the more information link under the Application Status column for this position. You will be routed to Application Manager. Click the Vacancy ID link to open the Application package. The Details tab displays by default. The Details tab displays comprehensive information about the selected Application Package including: assessment(s) and the status, supporting documents and their status, correspondence sent to you by the hiring agency, and your application processing status. For additional information, see Details Tab and Checklist Tab.","WhatToExpectNext":"Once you successfully complete the application process, you will receive a notification of receipt. Your application package will be reviewed to ensure you meet the basic eligibility and qualification requirements. If found ineligible or unqualified your application package may not receive further consideration. If eligible and qualified, a review will be made of your online questionnaire and the required documentation you submitted to support your responses. Applicants that are found among the most highly qualified may be referred to the hiring official for consideration, and you will receive a notification of referral. The selecting official may choose to conduct interviews and as part of the selection process, applicants may be required to complete additional supplemental documents. Once the selection is made, you will receive a notification of the decision. If interviews are conducted, DLA uses a technique called Behavior Based Interviewing (BBI). Be sure to check your USA Jobs account for your notification updates.","RequiredDocuments":"To apply for this position, you must provide a complete Application Package which includes the items below. Resume: You must submit a resume; the format is at the discretion of the applicant. Your resume should include the following: Vacancy ID# 11383854 Full name, mailing and email addresses, day and evening telephone numbers Educational information, including the name, city and state of colleges or universities you attended, as well as the type of degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education (http://www.ed.gov/admins/finaid/accred/index.html). Information about your paid and nonpaid work experiences related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. You may also include information about honors, awards, and special accomplishments. A separate narrative response to both the Technical Qualifications and the Executive Core Qualifications is required. You must fully address each ECQ and TQ separately. If you fail to do so, you will be rated as ineligible. This information must be submitted as supplemental statements. Applicants must provide specific examples of their experience, education, and/or accomplishments applicable to the qualification requirements identified above. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your action. Applicants should refer to the Office of Personnel Management (OPM) Guide to Senior Executive Service Qualifications at http://www.opm.gov/ses/recruitment/ecq.asp for guidance in developing the ECQ statement. Please follow the instructions in the Format section of Appendix A for formatting. ECQ narratives are limited to a total of ten (10) pages. The TQ narratives are limited to a total of six (6) pages (2 per TQ). Extra pages for either the ECQ or TQ statements may not be considered. NOTE: Current career members of the SES, career SES reinstatement eligible candidates, and graduates of an Office of Personnel Management approved SES Candidate Development Program (SES CDP) who have obtained Qualification Review Board Certification are not required to submit a ECQ statement. However, CDP graduates must include a copy of their OPM certification of eligibility. 3. Do not submit extraneous information (e.g., cover letters, awards, appraisals, transcripts, etc.). These items will be removed from the application package. Classified information will not be accepted. 4. If a current Federal employee, a copy of the most recent SF-50, Notification of Personnel Action, which indicates Federal status, grade, tenure, and type of service is required. Our evaluation will be based on the information you provide. You should expect that we will verify performance, suitability and security information and take that information into account in making employment offers. You will be notified of the outcome after final approval of the selectee.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"Summary:\nThe Deputy Director J8 and Director of Financial Improvement/Audit Remediation, serves in dual capacities as the Agency's Budget Officer and Financial Improvement and Audit Remediation Director, responsible for planning, programming, formulating, defending, and executing the Agency's financial and manpower resources as well as the full spectrum of financial statement audit tasks as directed by the Department's Financial Improvement and Audit Remediation guidance. As the Deputy Director J8, the Executive serves as the Deputy Chief Financial Officer, a principal financial management advisor to the DLA Director and DLA Vice Director. The Executive influences senior leaders in the Agency, the Department, and other Federal agencies, industry, academia, Congress, and foreign governments by maintaining strategic relationships, gaining trust, identifying, and preemptively resolving critical issues on behalf of DLA and the Department. The Executive is directly responsible for providing executive leadership and policy advice for the Agency's $40 billion annual budget, and for leading the planning, execution, and sustainment of the Agency's three financial statement audits. The Executive is responsible for recruiting, training, career development and retention of approximately 700 financial management specialists geographically located world-wide. Additional Information: Veteran's preference does not apply to the SES. COVID19 - Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine. DRUG-FREE WORKPLACE: The Defense Logistics Agency (DLA) has established a Drug-Free Federal Workplace Policy. All applicants tentatively selected for DLA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with DLA for a period of six months. This policy extends to random testing for the use of illegal drugs by employees who occupy testing designated positions defined as sensitive in Section 7(d) of Executive Order 12564. The Defense Logistics Agency's Drug Free Workplace Plan's drug testing panel includes testing for the following illegal substances: marijuana, cocaine, opiates (codeine/morphine), 6-Acetylmorphine (heroin), phencyclidine, amphetamines (amphetamine/methamphetamine), methylenedioxymethamphetamine (MDMA), methylenedioxyamphetamine (MDA), oxycodone, oxymorphone, hydrocodone, and hydromorphone.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"Lisa.Shipe@dla.mil","AgencyContactPhone":"703-945-7223","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"635656000","MatchedObjectDescriptor":{"PositionID":"DECA-22-11383853-SES","PositionTitle":"EXECUTIVE DIRECTOR SALES MARKETING AND LOGISTICS","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/635656000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/635656000?PostingChannelID="],"PositionLocationDisplay":"Fort Lee, Virginia","PositionLocation":[{"LocationName":"Fort Lee, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Lee, Virginia","Longitude":-77.33659,"Latitude":37.251705}],"OrganizationName":"Defense Commissary Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"General Business And Industry","Code":"1101"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), both Mandatory Technical Qualifications, and other qualifications, if applicable, listed below. PLEASE NOTE: Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. EXECUTIVE CORE QUALIFICATIONS: All applicants must submit separate written statements (narrative format) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately, not to exceed 10 pages. You are required to respond to all ECQs. Failure to do so will result in a rating of 'ineligible.' When responding to the Executive Core Qualifications (ECQs), you must clearly show that you possess the experience, knowledge, skills and ability to perform the duties of this position by submitting narrative responses in which you detail your experience in each of the ECQs. Your examples should be clear and emphasize your level of responsibilities, scope and complexity of programs managed, program accomplishments with results of your actions, policy initiatives and level of contacts. You must limit your narrative to two pages per ECQ, and address each ECQ separately. OPM's Guide to Senior Executive Service Qualifications can assist you in writing an effective SES application. In particular, please note the Challenge-Context-Action-Result Model that is recommended and very helpful when drafting ECQ narrative responses. The Guide is available on OPM's Website at:\nhttp://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Applicants must utilize the Challenge-Context-Action-Result (CCAR) Model when writing Executive Core Qualifications (ECQ). Use two examples of relevant experience for each ECQ being sure your experience matches the ECQ criteria.\nChallenge - Describe a specific problem or goal.\nContext - Describe the individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, co-workers, members of Congress, shrinking budget, low morale).\nAction - Discuss the specific actions you took to address a challenge.\nResult - Give specific examples of measures/outcomes that had some impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. As a basic requirement for entry into the Senior Executive Service, applicants must provide evidence of progressively responsible leadership experience that is indicative of senior level management capability and directly related to the skills and abilities outlined under the Technical Qualifications (TQs). You must have 1 year of specialized experience at a level close to the work of the position that has given you particular knowledge, skills, and abilities required to successfully perform the requirements of the position. Typically, this type of experience would be found within this field or a field that is closely related. To meet the minimum qualification requirements for this position, you must show in your resume that you possess both TQs and the five Executive Core Qualifications (ECQs). You must submit a separate narrative statement that addresses each MANDATORY TQ related specifically to this position. Your narrative statements should include specific examples of experience, education, and accomplishments, applicable to the position. Failure to meet any one of the technical qualifications requirements automatically disqualifies an applicant.\nTECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. Please limit your written statements to no more than two pages per TQ. You are required to respond to both TQ's. If you fail to do so, you will be rated as ineligible. TQ1 - Mastery in managing the sales, marketing and/or logistics operations of a large-scale (e.g., worldwide or nationwide) retail establishment. TQ 2 - Mastery of, and skill in applying, retail grocery technologies and trends that foster relationships with business partners, both governmental and non-governmental, to enhance customer service, maximize patron savings and infuse new retail concepts.","PositionRemuneration":[{"MinimumRange":"149810.0","MaximumRange":"187300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-07T00:00:00.0000","PositionEndDate":"2022-03-07T23:59:59.9970","PublicationStartDate":"2022-02-07T00:00:00.0000","ApplicationCloseDate":"2022-03-07T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The foundation for success of the Defense Commissary Agency mission is our people. It is DeCA's goal to have a workforce that is comprised of our nation's diverse cultures and backgrounds. DeCA operates a worldwide commissary system that provides quality grocery products to active duty military personnel and retirees, members of the Reserve and National Guard, and their families, as well as current DeCA employees. The agency employs over 13,000 people and its annual sales exceed $4.5 billion.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/DD34","Relocation":"True","HiringPath":["ses"],"TotalOpenings":"1","AgencyMarketingStatement":"With a workforce of more than 13,000 reflecting our nation's diverse cultures and backgrounds, and annual sales of more than $4.5B, the Defense Commissary Agency (DeCA) operates a worldwide chain of 236 commissaries providing groceries to active-duty military families, retirees and their families, DeCA employees, and other authorized patrons in a safe and secure shopping environment. A core military family support element and a valued part of military pay and benefits, commissaries contribute to family readiness, enhance the quality of life for America's military and their families, and help recruit and retain the best and brightest men and women to serve our country.l.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["This position is designated as the Executive Director Sales, Marketing, and Logistics of the Defense Commissary Agency (DeCA), an independent worldwide Agency of the Department of Defense (DOD). The position is located at the Agency Headquarters (HQ) at Ft. Lee, VA. Manages and directs all Agency operations affecting the following DeCA major components in the Sales, Marketing, and Logistics Group. Within this context, the incumbent serves as an expert senior advisor to the Director/Chief Executive Officer (CEO) and the Deputy Director/Chief Operating Officer (COO) on all matters involving DeCA business practices and the various support functions required to enable professional management of the commissary system."],"Education":"Education may not be substituted for specialized experience at this grade level.","Requirements":"","Evaluations":"We will review your resume and supporting documents, for the quality and extent of your total accomplishments, experience and education as it relates to the technical competencies, identified below, which are required for this position. Your application will be evaluated by a rating and ranking panel, and highly qualified candidates may undergo an interview and a reference check. Technical Qualifications:\nTQ1 - Mastery in managing the sales, marketing and/or logistics operations of a large-scale (e.g., worldwide or nationwide) retail establishment.\nTQ 2 - Mastery of, and skill in applying, retail grocery technologies and trends that foster relationships with business partners, both governmental and non-governmental, to enhance customer service, maximize patron savings and infuse new retail concepts. REVIEW OF APPLICATION DOCUMENTS (FOR ALL APPLICANTS): To determine your qualifications, a review of your resume and supporting documentation will be made and compared against your responses to the questions. The score you receive is a measure of the degree to which your background matches the competencies required.\nPlease follow all instructions carefully as errors or omissions may affect your rating. To determine if you meet the qualifications, requirements and quality of experience required for this position, we review your resume, supporting documents and responses to the questionnaire. The score you receive is a measure of the degree to which your background matches the competencies required.\nWe will review your resume and supporting documents to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and evaluate your relevant work experiences as it relates to fundamental competencies identified as required for this position.","HowToApply":"To begin, click Apply Online to access an online application. Follow the prompts to select your resume, required documents, and/or other supporting documents. You need to be logged in to your USAJOBS account or you may need to create a new account. You will be taken to an online application. Complete the online application, verify you've included all required and supporting documentation, and submit your application. You will receive an email notification when your application is received. To verify the status of your application log into your USAJOBS account, select the Application Status link, and then select the More Information link for this position. The Application Status page displays the status of your application, the documentation received and processed, and the responses you submitted. It may take several hours for your uploaded documents to clear the virus scan process.","WhatToExpectNext":"At various points you receive notices regarding your application status. Your notices are posted to your USAJOBS account and sent via email. You receive a notice of receipt when you complete the application process. You receive another notice after we review your application package to verify you meet qualifications, other requirements and are eligible for consideration. You receive a notice if you are referred to the hiring manager for selection consideration. The hiring manager may choose to conduct interviews and may conduct telephone interviews to preclude travel hardships for applicants. You can expect to receive a final notice after the hiring agency makes a decision.","RequiredDocuments":"Submit a complete application package by 11:59 PM ET on 03/07/2022. Application packages should include the following documents:\nQuestionnaire: Required\nTranscripts: Not Applicable\nResume: Required **To ensure full consideration of your experience and education we encourage you to use the USAJOBS resume builder to prepare your resume or to guide you in preparing your resume.\nFor qualifications determinations your resume must contain the following:\n- Applicant's full legal name and contact information\n- Description of your duties\n- Number of hours worked per week\n- Beginning and ending dates (month/year) for each position - Written responses to all Technical Qualifications (TQ) as described in the announcement above.\n- Written responses to all Executive Core Qualifications (ECQ) as described in the announcement above. PLEASE NOTE: Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"REGARDING INTERVIEWS: Interviews may be required for this position. Accommodations may be made to conduct telephonic interviews to preclude travel hardships for applicants. Re-employed Annuitant: This position does not meet criteria for re-employed annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at http://www.dtic.mil/whs/directives/corres/pdf/1400.25-V300.pdf.\nRe-employed Annuitant: A former Federal employee who has retired under either the Civil Service Retirement System (CSRS) or Federal Employees Retirement System (FERS) is an Annuitant. An annuitant cannot be hired (i.e. re-employed) unless the vacant position meets the criteria in the Department of Defense (DOD) policy on employment of annuitants issued December 10, 2008.\n\"Re-employed Annuitant: Does Not Meet Criteria\" the vacancy does not meet the criteria for appointment of annuitants (irrespective of eligibility or qualifications). Annuitant applicants are advised, in accordance with DoD Policy, that further consideration for the vacancy is not permitted.\nOther Notes:\n- Individual with Financial Difficulty: https://hru.gov/Studio_Recruitment/tools/Mythbuster_on_Federal_Hiring_Policies.pdf\n- Deliberate attempts to falsify your application information, such as copying portions of this job announcement into your resume, may result in you being removed from consideration for this position.\n- If selected, you will serve a two-year Senior Executive Service (SES) probationary period unless you previously completed the probationary period in the SES.\n- COVID19 - To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to E.O. 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine Volunteer Experience: Your experience refers to paid and unpaid experience, including volunteer work done through National Service program (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"DHRCDDECAHQ@DLA.MIL","AgencyContactPhone":"614-692-2331","SecurityClearance":"Top Secret","DrugTestRequired":"False","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"636240900","MatchedObjectDescriptor":{"PositionID":"DECA-22-11385810-SES","PositionTitle":"EXECUTIVE DIRECTOR STORE OPERATIONS","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/636240900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/636240900?PostingChannelID="],"PositionLocationDisplay":"Fort Lee, Virginia","PositionLocation":[{"LocationName":"Fort Lee, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Fort Lee, Virginia","Longitude":-77.33659,"Latitude":37.251705}],"OrganizationName":"Defense Commissary Agency","DepartmentName":"Department of Defense","JobCategory":[{"Name":"General Business And Industry","Code":"1101"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), both Mandatory Technical Qualifications, and other qualifications, if applicable, listed below. PLEASE NOTE: Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. EXECUTIVE CORE QUALIFICATIONS: All applicants must submit separate written statements (narrative format) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately, not to exceed 10 pages. You are required to respond to all ECQs. Failure to do so will result in a rating of 'ineligible.' When responding to the Executive Core Qualifications (ECQs), you must clearly show that you possess the experience, knowledge, skills and ability to perform the duties of this position by submitting narrative responses in which you detail your experience in each of the ECQs. Your examples should be clear and emphasize your level of responsibilities, scope and complexity of programs managed, program accomplishments with results of your actions, policy initiatives and level of contacts. You must limit your narrative to two pages per ECQ, and address each ECQ separately. OPM's Guide to Senior Executive Service Qualifications can assist you in writing an effective SES application. In particular, please note the Challenge-Context-Action-Result Model that is recommended and very helpful when drafting ECQ narrative responses. The Guide is available on OPM's Website at:\nhttp://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf Applicants must utilize the Challenge-Context-Action-Result (CCAR) Model when writing Executive Core Qualifications (ECQ). Use two examples of relevant experience for each ECQ being sure your experience matches the ECQ criteria.\nChallenge - Describe a specific problem or goal.\nContext - Describe the individuals and groups you worked with, and/or the environment in which you worked, to address a particular challenge (e.g., clients, co-workers, members of Congress, shrinking budget, low morale).\nAction - Discuss the specific actions you took to address a challenge.\nResult - Give specific examples of measures/outcomes that had some impact on the organization. These accomplishments demonstrate the quality and effectiveness of your leadership skills. Each accomplishment should be clear, concise, and emphasize your level of responsibilities; the scope and complexity of the programs, activities, or services you managed; program accomplishments; policy initiatives undertaken; level of contacts; the sensitivity and criticality of the issues you addressed; and the results of your actions. You should use action oriented leadership words to describe your experience and accomplishments (e.g., Led the development and implementation of....) and quantify your experience wherever possible to demonstrate your accomplishments (e.g., number of employees supervised; size of budget managed; amount of money saved, etc.). ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs. As a basic requirement for entry into the Senior Executive Service, applicants must provide evidence of progressively responsible leadership experience that is indicative of senior level management capability and directly related to the skills and abilities outlined under the Technical Qualifications (TQs). You must have 1 year of specialized experience at a level close to the work of the position that has given you particular knowledge, skills, and abilities required to successfully perform the requirements of the position. Typically, this type of experience would be found within this field or a field that is closely related. To meet the minimum qualification requirements for this position, you must show in your resume that you possess both TQs and the five Executive Core Qualifications (ECQs). You must submit a separate narrative statement that addresses each MANDATORY TQ related specifically to this position. Your narrative statements should include specific examples of experience, education, and accomplishments, applicable to the position. Failure to meet any one of the technical qualifications requirements automatically disqualifies an applicant.\nTECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. Please limit your written statements to no more than two pages per TQ. You are required to respond to both TQ's. If you fail to do so, you will be rated as ineligible. TQ1 - Mastery in managing, supervising, and executing all operations of a large scale (e.g. worldwide or nationwide) retail grocery organization. TQ 2 - Mastery of, and skill in applying an exceptional knowledge of business and trade practices to include the following: the collection, analysis, and dissemination of information; the establishment and maintenance of contacts with industry and commerce; sales; marketing; merchandising; commercial retail/grocery industry, and the administration of regulatory provisions and controls.","PositionRemuneration":[{"MinimumRange":"149810.0","MaximumRange":"187300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-09T14:49:37.5000","PositionEndDate":"2022-03-11T23:59:59.9970","PublicationStartDate":"2022-02-09T14:49:37.5000","ApplicationCloseDate":"2022-03-11T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The foundation for success of the Defense Commissary Agency mission is our people. It is DeCA's goal to have a workforce that is comprised of our nation's diverse cultures and backgrounds. DeCA operates a worldwide commissary system that provides quality grocery products to active duty military personnel and retirees, members of the Reserve and National Guard, and their families, as well as current DeCA employees. The agency employs over 13,000 people and its annual sales exceed $4.5 billion.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/DD34","Relocation":"True","HiringPath":["ses"],"TotalOpenings":"1","AgencyMarketingStatement":"With a workforce of more than 13,000 reflecting our nation's diverse cultures and backgrounds, and annual sales of more than $4.5 billion, the Defense Commissary Agency (DeCA) operates a worldwide chain of 236 commissaries providing groceries to active-duty military families, retirees and their families, DeCA employees, and other authorized patrons in a safe and secure shopping environment. A core military family support element and a valued part of military pay and benefits, commissaries contribute to family readiness, enhance the quality of life for America's military and their families, and help recruit and retain the best and brightest men and women to serve our country.l.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["This position is designated as the Executive Director, Store Operations of the Defense Commissary Agency (DeCA), an independent worldwide Agency of the Department of Defense (DOD). The position is located at the Agency's Headquarters (HQ) at Fort Lee, VA. Expert senior advisor to DeCA Director and Deputy Director on all matters involving the management of the commissary system Manages and directs all agency operations affecting the operation of all commissary stores worldwide. Directs major program development, policymaking, and oversight of these programs and ensures that the appropriate operational focus is maintained over functions that support commissary operations. Exercises full responsibility for policy interpretation and formulation, decision making, strategic and tactical planning and policy implementation concerning the overall operation of the Store Operations Group."],"Education":"Education may not be substituted for specialized experience at this grade level.","Requirements":"","Evaluations":"We will review your resume and supporting documents, for the quality and extent of your total accomplishments, experience and education as it relates to the technical competencies, identified below, which are required for this position. Your application will be evaluated by a rating and ranking panel, and highly qualified candidates may undergo an interview and a reference check. Technical Qualifications:\nTQ 1 - Mastery in managing, supervising, and executing all operations of a large scale (e.g. worldwide or nationwide) retail grocery organization.\nTQ 2 - Mastery of, and skill in applying an exceptional knowledge of business and trade practices to include the following: the collection, analysis, and dissemination of information; the establishment and maintenance of contacts with industry and commerce; sales; marketing; merchandising; commercial retail/grocery industry, and the administration of regulatory provisions and controls. REVIEW OF APPLICATION DOCUMENTS (FOR ALL APPLICANTS): To determine your qualifications, a review of your resume and supporting documentation will be made and compared against your responses to the questions. The score you receive is a measure of the degree to which your background matches the competencies required.\nPlease follow all instructions carefully as errors or omissions may affect your rating. To determine if you meet the qualifications, requirements and quality of experience required for this position, we review your resume, supporting documents and responses to the questionnaire. The score you receive is a measure of the degree to which your background matches the competencies required.\nWe will review your resume and supporting documents to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and evaluate your relevant work experiences as it relates to fundamental competencies identified as required for this position. . Candidates in the best qualified category are referred to hiring managers before candidates in other categories. Within the best qualified category, candidates are referred in the following order: adjudicated veterans' preference candidates with 10-point preference, adjudicated veterans' preference candidates with other than 10-point preference, military spouse preference candidates, and candidates with no preference. Neither preference nor priority entitles you to a Federal job. You must apply, meet the qualification standards and all additional requirements, and submit all necessary documents. Military spouses must be in the best qualified group in order to receive military spouse preference. Interagency Career Transition Assistance Program (ICTAP). This program applies to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet ICTAP eligibility criteria AND 2) be rated well-qualified for the position AND 3) submit the appropriate documentation to support your ICTAP eligibility. Well-qualified means you possess the type and quality of experience that exceeds the position's minimum qualifications. See the Required Documents section of this announcement for more information.","HowToApply":"To begin, click Apply Online to access an online application. Follow the prompts to select your resume, required documents, and/or other supporting documents. You need to be logged in to your USAJOBS account or you may need to create a new account. You will be taken to an online application. Complete the online application, verify you've included all required and supporting documentation, and submit your application. You will receive an email notification when your application is received. To verify the status of your application log into your USAJOBS account, select the Application Status link, and then select the More Information link for this position. The Application Status page displays the status of your application, the documentation received and processed, and the responses you submitted. It may take several hours for your uploaded documents to clear the virus scan process.","WhatToExpectNext":"At various points you receive notices regarding your application status. Your notices are posted to your USAJOBS account and sent via email. You receive a notice of receipt when you complete the application process. You receive another notice after we review your application package to verify you meet qualifications, other requirements and are eligible for consideration. You receive a notice if you are referred to the hiring manager for selection consideration. The hiring manager may choose to conduct interviews and may conduct telephone interviews to preclude travel hardships for applicants. You can expect to receive a final notice after the hiring agency makes a decision.","RequiredDocuments":"Submit a complete application package by 11:59 PM ET on 03/11/2022. Application packages should include the following documents:\nQuestionnaire: Required\nTranscripts: Not Applicable\nResume: Required **To ensure full consideration of your experience and education we encourage you to use the USAJOBS resume builder to prepare your resume or to guide you in preparing your resume.\nFor qualifications determinations your resume must contain the following:\n- Applicant's full legal name and contact information\n- Description of your duties\n- Number of hours worked per week\n- Beginning and ending dates (month/year) for each position - Written responses to all Technical Qualifications (TQ) as described in the announcement above.\n- Written responses to all Executive Core Qualifications (ECQ) as described in the announcement above. PLEASE NOTE: Applicants that are either Career SES members, or graduates of the Office of Personnel Management Certified Development Program are not required to address the ECQs.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":true,"OtherInformation":"REGARDING INTERVIEWS: Interviews may be required for this position. Accommodations may be made to conduct telephonic interviews to preclude travel hardships for applicants. Re-employed Annuitant: This position does not meet criteria for re-employed annuitant. The DoD criteria for hiring Re-employed Annuitants can be found at http://www.dtic.mil/whs/directives/corres/pdf/1400.25-V300.pdf.\nRe-employed Annuitant: A former Federal employee who has retired under either the Civil Service Retirement System (CSRS) or Federal Employees Retirement System (FERS) is an Annuitant. An annuitant cannot be hired (i.e. re-employed) unless the vacant position meets the criteria in the Department of Defense (DOD) policy on employment of annuitants issued December 10, 2008.\n\"Re-employed Annuitant: Does Not Meet Criteria\" the vacancy does not meet the criteria for appointment of annuitants (irrespective of eligibility or qualifications). Annuitant applicants are advised, in accordance with DoD Policy, that further consideration for the vacancy is not permitted.\nOther Notes:\n- Individual with Financial Difficulty: https://hru.gov/Studio_Recruitment/tools/Mythbuster_on_Federal_Hiring_Policies.pdf\n- Deliberate attempts to falsify your application information, such as copying portions of this job announcement into your resume, may result in you being removed from consideration for this position.\n- If selected, you will serve a two-year Senior Executive Service (SES) probationary period unless you previously completed the probationary period in the SES.\n- COVID19 - To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to E.O. 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine Volunteer Experience: Your experience refers to paid and unpaid experience, including volunteer work done through National Service program (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"DHRCDDECAHQ@DLA.MIL","AgencyContactPhone":"614-692-2331","SecurityClearance":"Top Secret","DrugTestRequired":"False","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"640459000","MatchedObjectDescriptor":{"PositionID":"DE-11406455-22-CA","PositionTitle":"EXECUTIVE DIRECTOR, NAVY CYBER WARFARE DEVELOPMENT GROUP","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/640459000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/640459000?PostingChannelID="],"PositionLocationDisplay":"National Maritime Intelligence Center, Maryland","PositionLocation":[{"LocationName":"National Maritime Intelligence Center, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"National Maritime Intelligence Center, Maryland","Longitude":-76.9231,"Latitude":38.848}],"OrganizationName":"United States Fleet Forces Command","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Intelligence Community Senior Officer Core Qualifications (ICSOCQs), and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Intelligence Community Senior Officer Core Qualifications (ICSOCQ), and Mandatory Technical Qualifications will eliminate you from consideration. INTELLIGENCE COMMUNITY SENIOR OFFICER CORE QUALIFICATION: You will be assessed against the IC Senior Officer Core Qualification Standard - Leading the Intelligence Enterprise to determine your interagency or multi-organizational (business, mission or professional) leadership competencies. (Each must be addressed separately in your Supplemental Narrative Statement. Each ICSOCQs must not exceed 2 pages.) 1) Collaboration and Integration. Senior officers have a responsibility to share information and knowledge to achieve results, and in that regard are expected to build effective networks and alliances with key peers and stakeholders across the IC and/or with other United States Government (USG), state, local, tribal and foreign officials, as appropriate; actively engage these peers and stakeholders; involve them in key decisions; and effectively leverage these networks and alliances to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or in other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes; and integrate joint/multi-agency activities, effectively exercising collaborative plans that realize mutual, joint, or multi-organizational goals. 2) Enterprise Focus. Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information, and other inputs to effectively integrate and align component, IC, and USG interests and activities to achieve IC-wide, national, or international priorities. In addition, senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce an enterprise focus among their subordinates. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi- organizational mission accomplishment.\n(b) Understand how organizations, resources, information, and processes within the IC or interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems. 3) Values-Centered Leadership. IC senior officers are expected to personally embody, advance, and reinforce IC core values: a Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. In addition, senior officers are also expected to demonstrate and promote departmental and/or component core values, which may be incorporated in writing, as applicable. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Promote, reinforce, and reward IC, departmental component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values.\n(b) Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Experience and knowledge of Navy and Joint requirements, capabilities and concepts for cyberspace operations and a thorough understanding of the relationships among cyberspace operations, intelligence process and Joint maneuver and fires. 2. Experience and knowledge of intelligence community (IC) and inter-agency capabilities and processes that enable cyberspace operations and their integrated planning and execution in the Joint Operations and Planning Process. 3. Defense acquisition experience to include thorough understanding of Federal and Defense acquisition regulations, government ethics and Defense and Navy fiscal oversight and the ability to apply this experience to advise the Program Manager and recognize opportunities for efficiency. 4. Demonstrated ability to create and implement strategic and operational partnerships among IC and inter-agency, Joint and Service headquarters (and staffs), and Defense and intelligence research and development leaders and stakeholders to leverage public and private technical development to serve the needs of the Navy. 5. Experience in liaison among Service engineers, industry experts and international academia to improve risk models and develop constructive relationships to deliver functional naval cyberspace capabilities on time for best cost. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-03T00:00:00.0000","PositionEndDate":"2022-03-23T23:59:59.9970","PublicationStartDate":"2022-03-03T00:00:00.0000","ApplicationCloseDate":"2022-03-23T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Executive Director, Navy Cyber Warfare Development Group (NCWDG) providing the primary interface for all NCWDG representation to and consultation with Navy and Intelligence Community (IC) cyber stakeholders. The incumbent represents the Commanding Officer/Program Manager (CO/PM) with full authority at boards, panels, committees and working group; and as directed by Fleet Cyber Command (FCC), assists FCC and the staff of the Chief of Naval Operations.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV60","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will recommend initiation of new, changes to existing programs to anticipate the pace and intensity of technological change in cyberspace, and to account for the evolution of strategic and operational priorities for Joint and Navy forces.","You will be the focal point for developing and transitioning cyber and information warfare (IW) capabilities to other acquisition organizations and to the operating force.","You will serve as the primary liaison to FCC and U.S. Cyber Command for policy and doctrine development, ensuring the future utility of cyber/IW capabilities.","You will be the principal advisor to the CO/PM on technological and scientific trends and policies affecting naval employment of cyber/IW capabilities, electromagnetic and acoustic spectra, machine protocols in commercial and defense use.","You will be responsible for strategic planning; crafting and implementing policy; and overseeing planning, programming, budgeting, and force integration activities that deliver cyberspace operations capabilities to the Navy.","You will oversee civilian hiring and performance management for both intelligence excepted service and cyber excepted service. The incumbent advises the CO/PM on civilian training, conduct, and performance."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad Hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire https://apply.usastaffing.gov/ViewQuestionnaire/11406455\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 03/23/2022. Applications received after 03/23/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statement must address the Intelligence Community Senior Officer Core Qualifications (ICSOCQs) and the Mandatory Technical Qualifications (MTQs) listed above. A Joint Duty Claim Form is required. This position required Joint Duty credit. You must submit one of the following: an approved Joint Duty claim form, or a completed Joint Duty claim request form with required documentation; or provide a supplemental statement providing evidence of joint duty credit (including dates, location and statement identifying specific Joint Duty Assignment. Failure to provide this information will eliminate you from consideration. The form can be found at the JDA web page: http://www.icjointduty.gov/. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is in the Defense Intelligence Senior Level (DISL) position. DISL positions may include some supervisory and related managerial duties, provided that these duties occupy less than 25 percent of the incumbent's time. DISL members are independent advisors or technical experts and do not involve fundamental research and development responsibilities. DISL positions are in the excepted service. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How to Apply section of this vacancy announcement. Certain incentives (such as Recruitment, Relocation or Student Loan Repayment) may be authorized to eligible selectees. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf All Defense Intelligence positions under the Defense Civilian Intelligence Personnel System (DCIPS) are in the excepted service by specific statute, 10 U.S.C. 1601. This position is in the excepted service. Non-DCIPS applicants selected for a DCIPS position must acknowledge in writing, prior to actual appointment to the DCIPS position, that the position for which he or she has been selected is in the excepted service and covered by DCIPS. Federal employees currently serving in the competitive service must also acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS position. This acknowledgement is necessary as movement between the excepted service and competitive service may be limited if the employee does not possess competitive status. Joint Duty Assignments - Joint IC Duty certification is a prerequisite for appointment to senior executive, senior professional, and DCIPS positions classified above GG grade 15.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"635824900","MatchedObjectDescriptor":{"PositionID":"DE-11383397-22-JS","PositionTitle":"DIRECTOR, INFORMATION WARFARE FUTURE CAPABILITIES","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/635824900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/635824900?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Naval Intelligence Command","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Program Management","Code":"0340"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Intelligence Community Senior Officer Core Qualifications (ICSOCQs), and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Intelligence Community Senior Officer Core Qualifications (ICSOCQ), and Mandatory Technical Qualifications will eliminate you from consideration. INTELLIGENCE COMMUNITY SENIOR OFFICER CORE QUALIFICATION: You will be assessed against the IC Senior Officer Core Qualification Standard - Leading the Intelligence Enterprise to determine your interagency or multi-organizational (business, mission or professional) leadership competencies. (Each must be addressed separately in your Supplemental Narrative Statement. Each ICSOCQs must not exceed 2 pages.) 1) Collaboration and Integration. Senior officers have a responsibility to share information and knowledge to achieve results, and in that regard are expected to build effective networks and alliances with key peers and stakeholders across the IC and/or with other United States Government (USG), state, local, tribal and foreign officials, as appropriate; actively engage these peers and stakeholders; involve them in key decisions; and effectively leverage these networks and alliances to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or in other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes; and integrate joint/multi-agency activities, effectively exercising collaborative plans that realize mutual, joint, or multi-organizational goals. 2) Enterprise Focus. Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information, and other inputs to effectively integrate and align component, IC, and USG interests and activities to achieve IC-wide, national, or international priorities. In addition, senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce an enterprise focus among their subordinates. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi- organizational mission accomplishment.\n(b) Understand how organizations, resources, information, and processes within the IC or interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems. 3) Values-Centered Leadership. IC senior officers are expected to personally embody, advance, and reinforce IC core values: a Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. In addition, senior officers are also expected to demonstrate and promote departmental and/or component core values, which may be incorporated in writing, as applicable. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Promote, reinforce, and reward IC, departmental component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values.\n(b) Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Expert ability to plan, communicate, coordinate, and lead broad and complex analytic activities with major implications for Navy, Department of Defense (DoD) and National customers. Includes ability to create and leverage partnerships within the Intelligence Community (IC), Federal Government, and private sector to support Navy science and technology (S&T) requirements. 2. Experience creating, managing, and implementing an organizational environment which encourages the implementation of change, and in developing change strategies and planning goals tied to the Navy's strategic guidance to ensure the Fleet's mission success. 3. Demonstrated technical expertise of U.S. Navy Information Warfare operations to include cryptology, information operations, intelligence, meteorology and oceanography, space, and tactical networks and the application to Fleet and Joint Operations is essential to understand and develop roadmaps for future capabilities. 4. Outstanding verbal and written communications skills to accurately and succinctly represent OPNAV and Information Warfare positions required to influence senior leadership and peers. Must be able to present persuasive proposals and briefings on complex problems and future warfare capabilities. As a senior expert and advisor, incumbent must be able to exercise judgment, tact, and discretion. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-09T00:00:00.0000","PositionEndDate":"2022-03-11T23:59:59.9970","PublicationStartDate":"2022-02-09T00:00:00.0000","ApplicationCloseDate":"2022-03-11T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Director for the Information Warfare (IW) Future Capabilities Division supporting the Deputy Chief of Naval Operations (DCNO) for Information Warfare (OPNAV N2N6) in delivering an analytic investment plan and experimentation strategy of critical IW warfighting capabilities based on available intelligence to enable Distributed Maritime Operations (DMO) and Expeditionary Advanced Base Operations (EABO) in strategic competition.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV15","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will lead a corps of experts to complete investment strategy development for Counter- Command, Control, Communications, Computers, Combat Sys, Intel, Surveillance, Reconnaissance and Targeting, resilient command and control and tactical networks.","You will provide technical expertise for IW analytic plan and threat intel to align science and technology roadmaps, assessments, wargaming, exercises, experimentation, and modeling/simulation across IW Enterprise to deliver data driven decisions.","You will partner with the Digital Warfare Office supporting the development of the Naval Operational Architecture to advance Project Overmatch and partner with Fleet Forces Command for the IW capability portions of the Navy Fleet design effort.","You will provide authoritative advice to senior leaders in other government agencies or allied governments, and serves as a consultant and advisor throughout the IW and intelligence communities representing at science boards, panels and study groups."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad Hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire https://apply.usastaffing.gov/ViewQuestionnaire/11383397\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 03/11/2022. Applications received after 03/11/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statement must address the Intelligence Community Senior Officer Core Qualifications (ICSOCQs) and the Mandatory Technical Qualifications (MTQs) listed above. A Joint Duty Claim Form is required. This position required Joint Duty credit. You must submit one of the following: an approved Joint Duty claim form, or a completed Joint Duty claim request form with required documentation; or provide a supplemental statement providing evidence of joint duty credit (including dates, location and statement identifying specific Joint Duty Assignment. Failure to provide this information will eliminate you from consideration. The form can be found at the JDA web page: http://www.icjointduty.gov/. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is in the Defense Intelligence Senior Level (DISL) position. DISL positions may include some supervisory and related managerial duties, provided that these duties occupy less than 25 percent of the incumbent's time. DISL members are independent advisors or technical experts and do not involve fundamental research and development responsibilities. DISL positions are in the excepted service. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf All Defense Intelligence positions under the Defense Civilian Intelligence Personnel System (DCIPS) are in the excepted service by specific statute, 10 U.S.C. 1601. This position is in the excepted service. Non-DCIPS applicants selected for a DCIPS position must acknowledge in writing, prior to actual appointment to the DCIPS position, that the position for which he or she has been selected is in the excepted service and covered by DCIPS. Federal employees currently serving in the competitive service must also acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS position. This acknowledgement is necessary as movement between the excepted service and competitive service may be limited if the employee does not possess competitive status. Joint Duty Assignments - Joint IC Duty certification is a prerequisite for appointment to senior executive, senior professional, and DCIPS positions classified above GG grade 15.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"636379900","MatchedObjectDescriptor":{"PositionID":"DE-11385137-22-JS","PositionTitle":"CHIEF TECHNOLOGY OFFICER","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/636379900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/636379900?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"U.S. Marine Corps","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Information Technology Management","Code":"2210"}],"JobGrade":[{"Code":"IP"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Intelligence Community Senior Officer Core Qualifications (ICSOCQs), and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Intelligence Community Senior Officer Core Qualifications (ICSOCQ), and Mandatory Technical Qualifications will eliminate you from consideration. INTELLIGENCE COMMUNITY SENIOR OFFICER CORE QUALIFICATION: You will be assessed against the IC Senior Officer Core Qualification Standard - Leading the Intelligence Enterprise to determine your interagency or multi-organizational (business, mission or professional) leadership competencies. (Each must be addressed separately in your Supplemental Narrative Statement. Each ICSOCQs must not exceed 2 pages.) 1) Collaboration and Integration. Senior officers have a responsibility to share information and knowledge to achieve results, and in that regard are expected to build effective networks and alliances with key peers and stakeholders across the IC and/or with other United States Government (USG), state, local, tribal and foreign officials, as appropriate; actively engage these peers and stakeholders; involve them in key decisions; and effectively leverage these networks and alliances to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or in other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes; and integrate joint/multi-agency activities, effectively exercising collaborative plans that realize mutual, joint, or multi-organizational goals. 2) Enterprise Focus. Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information, and other inputs to effectively integrate and align component, IC, and USG interests and activities to achieve IC-wide, national, or international priorities. In addition, senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce an enterprise focus among their subordinates. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi- organizational mission accomplishment.\n(b) Understand how organizations, resources, information, and processes within the IC or interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems. 3) Values-Centered Leadership. IC senior officers are expected to personally embody, advance, and reinforce IC core values: a Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. In addition, senior officers are also expected to demonstrate and promote departmental and/or component core values, which may be incorporated in writing, as applicable. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Promote, reinforce, and reward IC, departmental component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values.\n(b) Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Demonstrated success in managing enterprise-wide IT systems for a complex organization including IT investment management, network design and development, network and systems operations, and information system security and assurance. 2. In-depth understanding of Task Force-level Information and Intelligence, Surveillance, and Reconnaissance (ISR) technologies. 3. Demonstrated knowledge of key technical issues in IT and the ability to promote IT system solutions while leveraging state-of-the-art advances in Information Technology. 4. Demonstrated success in providing authoritative direction and leadership of a multi-faceted IT organization with varied customers, clients, and stakeholders and the ability to manage projects and programs to accomplish enterprise architecture goals/objectives. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-14T00:00:00.0000","PositionEndDate":"2022-03-16T23:59:59.9970","PublicationStartDate":"2022-02-14T00:00:00.0000","ApplicationCloseDate":"2022-03-16T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Chief Technology Officer (CTO) and Director of the Information War Room for Deputy Commandant Information, Headquarters, U.S. Marine Corps (USMC). You will serve as the senior technical expert responsible for planning, directing, coordinating, and overseeing all information management and technology initiatives supporting operations in the Information Environment.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV27","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will provide leadership to USMC, Department of Navy (DON) and Department of Defense (DoD) intelligence and information functions through innovation, rapid prototyping, technology development and transition, and portfolio management activities.","You will serve as principal advisor to Deputy Commandant for Information (DCI) for innovation, prototyping and acquisition activities across Marine Corps, DON, DoD, Intelligence and the wider Information Community.","You will establish partnering agreements with stakeholders, laboratories, and academic institutions.","You will define and issue USMC information-related information technology (IT) standards and policies in accordance with Marine Corps, DON, DoD, and Intelligence Community (IC) information standards and guidelines.","You will represent the DCI at senior-level National, Joint, DoD, DON, and inter-service councils, committees, and forums that address intelligence-related IT and ISR technologies, issues and future requirements and solution sets."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad Hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire https://apply.usastaffing.gov/ViewQuestionnaire/11385137\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 03/16/2022. Applications received after 03/16/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statement must address the Intelligence Community Senior Officer Core Qualifications (ICSOCQs) and the Mandatory Technical Qualifications (MTQs) listed above. A Joint Duty Claim Form is required. This position required Joint Duty credit. You must submit one of the following: an approved Joint Duty claim form, or a completed Joint Duty claim request form with required documentation; or provide a supplemental statement providing evidence of joint duty credit (including dates, location and statement identifying specific Joint Duty Assignment. Failure to provide this information will eliminate you from consideration. The form can be found at the JDA web page: http://www.icjointduty.gov/. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you a veteran claiming 5-point veterans' preference or claiming sole survivorship preference? You must submit a copy of your latest DD-214 Certificate of Release or Discharge from Active Duty (any copy that shows all dates of service, as well as character of service [Honorable, General, etc.] is acceptable) OR a VA letter that shows dates of service or service connected disability AND character of service. If you have more than one DD-214 for multiple periods of active duty service, submit a copy for each period of service. If you were issued a DD-215 to amend aforementioned information on the DD-214 you must submit that too. If you are not sure of your preference eligibility, visit the Department of Labor's website: Veterans' Preference Advisor Are you a disabled veteran or claiming 10-point veterans' preference?\nIf you are eligible to claim 10 point veterans preference you must submit a DD-214 Certificate of Release or Discharge from Active Duty as described above for 5-point preference. You must also provide the applicable supporting documentation of your disability (e.g. disability letter from the VA) as described on Standard Form-15 (SF-15). http://www.opm.gov/forms/pdf_fill/SF15.pdf. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is in the Defense Intelligence Senior Level (DISL) position. DISL positions may include some supervisory and related managerial duties, provided that these duties occupy less than 25 percent of the incumbent's time. DISL members are independent advisors or technical experts and do not involve fundamental research and development responsibilities. DISL positions are in the excepted service. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Recruitment incentives may be authorized to eligible new hires. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf All Defense Intelligence positions under the Defense Civilian Intelligence Personnel System (DCIPS) are in the excepted service by specific statute, 10 U.S.C. 1601. This position is in the excepted service. Non-DCIPS applicants selected for a DCIPS position must acknowledge in writing, prior to actual appointment to the DCIPS position, that the position for which he or she has been selected is in the excepted service and covered by DCIPS. Federal employees currently serving in the competitive service must also acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS position. This acknowledgement is necessary as movement between the excepted service and competitive service may be limited if the employee does not possess competitive status. Joint Duty Assignments - Joint IC Duty certification is a prerequisite for appointment to senior executive, senior professional, and DCIPS positions classified above GG grade 15.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"637558600","MatchedObjectDescriptor":{"PositionID":"DISES-11390051-22-VH","PositionTitle":"Deputy Director for Defense Intelligence (Collection and Special Programs)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/637558600","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/637558600?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Office of the Secretary of Defense","DepartmentName":"Department of Defense","SubAgency":"Office of the Under Secretary of Defense (Intelligence and Security)","JobCategory":[{"Name":"Intelligence","Code":"0132"}],"JobGrade":[{"Code":"IE"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications, the Mandatory Technical Qualifications, and other qualifications, if applicable. EXECUTIVE CORE QUALIFICATIONS: All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. You must address each ECQ separately, not to exceed 10 pages. You are required to respond to all ECQs. If you fail to do so will result in a rating of 'ineligible.' You should limit your narrative to two pages per ECQ, and address each ECQ separately. OPM's Guide to Senior Executive Service Qualifications can assist you in writing an effective SES application. The Guide is available on OPM's Website at: http://www.opm.gov/ses/references/guidetoSESQuals_2012.pdf ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment.\nECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts.\nECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks.\nECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically.\nECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. QUALIFICATIONS REQUIRED: To meet the minimum qualification requirements for this position, you must show that you possess the Intelligence Community (IC) Senior Officer Core Qualifications (SOCQ). Intelligence Community (IC) Senior Officer Core Qualification (SOCQ) - Leading the Intelligence Enterprise: Required for all senior executive positions effective 1 October 2010. This SOCQ involves the ability to integrate resources, information, interests, and activities effectively in support of the IC's mission and to lead and leverage cross organizational collaborative networks to achieve significant mission results. Inherent to this Standard is a deep understanding of the Intelligence enterprise (or other comparable interagency or multi-organizational environment) and a shared commitment to the IC's core values. (Include a separate attachment one page maximum per competency). IC Senior Officers have a responsibility to share information and knowledge to achieve results, in that regard are expected to build effective networks and alliances; actively engage these peers and stakeholders; involve them in key decision; and effectively leverage these networks to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must: (1) Collaboration and Integration: Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes. Integrate joint/multi-agency activities effectively exercising collaborative plans that realize mutual IC, joint, or multi-organizational goals.\n(2) Enterprise Focus: IC Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information and other inputs to effectively integrate and align component, IC, and the United States Government interests and activities to achieve IC-wide, national, and international priorities. Senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce enterprise focus among their subordinates. Candidates assessed against the component must: Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi-organizational mission accomplishment. Understand how organizations, resources, information, and processes within the IC interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems.\n(3) Values-Centered Leadership: IC Senior officers are expected to personally embody, advance and reinforce IC core values. Senior officers are expected to demonstrate and promote departmental and/or component values. Candidates assessed against this competency must demonstrate: A Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties. The Integrity and Courage(moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk. Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. Promote, reinforce, and reward IC, departmental/component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values. Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. MANDATORY TECHNICAL QUALIFICATIONS: All applicants must submit written statements (narrative format) of accomplishments that would satisfy the technical qualifications. You must address each technical qualification separately. If you fail to do so, you will be rated as ineligible. Please limit your written statements to no more than two pages per technical qualification. 1. Expert knowledge and understanding of organizational and functional relationships within DoD, the intelligence community and national security community.\n2. Expert knowledge of DoD intelligence collection - HUMINT, SIGINT, Cyber, MASINT, GEOINT, OSINT - and related functional and enabling activities such as identity intelligence, special communications, foreign material acquisition and exploitation; and clandestine and sensitive activities and operations.\n3. Knowledge of advanced management, executive, and organizational principles and practices at the national level related to programs that include development and execution of intelligence, HUMINT, SIGINT, Cyber, MASINT, GEOINT, OSINT, identity intelligence, special communications, foreign material acquisition and exploitation, clandestine and sensitive activities and operations.\n4. Demonstrated ability to provide direction, operational advice and consultation for enterprise level activities to top-level officials in the DoD, the Military Departments, Defense Agencies and/or Defense industrial organizations.\n5. Senior level experience in crafting, coordinating, and implementation of national level policies, regulations, and legislation","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-16T00:00:00.0000","PositionEndDate":"2022-03-16T23:59:59.9970","PublicationStartDate":"2022-02-16T00:00:00.0000","ApplicationCloseDate":"2022-03-16T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position is in the Excepted Service under Title 10, Defense Civilian Intelligence Personnel System. Excepted Service includes all positions in the Executive Branch of the Federal Government which are specifically excepted from the competitive service by or pursuant to statute, by the President, or by the Office of Personnel Management, and which are not in the Senior Executive Service.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","SubAgencyName":"Office of the Under Secretary of Defense (Intelligence and Security)","OrganizationCodes":"DD/DD01","Relocation":"False","HiringPath":["fed-competitive","fed-excepted","ses"],"TotalOpenings":"1","AgencyMarketingStatement":"The Under Secretary of Defense for Intelligence and Security is the principal intelligence, counterintelligence and security advisor to the Secretary of Defense (SecDef), and the SecDef's principal representative to the Intelligence Community. The USDI&S exercises authority, direction, and control on behalf of the SecDef over the National Security Agency/Central Security Service, the Defense Intelligence Agency, the National Geospatial-Intelligence Agency, the National Reconnaissance Office, and the Defense Security Service. The USDI&S establishes policy and priorities; and oversees the Defense Intelligence Enterprise, including the Military Intelligence Program, the Defense portion of the National Intelligence Program, and the Battlespace Awareness Portfolio. The Office of the Under Secretary of Defense for Intelligence & Security (OUSD(I&S)) works all oversight, guidance, policy, capability, and resources issues with the Office of the Secretary of Defense, the Director of National Intelligence, the Military Services, the Combatant Commands, and the Defense Intelligence and Security Agencies, on behalf of the Under Secretary. This position is in the Defense Intelligence Senior Executive Service (DISES), a small elite group of top government leaders.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["This position is located in the Office of the Director for Defense Intelligence (Collection & Special Programs) (DDI C&SP), within the Office of the Under Secretary of Defense for Intelligence & Security (OUSD(I&S)). Major duties and responsibilities will also include: Assists the DDI(C&SP), in providing executive leadership, management, and supervision of five DDI subordinate offices and assigned mission areas. Provides executive guidance and oversees execution of all staff actions and related operations and activities of the office of the DDI(C&SP) and its subordinate and supporting organizations. Establishes, implements, and monitors staff procedures to ensure all DDI(C&SP) staff actions are timely and complete. Develops and sustains close working senior level relationships with staff counterparts in the USD(I&S) front office, the three other USD(I&S) DDI offices, and across the Office of the Secretary of Defense, the Joint Staff to ensure operations and activities are fully synchronized, coordinated, and deconflicted. Represents the SecDef and the USD(I&S) at the National Security Council level, to include participating in Policy Coordination Committee (PCC) meetings and conveying the Secretary's Defense enterprise-wide perspective on key areas of Intelligence and Intelligence related Collection, Special Programs, and Sensitive Activities. Leads development and delivery of strategic communications and public affairs engagements to represent the Department's vision, concept, and strategy Intelligence and Intelligence related Collection, Special Programs, and Sensitive Activities. Provides expert advice on the planning, oversight, and reporting of Department of Defense Intelligence and Intelligence related Collection, Special Programs, and Sensitive Activities, with special emphasis on Congressional reporting of these activities in accordance with requirements specified in National Defense Authorization act and accompanying classified annexes. Prepares classified and unclassified Congressional testimony, staffer briefings, and speeches on Defense Intelligence Collection, Intelligence related Collection, Special Programs, and Sensitive Activities, that shapes the views of government officials, the public, and our international partners."],"Education":"There is no education requirement for this position.","Requirements":"You must be a U.S. citizen to qualify for this position. Males born after 12-31-59 must be registered or exempt from Selective Service (see https://www.sss.gov/Home/Registration) You must submit to a drug test and receive a negative drug test before you can be appointed. You must be able to obtain a Top Secret security clearance and access to Special Compartmented Information (TS/SCI). In accordance with the provisions of ICD 601, joint duty assignments will be a prerequisite for promotion to senior civilian rank. To qualify, please provide a copy of your completed Joint Duty assignment SF-50 or an adjudicated IC JD Claims form. More information regarding the Intelligence Community Civilian Joint Duty Program, can be found at:http://www.icjointduty.gov The individual selected will be required to file an 'Executive Branch Personnel Financial Disclosure Report (OGE-278) in accordance with the Ethics in Government Act of 1978. Initial appointee to a DISES position must serve a two-year DISES trial period, which can be served concurrently with the two-year DCIPS trial period. Employees who have previously completed a trial period in the DCIPS position shall not serve another trial period upon acceptance of or reappointment to another DCIPS position. Current DCIPS employees who are in a DCIPS trial period and transfer to another DCIPS Component shall finish their trial period in the new DCIPS position. Submit resume and all other required documents online by 11:59 PM Eastern Standard Time on03/16/2022 NOTE: All Intelligence executive level positions require Joint Duty credit. Only those candidates who meet the Joint Duty Credit requirement will be eligible to compete/be considered for a senior executive position. Employees will receive joint duty credit for almost any rotational assignment to another Intelligence Community (IC) component and may also be eligible to receive credit for service outside the IC (military, other government, or private sector) as long as the assignment was at the Band 3 (GS 11 to GS 13) level or above and it occurred on or after September 11, 2001. An external candidate, if selected, will be required to immediately apply for Joint Duty Credit. Employees without Joint Duty credit may apply for the position and can be considered. If selected a waiver would be required prior to final appointment. IC seniors without Joint Duty at the same tier level may lateral into the position if selected without requesting a waiver.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments, experience, and education. Your application will be evaluated by a rating and ranking panel, and highly qualified candidates may undergo an interview and a reference check. The Office of the Secretary of Defense Executive Resource Board will review results and make recommendations on final selections to the appointing authority.","HowToApply":"TO SUBMIT AN APPLICATION THROUGH USAJOBS: In order to expedite the review of your application, you must submit a complete online application package to include the Resume, the Mandatory Technical Qualifications, Intelligence Community Senior Core Qualification, and the Executive Core Qualifications. To apply online, please select the 'Apply Online' button at the bottom of this announcement. Please note: your online resume may not be a complete application. Be sure to carefully read this announcement to see if additional information is required and how it should be submitted. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: https://help.usastaffing.gov/Apply/index.php? title=Alternate_Application_Information","WhatToExpectNext":"After all application packages have been received, we will review your application to ensure you meet the basic qualification requirements. The Executive Evaluation Panel will evaluate each applicant who meets the basic qualifications based on the information provided and will generate a certificate of best qualified candidates for the selecting official. The selecting official may interview the best qualified candidates before making a selection. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement.","RequiredDocuments":"1. Resume - In addition to your written statements addressing the Intelligence Community Senior Officer Core Qualifications and the Mandatory Technical Qualification(s), and other qualifications as applicable, submit a resume or any other written format you choose to describe your qualifications, not to exceed five pages. Applicants typically provide the following information: Vacancy Announcement number DISES-11390051-22-VH Full name, email and mailing address, and day and evening telephone numbers Educational information including the name, city, and state of colleges or universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www.edu.gov/admins/finaid/accred/index.html Information about your paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary Information about honors, awards, and special accomplishments 2. Mandatory ECQ statements. A narrative statement specifically addressing each individual ECQ. Total ECQ write-up should not exceed 10 pages. If you are a current DISES or other Senior Intelligence Executive, career member of the SES, or have completed an SES Candidate Development Program and obtained Office of Personnel Management (OPM) Qualifications Review Board certification of your ECQs, you are not required to submit the ECQ narrative. However, you must address the IC SOCQ and provide a copy of your Standard Form 50 or OPM certificate. 3. Intelligence Community Senior Core Qualification (IC SOCQ). Separate attachment one page maximum per competency. 4. Mandatory Technical Qualifications (MTQs): A narrative statement specifically addressing each mandatory technical qualification. MTQ statements should not exceed two pages per MTQ. 5. Copy of Notification of Personnel Action (SF-50): Current and former SES, DISES and other Intelligence Senior Executive members must provide an SF-50 showing their status or reinstatement eligibility. 6. Joint Duty Assignment documentation: To qualify, please provide a copy of your completed Joint Duty assignment SF-50 or an adjudicated IC JD claim form. For more information regarding the Intelligence Community Joint Duty Program, please refer to http://www.icjointduty.gov. DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as award certificates will not be considered.","Benefits":"","BenefitsUrl":"https://help.usajobs.gov/index.php/Pay_and_Benefits","BenefitsDisplayDefaultText":false,"OtherInformation":"Applications MUST be submitted through USAJobs.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"whs.pentagon.hrd.mbx.semo-job-application-assistant@mail.mil","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","PositionSensitivitiy":"Special-Sensitive (SS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"638773300","MatchedObjectDescriptor":{"PositionID":"SAFMRL-2022-09","PositionTitle":"Deputy Director of Staff-Secretariat","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/638773300","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/638773300?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Miscellaneous Administration And Program","Code":"0301"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Eligibility will be based upon a clear showing the applicant has training, education and experience of the scope and quality sufficient to effectively carry-out the duties of the position. Candidates must exemplify the corporate perspective, leadership vision, broad experience and character needed in the SES corps not only to satisfy the immediate vacancy, but future vacancies which will occur in a variety of organizations, functions and locations. B. MANDATORY TECHNICAL QUALIFICATIONS (TQs): (Your narrative response to both TQs should not exceed 2 Pages TOTAL; recommend 1 page for each TQ) A supplemental statement must be submitted separately addressing each TQ. TQs must provide specific examples that address relevant experience and accomplishments. Applicants should focus on recent experience, education, and training, as some Recruitment Panel and Executive Resources Board members may consider experience that's over 10 years old to be outdated. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: 1. In-depth knowledge and demonstrated experience leading, managing and overseeing a high-visibility organization. Ability to lead, advocate, synchronize, integrate, assess, and analyze work operations, balancing change and continual improvement in policies, programs, processes, and procedures; recommending and implementing solutions that lead to efficient and effective operational practices. 2. Strong analysis and writing skills. Skilled at executive communication and able to identify the key issues that are the most critical to organizational leadership. In-depth knowledge of the Secretariat, Air Staff, and Space Staff functions with experience integrating disparate positions for the best organizational result. In addition, DoD requires an Enterprise Perspective. The individual must possess a broad point of view and an awareness and understanding of individual or organizational responsibilities in relation to DoD or government-wide strategic priorities. Executives should demonstrate ability to work with internal and external partners to support national security objectives. This perspective is typically gained through a variety of diverse work experiences. A separate narrative statement is not required--this information should be embedded within the application package [Resume (not to exceed 5 pages) and Technical Qualifications (not to exceed a combined total of 2 pages)].","PositionRemuneration":[{"MinimumRange":"163333.0","MaximumRange":"187300.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-23T00:00:00.0000","PositionEndDate":"2022-03-08T23:59:59.9970","PublicationStartDate":"2022-02-23T00:00:00.0000","ApplicationCloseDate":"2022-03-08T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. Serves as the Deputy Director of Staff supporting the Director of Staff, Secretariat, Secretary of the Air Force. The additional purpose of the position is to support both Chiefs of Staff as well as the Air Force and Space Force Directors of Staff. Along with the Director, the position manages the day-to-day administration, integration, and activities of the Department of the Air Force Secretariat (SAF).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","OrganizationCodes":"DD/AF00","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"The mission of the United States Air Force is to fly, fight and win...airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. SALARY: $163,333.00 - $187,300.00 per annum. (Air Force Tier 1) SES members are eligible for bonuses and/or ranks and stipends in addition to annual salary. AREA OF CONSIDERATION: Applications will be accepted from all qualified persons. SES members are eligible for Performance-Based Salary increases and/or bonuses. This is a SES Career Reserved position and is assigned a precedence priority code of DV-6/ Brig Gen, Tier 1 for protocol purposes. POSITION: This position is a Tier 1 Target Tier 2. MOBILITY: Organizational and geographical mobility is essential in developing and managing SES and DISES leaders and generally is a key to advancement. Therefore, mobility is a condition of employment and appointed SES and DISES members will be required to sign a Reassignment Rights and Obligation Agreement.","TravelCode":"2","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["1. Program Direction and Guidance: The incumbent shares with the Director in providing\nguidance and direction over a range of Secretariat programs and issues. Provides executive level\noversight, management, guidance and direction in support of the Secretary and Under Secretary\nstaff mission and administrative operations. Advises the Director of Staff and may occasionally\nprovide direct advisory to the Secretary of the Air Force, Under Secretary of the Air Force, and\nindirectly to CSAF, and CSO on actions required to resolve critical issues involving Department\nof the Air Force interests. 2. Professional and Technical Leadership: Serves as a civilian executive of mission management\nfunctions, operations, and activities. Identifies contentious and special problems and issues and\nmakes recommendations or implements solutions to negate. With the Director, evaluates\nrequirements for additional resources submitted by subordinate staff to balance organization\nneeds with SAF/DS mission requirements and resource interests. 3. Executive leadership and Management: Shares responsibility with the Director in providing\nexecutive leadership, management, oversight, and direction to the SAF/DS workforce. Directs\nthe work of two or more organizational units consisting of senior military, civilian, and\ncontracting personnel. Monitors and evaluates the progress of the organization towards meeting\ngoals. Makes or recommends adjustment in objectives, work plans, schedules, and commits and\nadjusts resources as appropriate. Assures identification, execution, collaboration, coordination,\nand communication of critical Department of the Air Force priorities and assures sound\nmanagement practices and principles are used throughout organizational units in executing the\nmission. 4. Participates with the Director in obtaining and allocating resources necessary to\nimplement and execute the SAF/DS mission. Assists in ensuring the effective use of funds,\npersonnel, facilities and contracts."],"Education":"There is no positive education requirement for this position.","Requirements":"","Evaluations":"ATTENTION APPLICANTS: IN RESPONSE TO THE FOLLOWING QUESTION DURING YOUR APPLICATION PROCESS, PLEASE SELECT ITEM (1). YOUR 5-PAGE RESUME TAKES THE PLACE OF THE TRADITIONAL 10-PAGE ECQ NARRATIVE FOR THIS SES VACANCY: If you are NOT a current or former SES Career employee (appointed under Title 5 U.S.C. 3393), or a graduate of an approved SES Candidate Development Program, you must also include a separate narrative response to each of the Executive Core Qualifications. Failure to address these qualifications in a separate narrative response will eliminate you from consideration. Please select the response that best describes your application package: I have submitted a separate narrative response to the Executive Core Qualifications. A Resume-based Senior Executive Service (SES) Hiring Method will be used for this recruitment. This method provides an alternative to traditional submissions that requires applicants to submit a resume and 10-page written Executive Core Qualification (ECQ) narrative statement. A well-written resume for this announcement should demonstrate to Senior Hiring Officials that you possess the essential ECQs with supporting accomplishments. Applicants should incorporate ECQs and technical competencies as they write their resumes and can refer to the following OPM Link for additional guidance on SES Executive Qualifications: https://www.opm.gov/policy-data-oversight/senior-executive-service/reference-materials/guidetosesquals_2012.pdf. In addition, the Department of the Air Force highly encourages applicants to seek mentoring assistance from a current SES member in preparing their package beforehand. PLEASE NOTE: This position will be filled under the FY2021 NDAA Section 1118, \"Pilot Program for Initial Appointments to Senior Executive Service Positions in the Department of Defense (DoD).\" This authority allows us to appoint qualified individuals to initial career appointments into the Senior Executive Service of the DoD without regard to 5 U.S.C. 3393(c). A career SES appointment made under this authority does not guarantee that you will be eligible to transfer to another career SES appointment outside of the DoD without the need for you to compete. Other Federal agencies may require you to submit ECQs to OPM's QRB prior to your appointment. Applications will be evaluated against the executive core qualifications and technical qualification requirements. Failure to meet either of these Qualifications standards will eliminate a candidate from further consideration. Candidates will be evaluated for this position by a screening panel composed of a diverse mix of senior executives and/or general officers selected from organizational and/or functional backgrounds relevant to this position. The panel discusses each application and reaches consensus on the resume packages demonstrating a high degree of the executive core qualifications and technical competencies. Only those applicants whose packages demonstrate a mastery of ECQs and technical competencies are selected for interviews. Post interview, the panel will then make a recommendation of those Best Qualified candidates and refer them to selecting office in priority order. Final selection and approval is contingent upon the Executive Resources Board and the Under Secretary of the Air Force. REMINDER: Before uploading your required PDF documents (Resume, Technical Qualification narrative), please ensure they DO NOT EXCEED the noted page limits.","HowToApply":"Please follow the below instructions to submit applications. Any applications received that do not include all of the required documents or do not meet format requirements will not be forwarded for consideration. The complete Application Package must be submitted by 11:59 PM (ET) on . To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant. SUGGESTED RESUME FORMAT: (Limit 5 pages/Times New Roman 12-font) (Do Not Use the USAJOBS Resume Builder) - Please submit a typewritten resume (upload as a PDF), including the following information: Job Information: Announcement number (SAFMRL-2022-09) and title of the position to which you are applying. Personal Information: Full name, mailing address (with zip code), day and evening phone numbers (with area code) and complete e-mail address where you would like to receive correspondence regarding your application. **PLEASE DO NOT INCLUDE SOCIAL SECURITY NUMBER** Active-Duty/Retired Military: State highest rank held, date of promotion and date eligible to retire or date of retirement. (e.g., Colonel/June 2006/December 2014). NOTE: IAW 5 U.S.C. 3326, a 180-day waiver will be required for retired or retiring members of the armed forces during the period of 180 days immediately after retirement. Education: Educational information, including the name, city and state of colleges or universities you attended, as well as the type and year of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www.ed.gov/admins/finaid/accred/index.html Work Experience: Give the following information for your paid and non-paid work experience related to the job for which you are applying: (Do not send job descriptions).\n- Starting and ending dates (month and year)\n- Job title (for government position, include civilian series and grade or military rank)\n- Employer's name and address\n- Supervisor's name and phone number, please indicate if we may contact your current supervisor\n- Salary (current) HELPFUL HINTS FOR YOUR RESUME: - Reflect on the ECQs and think about how your past experiences and education relate to each ECQ as your incorporate them into your resume. - Read the vacancy announcement carefully. - Adhere to the 5-page limitation (in PDF format and 12 point font) - Quantify your accomplishments and describe the impact of those accomplishments. * Applicants should focus on recency of experience - Recruitment Panels, Executive Resources Boards, and Hiring Officials may consider experience over 10 years outdated.\n* Seek mentoring assistance from a current SES or equivalent to review your package before submission. References: Provide the names, addresses and telephone numbers of three individuals who can comment on your qualifications for this position. Please do not list supervisors already listed above. This agency provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application or hiring process, please notify this office. The decision on granting reasonable accommodations will be on a case-by-case basis. SAF/MRL CONTACT INFORMATION: Questions regarding this announcement may be directed to Virginia Reynolds at virginia.reynolds@us.af.mil, Melanie McGuire at melanie.mcguire@us.af.mil.","WhatToExpectNext":"Once your application package is received an acknowledgement email will be sent. If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility and qualifications for consideration. If you are determined to be ineligible or not qualified, your application will receive no further consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the more information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"To receive full consideration, each applicant must submit the documents in the format as designated. Packages that do not include all of the required documents or meet format requirements will not be forwarded for consideration. **************ALL DOCUMENTS MUST BE UPLOADED IN PDF FORMAT******************* The Qualifications Documents must be formatted using Times New Roman, size 12 font, with 1-inch margins. Do not use borders, provide photos, or list a Social Security Number on any of the Qualifications Documents. DO NOT COMBINE DOCUMENTS. A. A resume-based application method will be used. Do NOT submit traditional ECQ narratives. Instead, applicants are required to submit a resume, not to exceed 5 pages, that shows possession of the ECQs. (See suggested format below). Upload in PDF format. PLEASE DO NOT USE USAJOBS RESUME BUILDER. B. Mandatory Technical Qualifications Statement addressing each of the TQs. Your MTQs must not exceed a combined total of 2 pages. Upload in PDF format and include the MTQ statement as indicated in the announcement. C. Most recent completed Performance Appraisal (current and/or former federal employees) or Performance Report (OPR or EPR). For applicants in the private sector, please provide a copy of your equivalent Evaluation Report. D. Current or Former Senior Executives (SES) must provide a copy of their Qualifications Review Board (QRB) certification (applies only to CDP graduates). E. Most recent Notification of Personnel Action, SF-50, noting your current position, grade level and salary level (applies only to current or former civilian government employee). G. Military: Retired - a copy of your DD214 and/or Retirement orders. If you are currently Active Duty - submit a Statement of Service Letter and state highest rank held date of promotion and date eligible to retire or date of retirement. H. (Optional): Race and National Origin Identification, SF-181 -- Form available at www.opm.gov I. (Optional): Self-Identification of Handicap, SF-256 -- Form available at www.opm.gov DO NOT SUBMIT ANY ADDITIONAL INFORMATION: Extraneous materials such as copies of position descriptions, award certificates and transmittal letters will not be forwarded for review.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Education: A bachelor's degree from an accredited institution is desired. A master's or advanced degree from an accredited institution is highly desired. An undergraduate technical degree or an advanced degree in either a technical or management field is highly desired. Veterans' Preference: Veterans' preference is not applicable to the SES. Relocation Authorized: Payment of Permanent Change of Station (PCS) costs is authorized in accordance with the Joint Travel Regulations (JTR). Recruitment/Relocation Incentive: May be offered funds permitting. Direct Deposit: All federal employees are required to have direct deposit. To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities please click here. Subsequently, FTR Bulletin 20-04 issued by GSA, provides further information regarding NDAA FY2020, Public Law 116-92, and the expansion of eligibility beyond \"transferred\" for WTA/RITA allowances. For additional information, please click here. If you have questions regarding this announcement and have hearing or speech difficulties click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"melanie.mcguire@us.af.mil","AgencyContactPhone":"703-695-4555","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"640497500","MatchedObjectDescriptor":{"PositionID":"DA-22-JLA-11407973","PositionTitle":"Director, Financial Information Management, ASA FM&C","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/640497500","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/640497500?PostingChannelID="],"PositionLocationDisplay":"Pentagon, Arlington, Virginia","PositionLocation":[{"LocationName":"Pentagon, Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Pentagon, Arlington, Virginia","Longitude":-77.06204,"Latitude":38.86163}],"OrganizationName":"Office of the Secretary of the Army","DepartmentName":"Department of the Army","SubAgency":"Office of the Assistant Secretary of the Army (Financial Management & Comptroller)","JobCategory":[{"Name":"Financial Administration And Program","Code":"0501"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"**To meet the minimum qualification requirements for this position, you must show that you possess the five Executive Core Qualifications (ECQs), Technical Qualification(s), and other qualifications, if applicable (such as Education - see below). Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp. (1) Mandatory Executive Core Qualification (MANDATORY SUBMISSION) (ECQ) All applicants must submit written statements (narrative format) describing accomplishments that would satisfy the ECQs. Use the Challenge-Context-Action-Result (CCAR) Model to describe your accomplishments. You must address each ECQ separately. You are required to respond to all ECQs. Failure to do so, will result in an 'ineligible' rating. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Please Note: Current career SES members, former career SES members with reinstatement eligibility, and SES Candidate Development Program (DCP), who have been certified by the OPM do not need to address ECQs. ECQ 1 - Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment. ECQ 2 - Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent to this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. ECQ 3 - Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent to this ECQ is the ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risks. ECQ 4 - Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically. ECQ 5 - Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, State and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. (2) MANDATORY TECHNICAL QUALIFICATION(S) (TQ): (MANDATORY SUBMISSION) A supplemental statement must be submitted separately addressing each TQ. Your TQ must provide specific examples that address relevant experience and accomplishments. Total TQ write-up should not exceed 2 pages per TQ using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: Expert knowledge of automated financial systems, particularly those that operate in support of the Federal Government and DoD, and perform finance and accounting activities / operations and performance management. Activities include data integration activities, management controls, internal review and audit compliance. ADDITIONAL REQUIREMENTS: THIS IS A SENIOR EXECUTIVE SERVICE (SES) LEVEL FINANCIAL MANAGEMENT LEVEL 3 CERTIFIED POSITION. In accordance with the National Defense Authorization Act (NDAA) 2012, Public Law 112-81, Subtitle F-Financial Management, section 1051, amending 10 United States Code, section 1599d, incumbent of this position is required to comply with all Department of Defense and Department of the Army requirements of this certification program. Financial Management (FM) applicants must be able to obtain the FM Certification requirement of the position to which he or she is assigned. Such certification is a condition of employment. Only FM workforce members currently assigned to positions with an FM Certification designation are included in the FM Certification. Program and are authorized to achieve FM certification at the designated level. If selected and not currently assigned to a position with FM Certification, selectee will have 2-years in which to obtain certification. In the event a member cannot obtain the FM Certification within the initial 2-year time period, the CCA may grant one or more time extensions of up to 1 year to remain in the position. Supervisors are responsible for monitoring and tracking FM members' progress toward certification and working with their human resources offices to take progressive discipline as appropriate so that FM members attain their certification levels within the required time period. If an individual fails to obtain the required FM Certification and any CCA approved time extension(s) have expired, the individual may be subject to adverse actions, up to and including, reassignment to a lower grade, or removal from government service.","PositionRemuneration":[{"MinimumRange":"135468.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-03T06:50:53.2000","PositionEndDate":"2022-03-16T23:59:59.9970","PublicationStartDate":"2022-03-03T06:50:53.2000","ApplicationCloseDate":"2022-03-16T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"See below.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"00","SubAgencyName":"Office of the Assistant Secretary of the Army (Financial Management & Comptroller)","OrganizationCodes":"DD/ARSA","Relocation":"True","HiringPath":["ses","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. This position is in the Senior Executive Service (SES) which is a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As a Senior Executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. The Department of the Army is an Equal Opportunity Employer.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["The Director of Financial Information Management (DFIM) serves as the Army Financial Management (FM) community's Chief Architect, Data Steward, and Information and Data Analytics Officer responsible for ensuring comprehensive development and establishment of an effective FM Systems and Data Domains and portfolio (including ERPs with FM functionality, such as LMP, GCSS-A, AESIP, and GCSS-A). The position maintains the FM enterprise architecture, and provides governance for systems requirements, functional designs, and implementation over the FM systems portfolio, certification of the Army's Information Technology (IT) budget, continuity of IT services for financial management business applications. This position also provides reform, transformation, and innovation to solve long-standing problems with technological solutions to improve Army's FM systems and processes. The scope of the DFIM encompasses the Army's working capital, non-appropriated funds, and general funds to include ongoing efforts to inventory, document, integrate, and transform Army's portfolio of financial systems and related business processes worldwide. The DFIM coordinates Army-wide financial management business systems and process transformation across ASA (FM&C), external stakeholders\nand service provider organizations (e.g. DFAS, PEO EIS, other Army Business Mission Area leads, GFEBS PMO, OBT, OSD, and other Military Services). The DFIM generates guidance in terms of broad plans, policies, programs and ultimate goals promulgated by the ASA (FM&C). Individual has substantial independence, is expected to function with little guidance and oversight, and has authority to advise, coordinate, and direct the development of financial business processes and programs necessary to achieve compatible, auditable financial systems within an Army system of systems. Evaluation of performance is measured against program accomplishments and impact of improved financial performance reporting and decision-making capability for Army leaders and financial accountability to the public."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"CONDITIONS OF EMPLOYMENT:\nYou must be a U.S. citizen to be eligible for this position.\nYou must be able to submit and pass designated and/or Random Drug Testing as required.\nYou must be able to obtain/maintain a Level III Financial Management Certification.\nYou must be able to obtain/maintain the appropriate clearance and access level for this position.\nYou must sign a mobility agreement.\nInformation may be requested regarding the vaccination status of selectees for the purposes of implementing workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/ Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. You will serve a two-year probationary period unless you have previously completed the probationary period in the SES. Appointment is subject to the completion of a favorable suitability or fitness determination, as determined by a background investigation. Direct deposit of pay is required. This position requires you to submit a Public Financial Disclosure Report (OGE 278) upon entry, and annually thereafter. The incumbent is required to travel on both scheduled and unscheduled aircraft, and other modes as required, under conditions specified under the DoD Joint Travel Regulations. The incumbent is expected to travel on short notice to attend high level meetings to obtain resolution of problems and gather information to assist in the decision making process. Mobility: An essential element of the SES is mobility across geographic, organizational and functional lines. Individuals selected for Army SES positions may be subject to reassignment that requires them to be mobile. The U.S. Army senior leadership considers mobility to be an integral part of employment as an SES member with the Department of the Army.","Evaluations":"You will be evaluated on the quality and extent of your total accomplishments and experience. Your resume will be evaluated by an SES rating and ranking panel, and afterwards, highly qualified candidates will undergo the Structured Interview process.The Executive Resources Board (ERB) will review results and make recommendations on final selections to the appointing authority where final interviews and reference checks may occur.","HowToApply":"*** You MUST apply online. Applying online will allow you to review and track the status of your application.*** To receive consideration, applicants must submit application material as specified below. Complete applications must be received in this office by 11:59 p.m. Eastern Time (ET) 03/16/2022. Incomplete applications will not be considered. Do not submit additional items such as copies of additional performance appraisals, position descriptions, etc. Such items may be removed and will not be returned. Also application material cannot be returned. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the View Occupational Questionnaire Click the Submit My Answers button to submit your application package. It is your responsibility to ensure your responses and appropriate documentation is submitted prior to 11:59 p.m. Eastern Time (ET) . To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the more information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. Applicants who fail to submit all information and documents (i.e. Resume, ECQs, TQs, SF50 if applicable, and Performance Appraisal/Letter of Recommendation, Occupational Questionnaire, and other qualifications as applicable) WILL NOT receive consideration for the position. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. You must upload your ECQs, TQs and any Official Transcripts when required. If you have an SF50, please submit that as well. Your performance assessment or a Letter of Recommendation IS mandatory. Upload either document under Performance Appraisal. All Required documents must be uploaded or your application will be considered incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. ************************************************************\nBackground Survey Questionnaire, (OPTIONAL SUBMISSION): Form (O.M.B. No. 3046-0046) located: http://www.archives.gov/careers/jobs/forms/omb-3046-0046.pdf The information from this survey is used to help insure that agency personnel practices meet the requirements of Federal law. This information is provided pursuant to Public Law 93-579 (Privacy Act of 1974), December 31, 1974, for individuals completing Federal records and forms that solicit personal information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application..","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. We will evaluate each applicant who meets the basic qualifications based on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct a suitability and/or security background investigation. You should expect to hear back on the outcome of your application within 90 days of the closing date of the announcement. If you are determined to be ineligible or not qualified, or your application is incomplete, your application will receive no further consideration. Pay is set based on consideration of selectee's current salary and other factors. Once you enter on duty, you will be required to complete a Confidential Financial Disclosure Report (OGE 278e) within 30 days of entering this position. Please notify your servicing ethics counselor (part of the legal office) as soon as possible after starting your SES duties so the ethics counselor can assign you a new entrant report in the online Integrity system, (https://integrity.gov/efeds-login/).","RequiredDocuments":"To apply for this position, you must provide a complete Application Package which includes:\n1. Your Resume (MANDATORY SUBMISSION): Submit a resume or any other written format you choose to describe your qualifications. Your resume must contain: Vacancy Announcement number Full name, email, mailing address, day and evening telephone numbers. Educational information including the name, city, and state of colleges/universities you attended, as well as the type of any degree received. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. For more information, you may refer to the following U.S. Department of Education website: http://www2.ed.gov/admins/finaid/accred/index.html Information about paid and nonpaid work experience related to this position including: job title, duties and accomplishments, employer's name and address, duration of employment, and salary. Information about honors, awards, and special accomplishments. 2. Executive Core Qualifications (MANDATORY SUBMISSION): A narrative statement specifically addressing each individual ECQ using the Challenge-Context-Action-Result Model. Each accomplishment should be clear, concise, and emphasize your level of responsibilities, the scope and complexity of programs managed, and results of your actions. Total ECQ write-up should not exceed 10 pages using 12pt, Arial or Times New Roman with 1 inch margins. Additional information on ECQs is available at http://www.opm.gov/ses/recruitment/ecq.asp In lieu of the narrative statement, current career SES members, reinstatement eligible, and SES Candidate Development Program graduates must provide the documentation listed in item #5 - you must load your certificate under the Executive Core Qualifications. 3. Mandatory Technical Qualification (MANDATORY SUBMISSION): A separate narrative statement specifically addressing the mandatory technical qualification. This separate statement should not exceed two pages (per MTQ) using 12pt, Arial or Times New Roman with 1 inch margins. Applicants must reflect superior technical qualifications demonstrated through leadership and management in the following: Expert knowledge of automated financial systems, particularly those that operate in support of the Federal Government and DoD, and perform finance and accounting activities / operations and performance management. Activities include data integration activities, management controls, internal review and audit compliance. 4. Performance Assessment. (MANDATORY SUBMISSION): Submit ONE of the following: A signed letter of recommendation dated within the last three years that assesses your performance; *or* your most recent signed performance appraisal. (Please do not submit any prior appraisals.) 5. Current or former employees MUST provide an SF-50 showing their status or reinstatement eligibility. SES Candidates who have successfully completed an Office of Personnel Management approved SES Candidate Development Program must submit a copy of their ECQ certification. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. Veteran's Preference: By law Veteran's Preference does not apply to the Senior Executive Service. False Statements: If you make a false statement in any part of your application, you may not be hired; you may be fired after you begin work; or you may be subject to fine, imprisonment, or other disciplinary action. Non Discrimination: All applicants will be considered without regard to race, color, religion, national origin, marital status, political affiliation, age, sex, sexual orientation, disabling condition, membership in an employee organization, or any other non-merit factors. Adverse Information Screening: Applicants proposed for selection are subject to inquiries as to any incidences of misconduct, malfeasance, neglect of duty, or the appearance thereof. Information gained in this check will be considered in the approval decision. E-verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" system. Federal Law requires DHS to use the E-Verify system to verify the employment eligibility of all new hires, and obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system as a condition of continued employment. The U.S. Department of Army is an E-Verify Participant","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"JESSICA.L.ARMSTRONG.CIV@ARMY.MIL","AgencyContactPhone":"703-692-3317","SecurityClearance":"Top Secret","DrugTestRequired":"True","PositionSensitivitiy":"Critical-Sensitive (CS)/High Risk","AdjudicationType":["National security"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"638744400","MatchedObjectDescriptor":{"PositionID":"ST-11401709-22-JS","PositionTitle":"SUPERVISORY CRIMINAL INVESTIGATOR","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/638744400","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/638744400?PostingChannelID="],"PositionLocationDisplay":"Stafford, Virginia","PositionLocation":[{"LocationName":"Stafford, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Stafford, Virginia","Longitude":-77.4573,"Latitude":38.4207}],"OrganizationName":"Secretary of the Navy Offices (SECNAV)","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Criminal Investigation","Code":"1811"}],"JobGrade":[{"Code":"IE"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into three areas: Intelligence Community Senior Officer Core Qualifications (ICSOCQs), Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the ICSOCQ, ECQs and MTQs will eliminate you from consideration. INTELLIGENCE COMMUNITY SENIOR OFFICER CORE QUALIFICATION: You will be assessed against the IC Senior Officer Core Qualification Standard - Leading the Intelligence Enterprise to determine your interagency or multi-organizational (business, mission or professional) leadership competencies. Each must be addressed separately in your Supplemental Narrative Statement. Each ICSOCQs must not exceed 2 pages. (Current or former DISES/DISL employees are not required to address the ICSOCQs) 1) Collaboration and Integration. Senior officers have a responsibility to share information and knowledge to achieve results, and in that regard are expected to build effective networks and alliances with key peers and stakeholders across the IC and/or with other United States Government (USG), state, local, tribal and foreign officials, as appropriate; actively engage these peers and stakeholders; involve them in key decisions; and effectively leverage these networks and alliances to achieve significant results. Senior officers are expected to create an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Build, leverage, and lead collaborative networks with key peers and stakeholders across the IC and/or in other government/private-sector organizations, or professional/technical disciplines to achieve significant joint/multi-agency mission outcomes; and integrate joint/multi-agency activities, effectively exercising collaborative plans that realize mutual, joint, or multi-organizational goals. 2) Enterprise Focus. Senior officers are expected to demonstrate a deep understanding of how the missions, structures, leaders, and cultures of the various IC components interact and connect; synthesize resources, information, and other inputs to effectively integrate and align component, IC, and USG interests and activities to achieve IC-wide, national, or international priorities. In addition, senior officers are expected to encourage and support Joint Duty assignments and developmental experiences that develop and reinforce an enterprise focus among their subordinates. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Understand the roles, missions, capabilities, and organizational and political realities of the intelligence enterprise; apply that understanding to drive joint, interagency, or multi- organizational mission accomplishment.\n(b) Understand how organizations, resources, information, and processes within the IC or interagency/multi-organizational environment interact with and influence one another; apply that understanding to solve complex interagency or multi-organizational problems. 3) Values-Centered Leadership. IC senior officers are expected to personally embody, advance, and reinforce IC core values: a Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view. In addition, senior officers are also expected to demonstrate and promote departmental and/or component core values, which may be incorporated in writing, as applicable. Candidates assessed against this competency must demonstrate knowledge, skill, and/or ability to:\n(a) Promote, reinforce, and reward IC, departmental component core values in the workforce and ensure that actions, policies, and practices are aligned with, and embody those values.\n(b) Ensure that organizational strategies, policies, procedures, and actions give appropriate focus, attention, and commitment to diversity of people, points of view, ideas, and insights. EXECUTIVE CORE QUALIFICATIONS: You will be assessed against the Executive Core Qualifications (ECQs).They are designed to assess executive experience and potential - not technical expertise. They measure whether you have the broad executive skills needed in a variety of senior executive positions. Failure to meet a qualification requirement will disqualify an applicant. (Each must be addressed separately in your Supplemental Narrative Statement. The ECQs must not exceed 10 pages.) More information on these core qualifications are available at http://www.opm.gov/ses/recruitment/ecq.asp (Note: Current career Senior Intelligence Service (SIS), Senior Foreign Service (SFS), Senior National Intelligence Service (SNIS) and Senior Executive Service (SES) or Defense Intelligence Senior Executive Service (DISES) members, former SES or DISES members who are reinstatement-eligible and graduates of OPM-certified Candidate Development Programs are not required to address the ECQs, but must address the MTQs.) 1) Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment.\n2) Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent in this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts.\n3) Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent in the ECQ is the ability to make decisions that produce high- quality results by applying technical knowledge, analyzing problems, and calculating risks.\n4) Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically.\n5) Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, state and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. For specific instructions for preparing your statement and definitions of these core qualifications are available at http://www.opm.gov/ses/recruitment/ecq.asp MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Knowledge of all types of counterintelligence investigations, counterespionage operations/techniques, hostile intelligence service methods of operation, relationships between operational/positive intelligence operations and counterintelligence. 2. Knowledge of the NCIS mission, functions, organization, goals and objectives. 3. Knowledge of the mission, and operational technologies of other U.S. Intelligence organizations. 4. Knowledge of criminal investigative policies, procedures and jurisdictions. 5. Ability to safely and adequately operate and carry a handgun and/or other weapon of self-defense as prescribed by NCIS directives is required.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-24T00:00:00.0000","PositionEndDate":"2022-03-10T23:59:59.9970","PublicationStartDate":"2022-02-24T00:00:00.0000","ApplicationCloseDate":"2022-03-10T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as the Executive Assistant Director for National Security, National Criminal Investigative Services (NCIS) Headquarters. The Directorate is responsible for the formulation, oversight, evaluation, coordination, and control of counterintelligence activities crucial to the security of the Department of the Navy (DON) and the United States. You will also provide counterintelligence education programs throughout Department of Defense (DoD).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV12","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","ses"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will direct counterintelligence investigations (espionage, subversion, contacts with hostile country citizens, loss compromise, and leakage of classified information).","You will provide oversight and direction to specific counterintelligence programs, such as cooperating witness programs, double agent operations, port security, technology transfer, operational security programs, and force protection.","You will direct the development of long-range goals and objectives in the counterintelligence arena with significant impact on the ability of the DON to conduct current and future counterintelligence activities.","You will exercise control over the initiation, coordination, analysis and evaluation of all counterintelligence activities conducted by field offices. You will review operational matters and provide technical guidance.","You will determine long-range goals for the port security vulnerability assessment, terrorist threat assessment, and protective service detail programs.","You will represent DON as a member of the Inter-Agency Group on Counterintelligence chaired by the Director of the Federal Bureau of Investigation (FBI).","You will represent DON in counterintelligence working groups; represent NCIS at counterintelligence conferences and meetings.","You will determine the location and assignments of all foreign counterintelligence dedicated special agents and intelligence operations/research specialist personnel at duty stations throughout the world.","You will coordinate and plan with senior fleet and shore-based DON Commanders worldwide to identify major counterintelligence issues, acquaint them with NCIS services, solicit their suggestions and determine long range DON counterintelligence needs."],"Education":"","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad Hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. The ECQs describe the leadership skills needed to succeed as an SES; they also reinforce the concept of an \"SES corporate culture.\" Refer to the OPM Guide to SES Qualifications for specific information and guidance on the ECQ requirements, the C-C-A-R model, and examples of good qualifications statements at the website: http://www.opm.gov/policy-data-oversight/senior-executive-service/reference-materials/guidetosesquals_2012.pdf If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11401709\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 03/10/2022. Applications received after 03/10/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statement must address the Intelligence Community Senior Officer Core Qualifications (ICSOCQs), Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs) listed above. Are you a graduate of an approved SES training program? You must provide a copy of your certificate of completion. A Joint Duty Claim Form is required. You must submit one of the following: an approved Joint Duty claim form, or a completed Joint Duty claim request form with required documentation; or provide a supplemental statement providing evidence of joint duty credit (including dates, location and statement identifying specific Joint Duty Assignment. Failure to provide this information will eliminate you from consideration. The form can be found at the JDA web page: http://www.icjointduty.gov/ Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is in the Defense Intelligence Senior Executive Service (DISES), a small elite group of top government leaders. DISES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. Veterans' preference does not apply to the Senior Executive Service. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is in the excepted service and does not confer competitive status. This position is eligible for part time, full time or ad-hoc telework at the discretion of management. This position is a secondary law enforcement position. The 1811 position requires law enforcement experience and is covered by special retirement provisions, including maximum entry age requirements. Series 1811 Medical Requirements:\nhttp://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1800/criminal-investigation-series-1811/ All Defense Intelligence positions under the Defense Civilian Intelligence Personnel System (DCIPS) are in the excepted service by specific statute, 10 U.S.C. 1601. This position is in the excepted service. Non-DCIPS applicants selected for a DCIPS position must acknowledge in writing, prior to actual appointment to the DCIPS position, that the position for which he or she has been selected is in the excepted service and covered by DCIPS. Federal employees currently serving in the competitive service must also acknowledge that they will voluntarily leave the competitive service by accepting an offer of employment for a DCIPS position. This acknowledgement is necessary as movement between the excepted service and competitive service may be limited if the employee does not possess competitive status. Joint Duty Assignments - Joint IC Duty certification is a prerequisite for appointment to senior executive, senior professional, and DCIPS positions classified above GG grade 15.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"02","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Sensitive Compartmented Information","DrugTestRequired":"True","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"639878900","MatchedObjectDescriptor":{"PositionID":"ST-11404204-22-JS","PositionTitle":"DEPUTY COUNSEL, NAVAL SEA SYSTEMS COMMAND","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639878900","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639878900?PostingChannelID="],"PositionLocationDisplay":"Washington Navy Yard, District of Columbia","PositionLocation":[{"LocationName":"Washington Navy Yard, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington Navy Yard, District of Columbia","Longitude":-76.99695,"Latitude":38.873333}],"OrganizationName":"Naval Sea Systems Command","DepartmentName":"Department of the Navy","JobCategory":[{"Name":"Attorney","Code":"0905"}],"JobGrade":[{"Code":"ES"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"QUALIFICATIONS REQUIREMENTS: Applicants will be assessed against qualifications which fall into two areas: Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs). Failure to provide a separate narrative statement which describes fully and concisely how your experience meets the competencies described in the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications will eliminate you from consideration. EXECUTIVE CORE QUALIFICATIONS: You will be assessed against the Executive Core Qualifications (ECQs).They are designed to assess executive experience and potential - not technical expertise. They measure whether you have the broad executive skills needed in a variety of senior executive positions. Failure to meet a qualification requirement will disqualify an applicant. (Each must be addressed separately in your Supplemental Narrative Statement. The ECQs must not exceed 10 pages.) More information on these core qualifications are available at http://www.opm.gov/ses/recruitment/ecq.asp The ECQs describe the leadership skills needed to succeed as an SES; they also reinforce the concept of an \"SES corporate culture.\" Refer to the OPM Guide to SES Qualifications for specific information and guidance on the ECQ requirements, the C-C-A-R model, and examples of good qualifications statements at the website: http://www.opm.gov/policy-data-oversight/senior-executive-service/reference-materials/guidetosesquals_2012.pdf (Note: Current career Senior Executive Service (SES); former career Senior Executive Service (SES) who are reinstatement-eligible; and graduates of OPM-certified Candidate Development Programs are not required to address the ECQs, but must address the Mandatory Technical Qualifications.) 1) Leading Change: This core qualification involves the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Inherent to this ECQ is the ability to establish an organizational vision and to implement it in a continuously changing environment.\n2) Leading People: This core qualification involves the ability to lead people toward meeting the organization's vision, mission, and goals. Inherent in this ECQ is the ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts.\n3) Results Driven: This core qualification involves the ability to meet organizational goals and customer expectations. Inherent in the ECQ is the ability to make decisions that produce high- quality results by applying technical knowledge, analyzing problems, and calculating risks.\n4) Business Acumen: This core qualification involves the ability to manage human, financial, and information resources strategically.\n5) Building Coalitions: This core qualification involves the ability to build coalitions internally and with other Federal agencies, state and local governments, nonprofit and private sector organizations, foreign governments, or international organizations to achieve common goals. MANDATORY TECHNICAL QUALIFICATIONS: (Each must be addressed separately in your Supplemental Narrative Statement. Each MTQ must not exceed 2 pages.) 1. Ability to analyze and organize complex factual and legal matters for oral and written presentations, including legal work experience demonstrating professional competence through such qualities as sound judgment, initiative, ethics, and industry. 2. Ability to establish effective working relationships with persons having differing interests and to manage, organize, and direct others. 3. Knowledge of and experience in: (a) One or more of the substantive areas of law practiced by OGC: government contracts, Federal employment, environmental, fiscal, intellectual property, and associated litigation; and, (b) Organizational relationships, missions, and procedures of the Department of Defense and the Department of the Navy. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.","PositionRemuneration":[{"MinimumRange":"178063.0","MaximumRange":"203700.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-01T00:00:00.0000","PositionEndDate":"2022-03-31T23:59:59.9970","PublicationStartDate":"2022-03-01T00:00:00.0000","ApplicationCloseDate":"2022-03-31T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"You will serve as Deputy Counsel, Naval Sea Systems Command (NAVSEA), for the Department of the Navy, Office of the General Counsel (DON OGC). As a Senior Executive within DON OGC, you will serve as the alter ego to Counsel, NAVSEA, who is the chief legal adviser to Commander, NAVSEA. You will participate in organizing and directing the Command's legal program, the largest within DON OGC (approximately 50 headquarter and over 100 field attorneys in 22 field offices nationwide).","WhoMayApply":{"Name":"","Code":""},"LowGrade":"00","HighGrade":"00","PromotionPotential":"None","OrganizationCodes":"DD/NV24","Relocation":"True","HiringPath":["fed-competitive","fed-excepted","land","ses"],"TotalOpenings":"1","AgencyMarketingStatement":"The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["You will formulate, coordinate, and administer a general legal program on all matters pertaining to the accomplishment of the plans, policies, and programs of the Command. You will supervise NAVSEA attorneys and legal staff.","You will provide legal support to NAVSEA in the procurement of supplies/services (including major systems acquisition and bid protests/claims); civilian personnel; environmental; intellectual property; litigation; fiscal and administrative matters.","You will serve as a senior advisor to senior NAVSEA leaders, Program Executive Officers (PEO), and other clients on business, policy, and other non-legal matters.","You will serve as a member of the DON OGC Deputies Committee and Executive Steering Group, where you will actively participate in strategic planning and governance of DON OGC.","You will serve as the NAVSEA liaison with other DON commands/organizations, military departments, the Government Accountability Office, and other Government agencies.","You will monitor proposed legislation and other congressional activities and prepare or review, as to legal, policy, and procedural issues, NAVSEA congressional correspondence/testimony, and interpret statutes, Executive Orders, and regulations.","You will act as Counsel in the absence of the Command Counsel."],"Education":"Applicant must have graduated from a law school accredited by the American Bar Association; be an active member in good standing of the bar of the highest court of a State, U.S. commonwealth, U.S. territory, or the District of Columbia; and be admitted to practice before a state or federal court.","Requirements":"","Evaluations":"Applicants that meet the basic qualifications requirements will be evaluated based on the quality and extent of their experience, training, and/or education indicated on their resume and the qualification responses described in the separate narrative statement. Resumes will be evaluated by a rating and ranking panel, and highly qualified candidates may be invited to participate in a structured interview. The Ad-hoc Executive Resources Board (AERB) will review results and make recommendations on final selections to the approving authority. If selected, you may be required to provide supporting documentation. All qualifications requirements must be met by the closing date of this announcement.","HowToApply":"Click the Apply Online button to create an account or log in to your existing USAJOBS account. To apply for this position, you must provide a complete Application Package which includes:\n1. Complete resume with relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g., GS-0201-09) for relevant federal experience.\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/11404204\n3. Supporting documentation Failure to submit a complete application package will result in an ineligible rating and loss of consideration. Your complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 03/31/2022. Applications received after 03/31/2022 will generally result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.","WhatToExpectNext":"When the application process is complete, your complete application (resume, assessment questionnaire, and all supporting documents) will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements. Generally, only best qualified candidates will be referred to the hiring manager. Sometimes well qualified and minimally qualified candidates are referred. Occasionally, candidates eligible for priority consideration are referred, and no other candidates are referred. The hiring manager may choose to conduct interviews. You will be notified of our rating and referral decision. If you are referred, you will be notified when a hiring decision is made.","RequiredDocuments":"You are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire. You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully support their claims will not be referred to the hiring manager. Cover letter is optional. A complete resume is required. Your resume must show relevant experience, job title, duties and accomplishments. Your resume must show complete information for each job entry to support minimum qualifications. The following information should be provided in your resume, but it is acceptable to provide elsewhere in your application package: employer's name, starting and end dates (Mo/Yr), hours per week, and pay plan, series and grade level (e.g. GS-0201-09) for relevant federal experience. Separate narrative statements are required. Your narrative statements must address the Executive Core Qualifications (ECQs) and Mandatory Technical Qualifications (MTQs) listed above. Are you a current or former SES Career employee appointed under Title 5 U.S.C. 3393? You must include a copy of your SES Career appointment personnel action or SF-50. Are you a graduate of an approved SES training program? You must provide a copy of your certificate of completion. Are you claiming membership in any professional organizations, or possession of a license, certificate or credentials? Check the Conditions of Employment section above to see if any are required. If you claim membership, license, certification, or credentials, you must submit a copy of said document in your application package. Is there a basic education requirement for this position? Are you using education as a substitute for some or all of the experience requirement? Check the Education section above to see what is allowed and what is required. Any claims you make in your resume or assessment questionnaire regarding education or degrees MUST be supported by submitting with your application official or unofficial transcripts or a list of courses, grades earned, completion dates, and quarter and semester hours earned issued from your school. While unofficial transcripts are acceptable for initial application, an official transcript will ultimately be required if you are selected for the position. You may submit a copy your degree(s) if specific coursework does not have to be verified. Are you an active duty service member? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You must provide an un-sanitized version of the documents if you are selected.","Benefits":"","BenefitsUrl":"http://www.secnav.navy.mil/donhr/Benefits/Pages/Default.aspx","BenefitsDisplayDefaultText":true,"OtherInformation":"COVID VACCINATION INFORMATION: To comply with the recent preliminary nationwide injunction on Executive Order 14043, Requiring Coronavirus Disease 2019 Vaccination for Federal Employees, the Department of the Navy is not taking any action to implement or enforce the COVID-19 vaccination requirement. New hires will need to provide their vaccination status as well as comply with workplace safety protocols related to masking, physical distancing, testing, travel, and quarantine. This position is in the Senior Executive Service (SES), a small elite group of top government leaders. SES members possess a diverse portfolio of experiences including strong skills to lead across organizations. As an executive, you will influence the direction of innovation and transformation of the federal government and lead the next generation of public servants. This position is not covered by the Department of Defense Priority Placement Program. Additional vacancies may be filled by this announcement. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online and request information about the Alternate Application process, please see the How To Apply section of this vacancy announcement. Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf. A relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized. This position is eligible for part time, full time or ad-hoc telework at the discretion of management.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"03","AnnouncementClosingType":"01","AgencyContactEmail":"DONExecutiveHiring.fct@navy.mil","AgencyContactPhone":"(360) 315-8094","SecurityClearance":"Secret","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}